[
	{
		"title": "ความพิการทางการเห็น ประเมินสมรรถภาพคนพิการตามแนวทางของ ICF",
		"items": {
			"b210": "การทำงานของการเห็น",
			"d460": "การเคลื่อนที่ไปในที่ต่างๆ",
			"d470": "การใช้การขนส่ง",
			"d570": "การรักษาสุขภาพตัวเอง",
			"d630": "การเตรียมอาหาร",
			"d640": "การทำงานบ้าน",
			"d839": "การศึกษา",
			"d870": "การพึ่งพาตนเองทางเศรษฐกิจ",
			"d910": "ชีวิตในชุมชน",
			"d920": "นันทนาการและกิจกรรมยามว่าง"
		}
	},
	{
		"title": "ความพิการทางการได้ยิน ประเมินสมรรถภาพคนพิการตามแนวทางของ ICF",
		"items": {
			"b230": "การทำงานด้านการได้ยิน",
			"d115": "การฟัง",
			"d310": "การรับการสื่อสารด้วยข้อความภาษาพูด",
			"d320": "การรับการสื่อสารด้วยข้อความภาษามือที่เป็นทางการ",
			"d340": "การสร้างข้อความที่เป็นภาษามือแบบเป็นทางการ",
			"d839": "การศึกษา",
			"d870": "การพึ่งพาตนเองทางเศรษฐกิจ",
			"d920": "นันทนาการและกิจกรรมยามว่าง"
		}
	}
]

												
							
												
												
		