<?php
/**
* Module Method
*
* @param Object $self
* @param Int $var
* @return String
*/

$debug = true;

function org_ah_view($self, $orgId = NULL, $viewId = NULL) {
	$orgInfo = is_object($orgId) ? $orgId : R::Model('org.get',$orgId, '{initTemplate: true}');
	$orgId = $orgInfo->orgid;

	R::View('org.toolbar',$self,'เขตสุขภาพ', 'ah', $orgInfo);
	$ret = '';

	$ret .= 'VIEW ID '.$viewId;
	
	$ret .= '<pre>
ชื่อประเด็น

ด้านการเกษตร : เกษตรและอาหารเพื่อสุขภาพ
เครือข่าย

เกษตรและอาหารเพื่อสุขภาพ
คำอธิบาย

- เกษตรและอาหารเพื่อสุขภาพเป็นการทำงานประเด็นหนึ่งที่นำไปสู่การสร้างคุณภาพชีวิตที่ดีของประชาชน เนื่องจากประชาชนในเขต 12 ส่วนใหญ่มีอาชีพด้านการเกษตรเป็นหลัก โดยเฉพาะกลุ่มอาชีพเกษตรกรชาวสวนยาง เป้าหมายคือให้ชาวสวนยางพออยู่พอกิน รวมทั้งส่งเสริมเกษตรเพื่อสุขภาพในกลุ่มนาข้าว ผัก ผลไม้ และประมงพื้นบ้าน
คุณลักษณะ

-สนับสนุนและสร้างความเข้มแข็งของภาคีเครือข่ายทั้ง 7 จังหวัด คือ ตรัง พัทลุง สงขลา สตูล ยะลา ปัตตานี และนราธิวาส -สนับสนุนด้านรูปธรรมเกษตรและอาหารเพื่อสุขภาพ -สร้างและขยายพื้นที่ต้นแบบในเขต 12 - ผลักดันข้อเสนอเชิงนโยบาย
เป้าหมายการทำงาน

1. ส่งเสริมและสนับสนุนการทำเกษตรพอเพียงในกลุ่มชาวสวนยาง กลุ่มปลูกผัก ไม้ผล ปศุสัตว์ และประมงพื้นบ้าน
2. ส่งเสริมและอนุรักษ์ฟื้นฟูพันธุกรรมพื้นบ้าน
3. เฝ้าระวังและติดตามการใช้สารเคมีอันตรายในภาคเกษตร
4. ส่งเสริมการเกษตรเพื่อสุขภาพ
5. ส่งเสริมการตลาดเพื่อสุขภาพ
6. วิจัยพัฒนาและการสื่อสารสารสนเทศ

<div class="map-canvas">ตำแหน่งประเด็น</div>


TAB => ตารางวิเคราะห์ที่ 1.2 | ตารางวิเคราะห์ที่ 1.3 | ตารางวิเคราะห์ที่ 1.4

##ตารางวิเคราะห์ที่ 1.2

สรุปภาพเส้นทางการพัฒนาเครือข่าย
	เหตุการณ์ 	การดำเนินการ 	ผลผลิต
1981-01 	สมาคมรักษ์ทะเลไทยเป็นองค์กรพัฒนาเอกชน ที่พัฒนาเติบโตมาจากโครงการพัฒนาชุมชนประมงขนาดเล็ก บ้านปากบางนาทับ อำเภอจะนะ จังหวัดสงขลา เมื่อปี 2524 ซึ่งถือเป็นองค์กรพัฒนาเอกชน พัฒนาชนบทองค์กรแรกของภาคใต้ที่เกิดจากความร่วมมือระหว่างโครงการปฏิรูปการเกษตรและพัฒนาชนบท (WCARRD) ร่วมกับโครงการจัดตั้งภาควิชาวาริชศาสตร์ คณะทรัพยากรธรรมชาติ มหาวิทยาลัยสงขลานครินทร์ วิทยาเขตหาดใหญ่ และได้ยื่นจดทะเบียนเป็น “สมาคมรักษ์ทะเลไทย” เมื่อวันที่ 9 กรกฎาคม 2550 โดยมีวัตถุประสงค์เพื่อร่วมมือและประสานงานกับรัฐและองค์กรเอกชนอื่นๆ ในการส่งเสริมพัฒนาคุณภาพชีวิตของชาวประมงพื้นบ้าน เพื่อส่งเสริมการอนุรักษ์และฟื้นฟูทรัพยากรทางทะเลและชายฝั่ง ตลอดจนเพื่อส่งเสริมการศึกษา ค้นคว้า วิจัย และพัฒนาองค์ความรู้ในการจัดการทรัพยากรที่ยั่งยืน มีพื้นที่เป้าหมายในการทำงานร่วมกับชุมชนประมงชายฝั่งในพื้นที่ 13 จังหวัดภาคใต้ตลอดจนถึงจังหวัดประจวบคีรีขันธ์ เพชรบุรี และรอบทะเลสาบสงขลา 	โดยมีผลการดำเนินงานที่ผ่านมา ได้แก่ การจัดตั้งและสนับสนุนองค์กรชาวประมงพื้นบ้าน/องค์กรพัฒนาเอกชน โดยสนับสนุนให้เกิดการรวมกลุ่มภายในชุมชนที่เข้มแข็งและพึ่งพาตนเองได้อย่างยั่งยืน จัดตั้งกลุ่มระดมทุนและกลุ่มออมทรัพย์ สนับสนุนกิจกรรมกลุ่มอาชีพ ยกระดับการทำงานของกลุ่มสตรี สนับสนุนให้มีการจัดตั้งกลุ่มองค์กรชาวประมงให้เป็นนิติบุคคลในรูปแบบสมาคม เช่น สมาคมเครือข่ายประมงพื้นบ้านอ่าวท่าศาลา จังหวัดนครศรีธรรมราช สมาคมชาวประมงรักษ์ทะเลสาบอำเภอปากพะยูน จังหวัดพัทลุง ส่งเสริมการอนุรักษ์และฟื้นฟูทรัพยากรทางทะเลและชายฝั่ง โดยสนับสนุนให้มีเวทีสาธารณะเพื่อระดมและแลกเปลี่ยนความคิดเห็นเกี่ยวกับการอนุรักษ์ทรัพยากรทางทะเลและชายฝั่งอย่างต่อเนื่อง สนับสนุนการศึกษาดูงานในพื้นที่กรณีศึกษา สนับสนุนการจัดตั้งศูนย์วิทยุเฝ้าระวังและอบรมการใช้วิทยุ “มดดำ มดแดง” ส่งเสริมพัฒนาเศรษฐกิจชุมชน/เศรษฐกิจการประมง โดยสนับสนุนในกิจกรรมแพชุมชน เพื่อส่งเสริมการทำเศรษฐกิจของชุมชนประมงขนาดเล็กและเป็นกองทุน พร้อมทั้งเป็นต้นแบบการศึกษาเรียนรู้เศรษฐกิจชุมชน โดยมีตัวอย่างแพชุมชนที่ประสบความสำเร็จจำนวน 2 กลุ่ม คือ 1) กลุ่มแพชุมชนบ้านคูขุด จังหวัดสงขลา 2) กลุ่มแพชุมชนบ้านช่องฟืน จังหวัดพัทลุง ดำเนินงานประสานความร่วมมือกับภาคีเครือข่าย เช่น จัดโครงการรณรงค์ร่วมกับกรีนพีซเอเชียตะวันออกเฉียงใต้ ภายใต้ชื่อ “ฟื้นชีวิตทะเลไทยกับเรือเอสเพอรันชา” รวบรวมข้อมูล และทดลองใช้พลังงานทางเลือก เช่น การทดลองใช้เรือใบในการทำประมง และการผลักดันให้มีการแก้ไขปัญหากฎหมาย คือ ร่างพระราชบัญญัติส่งเสริมการบริหารจัดการทรัพยากรทางทะเลและชายฝั่ง พ.ศ. .......... และร่างพระราชบัญญัติประมง (ฉบับที่ 4) พ.ศ. ........ นอกจากนี้ยังมีการผลิตสื่อสิ่งพิมพ์ และสื่ออื่นๆ เพื่อเผยแพร่รายงานกรณีศึกษาต่างๆ ในพื้นที่ รวมถึงนโยบายการจัดการทรัพยากรทางทะเลของภาครัฐ ได้แก่ เอกสารและสื่อสิ่งพิมพ์ จำนวน ๓๗ เล่ม หนังสั้น เรื่อง “หมอเปลี่ยนหัว” วีซีดี เรื่อง “สิทธิชุมชนกับการจัดการทรัพยากรชายฝั่งอย่างยั่งยืน” การผลิตรายการวิทยุทางคลื่น FM. 106 . 75 MHz อำเภอหาดใหญ่ จังหวัดสงขลา 	การดำเนินงานด้านนโยบายเพื่อผลักดันกฏหมายเกี่ยวกับประมงทะเลพื้นบ้าน
1989-10 	- ก่อตั้งเครือข่ายเกษตรกรรมทางเลือกภาคใต้ โดยความร่วมมือขององค์กรชาวบ้าน องค์กรพัฒนาเอกชน และนักวิชาการ เพื่อพัฒนาระบบเกษตรกรรมทางเลือกซึ่งเป็นระบบการเกษตรที่สอดคล้องกับระบบนิเวศ วิถีชีวิตชุมชน และสร้างการพึ่งตนเองของเกษตรกรรายย่อย 	- เครือข่ายทำงานด้านการพัฒนาความรู้ และการเคลื่อนไหวเพื่อแก้ไขปัญหาของเกษตรกรภายใต้สถานการณ์ทางเศรษฐกิจและสังคมที่พัฒนาไป มีการจัดประชุมระดมความเห็นจากองค์กรชาวบ้านเพื่อพัฒนายุทธศาสตร์การทำงานอย่างต่อเนื่อง รวมทั้งยกระดับการผลิต การแปรรูป และการตลาด โดยจัดเวทีเชื่อมโยงประสบการณ์ การอบรมดูงาน การทดลองหรือการวิจัยอย่างมีส่วนร่วม การพัฒนาเทคนิควิธีการการเกษตร รณรงค์ด้านนโยบายร่วมกับพันธมิตรและภาคีเครือข่ายอื่น สร้างประสิทธิภาพทางความรู้ และการขับเคลื่อนงาน เพื่อเผชิญกับปัญหาที่เกิดขึ้นทั้งในระดับประเทศและระหว่างประเทศร่วมกัน 	-เกิดเครือข่ายเกษตรกรรมทางเลือกภาคใต้ในการเชื่อมประสานองค์กรภาคีใน10พื้นที่ -มีกลไกขับเคลื่อนการทำงาน -มีพื้นที่รูปธรรมและพื้นที่ปฏิบัติการ
1997-01 	ศูนย์เรียนรู้คุณธรรมเพื่อเศรษฐกิจพอเพียง 	- ศูนย์เรียนรู้คุณธรรมเพื่อเศรษฐกิจพอเพียงก่อตั้งโดยอาจารณ์ภาณุ พิทักษ์เผ่า ได้จัดตั้งกลุ่มเกษตรกรขึ้นเพื่อรวมตัวกันให้มีเข้มแข็ง และต่อมาได้จดทะเบียนเป็นสมาคมเกษตรอินทรีย์วิถีไท ในปี พ.ศ. 2549 ต่อมาในปี พ.ศ. 2550–2551 ได้รับการสนับสนุนงบประมาณจากรัฐเพื่อปรับปรุงให้เป็นศูนย์เรียนรู้คุณธรรมเพื่อเศรษฐกิจพอเพียงจนถึงปัจจุบัน ทางศูนย์เรียนรู้คุณธรรมเพื่อเศรษฐกิจพอเพียงเน้นกิจกรรมฝึกอบรมโดยใช้หลักสูตร “เกษตรอินทรีย์วิถีไท” เพื่ออบรมให้กับเกษตรกรทั่วไป ซึ่งหลักสูตรประกอบด้วยการดำเนินชีวิตตามหลักเศรษฐกิจพอเพียง, การพึ่งพาตนเอง, เกษตรอินทรีย์วิถีพอเพียง และการปลูกพืชหลากหลายมีรายได้ตลอดปี ซึ่งหลักสูตรเหล่านี้ล้วนเกิดขึ้นจากประสบการณ์ของภาณุ พิทักษ์เผ่า ซึ่งคนคนที่ชอบคิด ชอบทำ จนสามารถสร้างนวัตกรรมใหม่ ๆ ที่เกี่ยวกับเกษตรกรรม ซึ่งผู้เข้าอบรมสามารถนำเอาความรู้ไปใช้ในการเลี้ยงชีพได้อย่างดีโดยยึดหลักพอเพียง ในการฟื้นฟูและส่งเสริมสุขภาพตามหลัก 8 อ. เป็นวิชาที่ว่าด้วยการปฏิบัติตนเพื่อสุขภาพที่ยั่งยืนโดยชี้ให้เห็นถึงโทษภัยในการรับประทานอาหารที่มีการปนเปื้อนสารเคมีรวมถึงที่มาของอาหารเหล่านั้นด้วย มีคำขวัญที่ว่า “กินทุกอย่างที่ปลูก ปลูกทุกอย่างที่กิน” โดยเน้นการปลูกพืชหลากหลายวิธี, การตอนกิ่งเพาะชำ, การปลูกผักคอนโดโดยไม่ใช้สารเคมี ยาฆ่าแมลง ยาฆ่าหญ้า แต่จะผลิตปุ๋ยจุลินทรีย์พื้นบ้านและสมุนไพรพื้นบ้านใช้เองอย่างครบวงจร ทางศูนย์เรียนรู้คุณธรรมเพื่อเศรษฐกิจพอเพียง มีอาคารฝึกอบรมมีอาคารที่พักแยกชาย-หญิง สามารถรองรับผู้เข้าอบรมได้ครั้งละประมาณ 60–100คน 	- มีฐานข้อมูลองค์ความรู้ ฐานข้อมูลภาคีเครือข่าย - มีหลักสูตรการเรียนรู้ในการพัฒนาของเกษตรกรร่วมกับธกส. - มีตลาดเพื่อสุขภาพกระจายในพื้นที่ต่างๆ - มีการผลักดันข้อเสนอเชิงนโยบาย
2005-03 	- สถาบันวิจัยระบบสุขภาพภาคใต้ มหาวิทยาลัยสงขลานครินทร์ (สวรส.ภาคใต้ มอ.) 	• - ส่งเสริมความเข้มแข็งขององค์กรผู้บริโภค ในพื้นที่จังหวัดสุราษฎร์ธานี จังหวัดสงขลา จังหวัดสตูล เพื่อสร้างพื้นที่รูปธรรมทางเลือกด้านเกษตรและอาหารปลอดภัย 	- มีภาคีเครือข่ายด้านเกษตรและอาหารปลอดภัย



##ตารางวิเคราะห์ที่ 1.3

สอบทานงานเด่นและทุนทางสังคมของเครือข่าย

นายกำราบ พานทอง

ที่อยู่ : ต.ทุ่งตำเสา อ.หาดใหญ่ จ.สงขลา 90110

ระดับการนำ : เครือข่าย...เครือข่าย พื้นที่ปฏิบัติการ...เครือข่ายเกษตรกรรมทางเลือกภาคใต้ 156/8 ม.3 ถ.เพชรเกษม ต.ทุ่งตำเสา อ.หาดใหญ่ จ.สงขลา 90110 โทร 086-6961225

งานหรือผลผลิต : - สนับสนุนองค์กรภาคประชาชนในการสร้างความเข้มแข็ง ต่อรอง ผลักดันในเชิงนโยบาย

ความเก่ง ความสามารถ : - วิทยากรบรรยาย - งานศึกษาวิจัย การจัดการความรู้ และการผลักดันเชิงนโยบาย


##ตารางวิเคราะห์ที่ 1.4


ลักษณะกิจกรรมการพัฒนาในพื้นที่ปฏิบัติการของแต่ละเครือข่ายที่ดำเนินการอยู่ และองค์กรที่เกี่ยวข้อง

TABLE :: พื้นทีปฏิบัติการ 	กิจกรรม การดำเนินงานที่ดำเนินการอยู่ 	การศึกษาวิจัย 	การสร้างการมีส่วนร่วม 	การเสริมสร้างความเข้มแข็ง 	พัฒนานโยบายสาธารณะ 	องค์กรที่เกี่ยวข้อง 
</pre>';

	//$ret .= print_o($orgInfo,'$orgInfo');

	return $ret;
}
?>