<?php
/**
* Project :: Fund Evalulate Manage Year 2564 Form
* Created 2020-10-25
* Modify  2020-10-25
*
* @param Object $self
* @param Object $fundInfo
* @param Int $tranId
* @param Boolean $editMode
* @return String
*
* @call project/fund/$orgId/eval.manage
*/

$debug = true;

function project_fund_eval_manage($self, $fundInfo, $tranId = NULL, $editMode = false) {
	if (!($orgId = $fundInfo->orgid)) return message('error', 'PROCESS ERROR:NO FUND');

	$isEdit = $fundInfo->right->edit;

	if ($isEdit && ($editMode || $tranId == 'new')) $editMode = true;
	if (is_numeric($tranId)) {
		$data = R::Model('qt.get', $tranId);
		//debugMsg($data, '$data');
		if ($data->qtForm == 103) return R::Page('project.fund.eval.manage.year60', $self, $fundInfo, $tranId, $editMode);
	}

	$header = $data->header;
	$rate = $data->rate;

	if ($isEdit && !$editMode) {
		$ret .= '<nav class="btn-floating -right-bottom -no-print">'
			. '<a class="sg-action btn -floating -circle48" href="'.url('project/fund/'.$orgId.'/eval.manage/'.$tranId.'/edit').'" data-rel="#main"><i class="icon -material">edit</i></a>'
			.'<a class="sg-action btn -floating -circle48" class="sg-action" href="'.url('project/fund/'.$orgId.'/info/eval.delete/'.$tranId).'" data-rel="none" data-done="reload:'.url('project/fund/'.$orgId.'/eval').'" data-title="ลบแบบประเมิน" data-confirm="ต้องการลบแบบประเมินนี้ กรุณายืนยัน?"><i class="icon -material">delete</i></a>'
			. '</nav>';
	}

	$form = new Form(
		'data',
		url('project/fund/'.$orgId.'/info/eval.save'),
		'project-fund-eval-form-ltc',
		'sg-form project-fund-eval-form -ltc'
	);

	$form->addData('checkValid',true);
	$form->addData('rel', 'notify');
	if ($data->qtRef) {
		$form->addData('done', 'load:#main:'.url('project/fund/'.$orgId.'/eval.manage/'.$data->qtRef));
	} else {
		$form->addData('done', 'reload:'.url('project/fund/'.$orgId.'/eval'));
	}

	$form->addConfig('title','แบบประเมินการบริหารจัดการกองทุนหลักประกันสุขภาพ');
	$form->addText('<h4 class="-sg-text-center">'.$fundInfo->name.' เขต '.$fundInfo->areaId.' จังหวัด'.$fundInfo->info->namechangwat.' อำเภอ'.$fundInfo->info->nameampur.'</h4>');

	$form->addField('qtform',array('type' => 'hidden','value' => 108));
	$form->addField('qtref',array('type' => 'hidden','value' => $data->qtRef));

	/*
	ชื่อกองทุน .........................................
	อำเภอ ............. จังหวัด .......................
	วันที่ประเมิน ......... เดือน ........... พ.ศ. 25 ....
	*/
	if ($editMode) {
		$form->addText('<div class="box -header">');

		$form->addField(
			'by',
			array(
				'type' => 'radio',
				'name' => 'header[HEADER.BY]',
				'label' => 'ประเมินโดย',
				'options' => array(
					'พี่เลี้ยงกองทุน' => 'พี่เลี้ยงกองทุน',
					'เจ้าหน้าที่กองทุน' => 'เจ้าหน้าที่กองทุน',
					'ทีมงานเจ้าหน้าที่อำเภอ' => 'ทีมงานเจ้าหน้าที่อำเภอ'
				),
				'require' => true,
				'value' => $header['HEADER.BY'],
				)
		);

		$form->addField(
			'year',
			array(
				'type' => 'select',
				'label' => 'ปีงบประมาณ :',
				'class' => '-fill',
				'require' =>true,
				'options' =>array(
					date('Y')-1=>date('Y')+543-1,
					date('Y')=>date('Y')+543,
					date('Y')+1=>date('Y')+543+1,
				),
				'value' =>sg_date(SG\getFirst($data->info->qtdate,date('Y-m-d')),'Y'),
			)
		);

		$form->addField(
			'evaldate',
			array(
				'type' => 'text',
				'name' => 'header[HEADER.EVALDATE]',
				'label' => 'วันที่ประเมิน',
				'class' => 'sg-datepicker -fill',
				'require' => true,
				'value' => $header['HEADER.EVALDATE'] ? sg_date($header['HEADER.EVALDATE'], 'd/m/Y') : date('d/m/Y'),
				'placeholder' => '01/31/2560',
			)
		);

		$form->addField(
			'collectname',
			array(
				'type' => 'text',
				'label' => 'ชื่อผู้บันทึก',
				'class' => '-fill',
				'require' =>true,
				'value' =>htmlspecialchars($data->info->collectname),
			)
		);

		$form->addField(
			'cid',
			array(
				'type' => 'text',
				'name' => 'header[HEADER.CID]',
				'label' => 'เลขบัตรประชาชน',
				'class' => '-fill',
				'require' =>true,
				'maxlength' =>13,
				'value' =>htmlspecialchars($header['HEADER.CID']),
			)
		);

		$form->addField(
			'email',
			array(
				'type' => 'text',
				'name' => 'header[HEADER.EMAIL]',
				'label' => 'อีเมล์',
				'class' => '-fill',
				'require' =>true,
				'value' =>htmlspecialchars($header['HEADER.EMAIL']),
			)
		);

		$form->addField(
			'phone',
			array(
				'type' => 'text',
				'name' => 'header[HEADER.PHONE]',
				'label' => 'เบอร์โทรศัพท์',
				'class' => '-fill',
				'require' =>true,
				'value' =>htmlspecialchars($header['HEADER.PHONE']),
			)
		);

		$form->addField(
			'position',
			array(
				'type' => 'text',
				'name' => 'header[HEADER.POSITION]',
				'label' => 'ตำแหน่ง',
				'class' => '-fill',
				'require' =>true,
				'value' =>htmlspecialchars($header['HEADER.POSITION']),
			)
		);

		$form->addField(
			'orgname',
			array(
				'type' => 'text',
				'name' => 'header[HEADER.ORGNAME]',
				'label' => 'หน่วยงาน',
				'class' => '-fill',
				'require' =>true,
				'value' =>htmlspecialchars($header['HEADER.ORGNAME']),
			)
		);

		$form->addText('</div><!-- box -->');

		$form->addText('<div class="box"><b>คำชี้แจง<br />1. มิติการประเมิน เป็นแบบประเมินตนเอง ประเมินโดยคณะกรรมการกองทุน และการประเมินจากทีมประเมิน<br />2. นำหลักคิด I-A-O-V มาใช้ประกอบการพิจารณาประเมิน</b><br />Input		ประสิทธิภาพ	1;ประสิทธิภาพการบริหารจัดการกองทุนฯ<br />Action		ประสิทธิภาพ	2;ประสิทธิภาพการบริหารเงินกองทุนฯ<br />Output		ประสิทธิผล	1;ประสิทธิผลการสนับสนุนโครงการ<br />Value		ประสิทธิผล	2;ประสิทธิผลการได้รับประโยชน์เชิงรูปธรรม (ทางสุขภาพ)<br /><br /><b>หลักเกณฑ์การให้คะแนนกองทุนหลักประกันสุขภาพในระดับท้องถิ่นหรือพื้นที่ กำหนดเกณฑ์การพิจารณา 4 ด้าน รวม 100 คะแนน [น้ำหนัก] ดังนี้ (ในแต่ละปีอาจมีการปรับค่าคะแนน)</b><br />1. ด้านประสิทธิภาพการบริหารจัดการกองทุนฯ 30 คะแนน<br />2. ด้านประสิทธิภาพการบริหารเงินจ่ายกองทุนฯ 20 คะแนน<br />3. ด้านประสิทธิผลการสนับสนุนโครงการ 25 คะแนน<br />4. ด้านประสิทธิผลการได้รับประโยชน์เชิงรูปธรรม (ทางสุขภาพ) 25 คะแนน</div>');

	}


	$qtList = array(
		// ============ หมวดที่ 1 : การบริหารจัดการงานกองทุนฯ I : Input ============
		array(
			'group' => 'หมวดที่ 1 : การบริหารจัดการงานกองทุนฯ I : Input',
			'point' => 30,
			),
		array(
			'qtid' => '01.1',
			'title' => '1.1 มีการจัดทำและอนุมัติแผนการเงินประจำปี/โครงการ/กิจกรรม ภายใน 31 ธันวาคม ตามวงเงินประมาณการรายรับและหรือเงินคงเหลือ โดยให้สอดคล้องกับวัตถุประสงค์ของกองทุนฯ',
			'point' => 8,
			'detail' => '<b>แหล่งข้อมูล</b> 1) จากรายงานการประชุม กก.กองทุน 2) แผน/โครงการ/กิจกรรม',
			'checkbox' => array(
				1 => array('label' => '1. มีการจัดทำแผน = 2 คะแนน', 'point' => 2),
				2 => array('label' => '2. มีการอนุมัติแผน = 2 คะแนน', 'point' => 2),
				3 => array('label' => '3. อนุมัติแผนภายในวันที่ 31 ธันวาคม ของปีงบประมาณนั้น = 2 คะแนน', 'point' => 2),
				4 => array('label' => '4. แผนสอดคล้องกับวัตถุประสงค์ของกองทุน (ครอบคลุมฯ/ส่งเสริม/ป้องกันฯ/ ฟื้นฟูฯ/รักษาฯ) = 2 คะแนน', 'point' => 2),
			),
		),
		array(
			'qtid' => '01.2',
			'title' => '1.2 มีการเห็นชอบรายงานการเงิน และบันทึกรายงานผ่านโปรแกรมกองทุนตำบล ทุกไตรมาส',
			'point' => 6,
			'detail' => '<b>แหล่งข้อมูล:</b> 1) จากรายงานการประชุม คณะกรรมการกองทุน 2) รายงาน 3) โปรแกรม',
			'checkbox' => array(
				1 => array('label' => '1. บันทึกข้อมูลการเงินในโปรแกรมและprint เสนอเอกสารต่อ กก.กองทุนเห็นชอบ = 1 คะแนน', 'point' => 1),
				2 => array('label' => '2. ลงนามในรายงานครบถ้วนและสแกนแนบ File ส่งผ่านหน้าเว็บไซต์ = 1 คะแนน', 'point' => 1),
				3 => array('label' => '3. ส่งรายงานครบ 4 ไตรมาส (เอกสารแนบมาข้อ 2) = 2 คะแนน', 'point' => 2),
				4 => array('label' => '4. ผู้รายงานการเงินที่ในที่ประชุมกรรมการกองทุนฯ เป็นหัวหน้าหน่วยงานคลังหรือ จนท.หน่วยงานคลัง หรือ อนุฯ กก./คทง.การเงินฯ ของกองทุน = 2 คะแนน', 'point' => 2),
			),
		),
		array(
			'title' => '1.3 เอกสาร/หลักฐานการเบิกจ่ายจ่ายเงิน ครบถ้วน ถูกต้อง เป็นปัจจุบัน',
			'point' => 8
		),
		array(
			'qtid' => '01.3.1',
			'title' => '1.3.1 โดยการสุ่มตรวจเอกสาร',
			'point' => 6,
			'detail' => '<b>เป้าหมาย/แนวทางประเมิน/เกณฑ์การให้คะแนน:</b> สุ่มตรวจเอกสารโครงการ จำนวน 3 โครงการซึ่งประกอบด้วย 1) โครงการ 2) รายงานการประชุมที่ กก.อนุมัติ 3) บันทึกข้อตกลง 4) ฎีกาเบิกจ่าย 5) ใบสำคัญรับเงิน/ใบเสร็จรับเงิน<br /><b>แหล่งข้อมูล:</b> แฟ้มเอกสารการเงิน',
			'radio' => array(
				6 => '1. มีเอกสารหลักฐานครบถ้วน = 6 คะแนน',
				3 => '2. มีหลักฐานไม่ครบทุกรายงาน = 3 คะแนน',
				0 => '3. ไม่มีหลักฐาน = 0 คะแนน',
			),
		),
		array(
			'qtid' => '01.3.2',
			'title' => '1.3.2 กองทุนมีเอกสารเบิกจ่ายการเงินในหมวดบริหารจัดการกองทุนฯ 10(4) ครบถ้วนถูกต้อง',
			'point' => 2,
			'detail' => '<b>เป้าหมาย/แนวทางประเมิน/เกณฑ์การให้คะแนน:</b> ตรวจสอบฎีกาทุกฎีกา หมวด 10(4)<br /><b>แหล่งข้อมูล:</b> แฟ้มเอกสารการเงิน',
			'radio' => array(
				2 => '1. มีเอกสาร หลักฐาน ครบถ้วนถูกต้องทุกฎีกา = 2 คะแนน',
				0 => '2. มีเอกสารหลักฐานไม่ครบถ้วนหรือไม่ถูกต้อง = 0 คะแนน',
			),
		),
		array(
			'title' => '1.4 การบริหารจัดการอย่างมีส่วนร่วม',
			'point' => 8
		),
		array(
			'qtid' => '01.4.1',
			'title' => '1.4.1 การได้มาซึ่งการคัดเลือกกรรมการและปฏิบัติงานตามบทบาทหน้าที่ตามประกาศ พ.ศ. 2561 4 คะแนน',
			'point' => 4,
			'detail' => '<b>แหล่งข้อมูล:</b> พิจารณาองค์ประกอบตามประกาศ พ.ศ. 2561 ข้อ 12',
			'radio' => array(
				4 => '1. ครบถ้วนถูกต้อง = 4 คะแนน',
				0 => '2. ไม่ครบถ้วน/ไม่ถูกต้อง = 0 คะแนน',
			),
		),
		array(
			'qtid' => '01.4.2',
			'title' => '1.4.2 มีการพัฒนาศักยภาพ/องค์ความรู้ คณะกรรมการกองทุนฯ/อนุกรรมการ/คณะทำงาน (ใช้งบบริหารจัดการ 10 (4)',
			'point' => 2,
			'detail' => '<b>แหล่งข้อมูล:</b> แผนการใช้เงินตามหมวด ข้อ 10(4)',
			'radio' => array(
				2 => 'มีแผนและใช้จ่ายงบประมาณเพื่อพัฒนาศักยภาพฯ คณะกก. กองทุนฯ = 2 คะแนน',
				0 => 'ไม่มีแผน',
			),
		),
		array(
			'qtid' => '01.4.3',
			'title' => '1.4.3 มีการเผยแพร่ประชาสัมพันธ์เชิงรุก เผยแพร่ผลงาน การทำงานกองทุนฯ (1) มีการเผยแพร่ประชาสัมพันธ์ (2) เผยแพร่ผลงาน/งานวิชาการ',
			'point' => 2,
			'detail' => '<b>เป้าหมาย/แนวทางประเมิน/เกณฑ์การให้คะแนน:</b> มีการประชาสัมพันธ์อย่างหลากหลาย (อย่างน้อย 3 ช่องทาง)<br /><b>แหล่งข้อมูล</b>: จากป้ายประชาสัมพันธ์/วิทยุท้องถิ่น/หอกระจายข่าว/สื่อท้องถิ่น/สื่อออนไลน์ช่องทางต่าง ๆ',
			'checkbox' => array(
				1 => array('label' => '1. มีการเผยแพร่ประชาสัมพันธ์ = 1 คะแนน', 'point' => 1),
				2 => array('label' => '2. มีการเผยแพร่ผลงาน/งานวิชาการ = 1 คะแนน', 'point' => 1),
			),
		),


		// ============ หมวดที่ 2 : การบริหารเงินกองทุนฯ A : Action ============
		array(
			'group' => 'หมวดที่ 2 : การบริหารเงินกองทุนฯ A : Action',
			'point' => 20,
		),
		array(
			'qtid' => '02.1',
			'title' => '2.1 มีการเบิกจ่ายเงินกองทุนให้หน่วยงานที่ขอรับงบประมาณเป็นไปตามแผนงานโครงการที่ได้รับอนุมัติ (สอดคล้องตามประกาศฯ)',
			'point' => 4,
			'detail' => '<b>แหล่งข้อมูล:</b> ข้อมูล เว็บไซต์ 1) รายงาน 2) โปรแกรม',
			'radio' => array(
				4 => '1. มีการเบิกจ่ายเป็นไปตามแผน/โครงการ มากกว่า 90% = 4 คะแนน',
				3 => '2. มีการเบิกจ่ายเป็นไปตามแผน/โครงการ  คิดเป็น 70%-89% = 3 คะแนน',
				2 => '3. มีการเบิกจ่ายเป็นไปตามแผน/โครงการ  คิดเป็น 60%-69% = 2 คะแนน',
				1 => '4. มีการเบิกจ่ายเป็นไปตามแผน/โครงการ  คิดเป็น 50%-59% = 1 คะแนน',
				0 => '5. มีการเบิกจ่ายเป็นไปตามแผน/โครงการ คิดเป็น 0%-49% = 0 คะแนน',
			),
		),
		array(
			'qtid' => '02.2',
			'title' => '2.2 อัตราการการเบิกเงินกองทุนในปีงบประมาณ (รวมเงินคงเหลือ) ณ สิ้นไตรมาส 4',
			'point' => 6,
			'detail' => '<b>แหล่งข้อมูล:</b> ข้อมูล เว็บไซต์ 1) รายงาน 2) โปรแกรม',
			'checkbox' => array(
				1 => array('label' => '1. การเบิกจ่ายเป็นไปตามแผนงานโครงการไตรมาส 1-ไตรมาส 2 ตั้งแต่ 20% ขึ้นไป = 2 คะแนน', 'point' => 2),
				2 => array('label' => '2. การเบิกจ่ายเป็นไปตามแผนงานโครงการไตรมาส 3 ตั้งแต่ 50% ขึ้นไป = 2 คะแนน', 'point' => 2),
				3 => array('label' => '3. การเบิกจ่ายเป็นไปตามแผนงานโครงการไตรมาส 4 ตั้งแต่ 80% ขึ้นไป = 2 คะแนน', 'point' => 2),
			),
		),
		array(
			'qtid' => '02.3',
			'title' => '2.3 มีการสมทบเงินของ อปท.',
			'point' => 6,
			'detail' => '<b>แหล่งข้อมูล:</b> ข้อมูล เว็บไซต์ 1) รายงาน 2) โปรแกรม',
			'radio' => array(
				6 => '1. สมทบภายในไตรมาส 1 = 6 คะแนน',
				4 => '2.สมทบภายในไตรมาส 2 = 4 คะแนน',
				3 => '3.สมทบภายในไตรมาส 3 = 3 คะแนน',
				1 => '4.สมทบภายในไตรมาส 4 = 1 คะแนน',
			),
		),
		array(
			'qtid' => '02.4',
			'title' => '2.4 มีระบบบัญชีของกองทุน (ตามที่สำนักงานกำหนด)',
			'point' => 4,
			'detail' => '<b>แหล่งข้อมูล:</b> ข้อมูล เว็บไซต์ 1) รายงาน 2) โปรแกรม',
			'radio' => array(
				4 => '1. มีครบถ้วนและถูกต้อง = 4 คะแนน',
				2 => '2. มี ไม่ครบถ้วนหรือไม่ถูกต้อง = 2 คะแนน',
				0 => '3. ไม่มีการจัดทำบัญชี = 0 คะแนน',
			),
		),


		// ============ 3. การสนับสนุนโครงการ O : Output ============
		array(
			'group' => '3. การสนับสนุนโครงการ O : Output',
			'point' => 25,
		),
		array(
			'title' => '3.1 มีการจัดทำแผนงาน/โครงการอย่างมีส่วนร่วมในการดูแลสุขภาพประชาชนในพื้นที่',
			'point' => 12,
		),
		array(
			'qtid' => '03.1.1',
			'title' => '3.1.1 มีการจัดทำแผนงาน/โครงการอย่างมีส่วนร่วม 8 กลุ่ม',
			'point' => 6,
			'detail' => '<b>เป้าหมาย/แนวทางประเมิน/เกณฑ์การให้คะแนน:</b> ได้แก่ 1) กลุ่มหญิงตั้งครรภ์และหญิงหลังคลอด 2) กลุ่มเด็กเล็กและเด็กก่อนวัยเรียน 3) กลุ่มเด็กวัยเรียนและเยาวชน 4)  กลุ่มวัยทำงาน 5) กลุ่มผู้สูงอายุ 6) กลุ่มผู้ป่วยโรคเรื้อรัง 7) กลุ่มคนพิการและทุพพลภาพ 8) กลุ่มประชาชนทั่วไปที่มีภาวะเสี่ยง<br /><b>แหล่งข้อมูล:</b> 1) จากรายงานการประชุม กก.กองทุน 2) รายงาน 3) โปรแกรม',
			'radio' => array(
				6 => '1. มีกระบวนการโดยประชาชนมีส่วนร่วมได้มาซึ่งแผนงาน/โครงการจัดบริการสาธารณสุขให้กับกลุ่มเป้าหมายทั้ง 7-8 กลุ่ม = 6 คะแนน',
				4 => '2. มีกระบวนการโดยประชาชนมีส่วนร่วมได้มาซึ่งแผนงาน/โครงการจัดบริการสาธารณสุขให้กับกลุ่มเป้าหมายครอบคลุม 5-6 กลุ่มเป้าหมาย = 4 คะแนน',
				2 => '3. มีกระบวนการโดยประชาชนมีส่วนร่วมได้มาซึ่งแผนงาน/โครงการจัดบริการสาธารณสุขให้กับกลุ่มเป้าหมายครอบคลุม 3-4 กลุ่มเป้าหมาย = 2 คะแนน',
				1 => '4. มีแผนงาน แต่ไม่มีกระบวนการมีส่วนร่วม = 1 คะแนน',
				0 => '5. ไม่มีแผนงาน = 0 คะแนน',
			),
		),
		array(
			'qtid' => '03.1.2',
			'title' => '3.1.2 โครงการในแผนงาน ได้รับอนุมัติและจ่ายเงินให้ดำเนินการครบทุกโครงการ',
			'point' => 6,
			'detail' => '<b>แหล่งข้อมูล:</b> 1) จากรายงานการประชุม กก.กองทุน 2) รายงาน 3) โปรแกรม',
			'radio' => array(
				6 => '1. โครงการในแผนงานได้รับอนุมัติและจ่ายเงินให้ดำเนินการครบทุกโครงการ (ร้อยละ 100) = 6 คะแนน',
				4 => '2. โครงการในแผนงานได้รับอนุมัติและจ่ายเงินให้ดำเนินการไม่น้อยกว่าร้อยละ 70 ของโครงการทั้งหมด = 4 คะแนน',
				2 => '3. - โครงการในแผนงานได้รับอนุมัติและจ่ายเงินให้ดำเนินการไม่น้อยกว่าร้อยละ 50 ของโครงการทั้งหมด = 2 คะแนน',
				1 => '4. โครงการในแผนงานได้รับอนุมัติและจ่ายเงินให้ดำเนินการไม่น้อยกว่าร้อยละ 30 ของโครงการทั้งหมด = 1 คะแนน',
				0 => '5. ไม่มีโครงการในแผนงานได้รับอนุมัติและจ่ายเงิน = 0 คะแนน',
			),
		),
		array(
			'qtid' => '03.2',
			'title' => '3.2 มีการสรุปผลงานโครงการ พร้อมรายงานผลในที่ประชุม กก.กองทุนฯ ภายในสิ้นปีงบประมาณ (สิ่งส่งมอบ)',
			'point' => 13,
			'detail' => '<b>แหล่งข้อมูล:</b> 1) จากรายงานการประชุม กก.กองทุน 2) รายงาน 3) โปรแกรม',
			'radio' => array(
				13 => '1. มีสรุปผลงานโครงการและปรากฏในรายงานการประชุมคณะกรรมการ ครบทุกโครงการ = 13 คะแนน',
				10 => '2. มีสรุปผลงานโครงการและปรากฏในรายงานการประชุมคณะกรรมการ ไม่น้อยกว่าร้อยละ 70 = 10 คะแนน',
				7 => '3. มีสรุปผลงานโครงการและปรากฏในรายงานการประชุมคณะกรรมการ ไม่น้อยกว่าร้อยละ 50 = 7 คะแนน',
				5 => '4. มีสรุปผลงานโครงการและปรากฏในรายงานการประชุมคณะกรรมการ ไม่น้อยกว่าร้อยละ 30 = 5 คะแนน',
				3 => '4. มีสรุปผลงานโครงการและปรากฏในรายงานการประชุมคณะกรรมการ น้อยกว่าร้อยละ 30 = 3 คะแนน',
				0 => '4. ไม่มีการรายงานสรุปผล = 0 คะแนน',
			),
		),


		// ============ 4. การได้รับประโยชน์เชิงรูปธรรม (ทางสุขภาพ) V : Value ============
		array(
			'group' => '4. การได้รับประโยชน์เชิงรูปธรรม (ทางสุขภาพ) V : Value',
			'point' => 25,
		),
		array(
			'qtid' => '04.1',
			'title' => '4.1 มีผลงานที่แสดงให้เห็นถึงความครอบคลุมทุกกลุ่มเป้าหมายได้รับบริการสาธารณสุข 8 กลุ่มตามโปรแกรม',
			'point' => 10,
			'detail' => '<b>เป้าหมาย/แนวทางประเมิน/เกณฑ์การให้คะแนน:</b> 1) กลุ่มหญิงตั้งครรภ์และหญิงหลังคลอด 2) กลุ่มเด็กเล็กและเด็กก่อนวัยเรียน 3) กลุ่มเด็กวัยเรียนและเยาวชน 4) กลุ่มวัยทำงาน 5) กลุ่มผู้สูงอายุ 6) กลุ่มผู้ป่วยโรคเรื้อรัง 7) กลุ่มคนพิการและทุพพลภาพ 8) กลุ่มประชาชนทั่วไปที่มีภาวะเสี่ยง<br /><b>แหล่งข้อมูล:</b> 1) จากรายงานการประชุม กก.กองทุน 2) รายงาน 3) โปรแกรม',
			'radio' => array(
				10 => '1. โครงการที่ดำเนินการสามารถแก้ไขปัญหาตามวัตถุประสงค์ที่กำหนด ครอบคลุม 8 กลุ่มเป้าหมาย = 10 คะแนน',
				7 => '2. โครงการที่ดำเนินการสามารถแก้ไขปัญหาตามวัตถุประสงค์ที่กำหนด ครอบคลุม 5-7 กลุ่มเป้าหมาย = 7 คะแนน',
				5 => '3. โครงการที่ดำเนินการสามารถแก้ไขปัญหาตามวัตถุประสงค์ที่กำหนด ครอบคลุม 1-4 กลุ่มเป้าหมาย = 5 คะแนน',
				0 => '4. ไม่มีการดำเนินโครงการ = 0 คะแนน',
			),
		),
		array(
			'qtid' => '04.2',
			'title' => '4.2 มีผลงานเด่น/นวัตกรรมที่แก้ไขปัญหาสุขภาพพื้นที่ของกลุ่มเป้าหมาย (เน้นผลงานที่ครอบคลุม)',
			'point' => 15,
			'detail' => '<b>แหล่งข้อมูล:</b> 1) จากรายงานการประชุม กก.กองทุน 2) รายงาน 3) โปรแกรม',
			'radio' => array(
				15 => '1. มีผลงานเด่น/นวตกรรมที่แก้ไขปัญหาสุขภาพพื้นที่จำนวน 3 เรื่อง = 15 คะแนน',
				13 => '2. มีผลงานเด่น/นวตกรรมที่แก้ไขปัญหาสุขภาพพื้นที่จำนวน 2 เรื่อง = 13 คะแนน',
				10 => '3. มีผลงานเด่น/นวตกรรมที่แก้ไขปัญหาสุขภาพพื้นที่จำนวน 1 เรื่อง = 10 คะแนน',
				7 => '4. ไม่มีผลงานเด่น/นวัตกรรม แต่แก้ไขปัญหาสุขภาพพื้นที่ได้ ครบตามกลุ่มเป้าหมาย = 7 คะแนน',
				5 => '5. ไม่มีผลงานเด่น/นวัตกรรม แก้ไขปัญหาสุขภาพพื้นที่ได้ แต่ไม่ครบตามกลุ่มเป้าหมาย = 5 คะแนน',
			),
		),
	);





	$tables = new Table();
	$tables->addClass('project-fund-eval-table');
	$tables->addConfig('showHeader', false);
	$tables->thead = array(
		'เกณฑ์การประเมิน',
		'maxpoint -center' => 'คะแนนเต็ม',
		'getpoint -center' => 'คะแนนที่ได้'
	);

	foreach ($qtList as $item) {
		if ($item['group']) {
			$tables->rows[] = '<header>';
			$tables->rows[] = array(
				'<h4>'.$item['group'].'</h4>',
				$item['point'],
				'',
				'config' => '{class: "-group"}',
			);
		}
		if ($item['title']) {
			$tables->rows[] = array(
				'<b>'.$item['title'].'</b>',
				$item['point'],
				'',
				'config' => '{class: "-title"}',
			);
		}
		if ($item['detail']) {
			$tables->rows[] = array($item['detail'], '', '', 'config' => '{class: "-detail"}');
		}
		if ($item['qtid']) {
			if ($item['radio']) {
				foreach ($item['radio'] as $point => $value) {
					$row = array();
					$radioText = '<label class="'.($editMode ? '' : '-disabled').'">'
						. '<input class="-hidden" type="radio" name="rate[RATE.'.$item['qtid'].']" value="'.$point.'" '.(isset($data->tran['RATE.'.$item['qtid']]->rate) && $data->tran['RATE.'.$item['qtid']]->rate == $point ? 'checked="checked"' : '').'/>'
						. $value
						. '<i class="icon -material">check_circle</i>'
						. '</label>';
					$row[] = '<td colspan="2">'.$radioText.'</td>';
					$row[] = '('.$point.')';
					$row['config'] = array('class' => '-qtitem');
					$tables->rows[] = $row;
				}
			} else if ($item['checkbox']) {
				foreach ($item['checkbox'] as $qtSubId => $qtItem) {
					$row = array();
					$qtKeyName = 'RATE.'.$item['qtid'].'.'.$qtSubId;
					$checkBoxText = '<label class="'.($editMode ? '' : '-disabled').'">'
						. '<input type="hidden" name="rate['.$qtKeyName.']" value="0" />' // When Checkbox is Uncheck, use this value
						. '<input class="-hidden" type="checkbox" name="rate['.$qtKeyName.']" value="'.$qtItem['point'].'" '.(isset($data->tran[$qtKeyName]->rate) && $data->tran[$qtKeyName]->rate == $qtItem['point'] ? 'checked="checked"' : '').'/>'
						. $qtItem['label']
						. '<i class="icon -material">check_box</i>'
						. '</label>';
					$row[] = '<td colspan="2">'.$checkBoxText.'</td>';
					$row[] = '('.$qtItem['point'].')';
					$row['config'] = array('class' => '-qtitem');
					$tables->rows[] = $row;
				}
			}
		}
	}
	$tables->rows[] = array('<b>รวมคะแนน</b>', 100, number_format($data->info->rates));
	$tables->rows[] = array('<td colspan="3"><b>Grade A+</b> 90-100 คะแนน = กองทุนที่มีศักยภาพสูง สามารถเป็นศูนย์เรียนรู้</td>');
	$tables->rows[] = array('<td colspan="3"><b>Grade A</b> 70-89 คะแนน = กองทุนที่มีศักยภาพดี</td>');
	$tables->rows[] = array('<td colspan="3"><b>Grade B</b> 50-69 คะแนน = กองทุนที่มีศักยภาพปานกลาง</td>');
	$tables->rows[] = array('<td colspan="3"><b>Grade C</b> 0-49 คะแนน = กองทุนที่ยังขาดความพร้อมต้องเร่งพัฒนา</td>');

	$form->addText($tables->build());


	if ($editMode) {
		$form->addField(
			'comment',
			array(
				'type' => 'textarea',
				'name' => 'header[HEADER.COMMENT]',
				'label' => 'ความเห็นเพิ่มเติมของคณะกรรมการกองทุนฯ (ประเมินตนเอง) / ทีมประเมิน (ภายนอก)',
				'class' => '-fill',
				'rows' => 5,
				'value' => $header['HEADER.COMMENT'],
			)
		);

		/*
		ผู้ประเมิน

		ลงชื่อ............................................................
		(                                                )
		ลงชื่อ............................................................
		(                                                )
		ลงชื่อ............................................................
		(                                                )
		ลงชื่อ............................................................
		(                                                )
		ลงชื่อ............................................................
		(                                                )
		วันที่ .......... เดือน ................................ พ.ศ. 25...........

		ตัวแทนคณะกรรมการกองทุนรับทราบผลการประเมิน
		ลงชื่อ.....................................................................
		(                                                    )
		ประธานกรรมการกองทุนหลักประกันสุขภาพ (อบต./เทศบาล)
		..........................................................................................
		วันที่ ........... เดือน ............................... พ.ศ. 25………..
		*/

		$form->addField(
			'submit',
			array(
				'type' => 'button',
				'value' => '<i class="icon -material">done_all</i><span>{tr:SAVE}</span>',
				'pretext' => '<a class="btn -link -cancel" href="'.url('project/fund/'.$orgId.($data->qtRef ? '/eval.manage/'.$data->qtRef : '/eval')).'"><i class="icon -material">cancel</i><span>{tr:CANCEL}</span></a>',
				'container' => '{class: "-no-print"}',
				)
			);
	}

	$ret .= $form->build();

	//$ret .= print_o($data, '$data');
	return $ret;
}
?>