<?php
/**
* Project :: Fund Estimation Form
* Created 2020-06-07
* Modify  2020-06-07
*
* @param Object $self
* @param Object $fundInfo
* @param Object $data
* @param Boolean $editMode
* @return String
*
* @call project/fund/$orgId/estimate.form
*/

$debug = true;

function project_fund_eval_operate_form($self, $fundInfo, $data = NULL, $editMode = false) {
	if (!($orgId = $fundInfo->orgid)) return message('error', 'PROCESS ERROR:NO FUND');

	$isEdit = $fundInfo->right->edit;

	if ($isEdit && empty($data)) $editMode = true;

	$header = $data->header;
	$rate = $data->rate;

	$form = new Form('yearestimate',url('project/fund/'.$orgId.'/info/estimate.save'),'form-yearestimate','form-yearestimate sg-form');
	$form->addData('checkValid',true);
	$form->addData('rel', 'notify');
	if ($data->qtref) {
		$form->addData('done', 'load:#main:'.url('project/fund/'.$orgId.'/estimate/'.$data->qtref));
	} else {
		$form->addData('done', 'reload:'.url('project/fund/'.$orgId.'/estimate/'.$data->qtref));
	}

	$form->addConfig('title','แบบประเมินการบริหารจัดการกองทุนหลักประกันสุขภาพในระดับท้องถิ่นหรือพื้นที่ สำนักงานหลักประกันสุขภาพแห่งชาติ');

	$form->addField('qtref',array('type'=>'hidden','value'=>$data->qtref));

	if ($editMode) {
		$form->addField('b1_s','<div class="box">');

		$form->addField(
			'by',
			array(
				'type'=>'radio',
				'name'=>'header[HEADER.BY]',
				'label'=>'ประเมินโดย',
				'options'=>array(
					'เจ้าหน้าที่กองทุน'=>'เจ้าหน้าที่กองทุน',
					'ทีมงานเจ้าหน้าที่อำเภอ'=>'ทีมงานเจ้าหน้าที่อำเภอ'
				),
				'require'=>true,
				'value'=>$header['HEADER.BY'],
				)
		);

		$form->addField(
			'area',
			array(
				'type'=>'textfield',
				'label'=>'เขต จังหวัด อำเภอ',
				'require'=>true,
				'value'=>'12',
				)
		);

		$form->addField(
			'fundid',
			array(
				'type'=>'textfield',
				'label'=>'กองทุน',
				'require'=>true,
				'value'=>$fundInfo->name,
			)
		);

		$form->addField(
			'year',
			array(
				'type'=>'select',
				'label'=>'ปีงบประมาณ :',
				'class'=>'-fill',
				'require'=>true,
				'options'=>array(
					date('Y')-1=>date('Y')+543-1,
					date('Y')=>date('Y')+543,
					date('Y')+1=>date('Y')+543+1,
				),
				'value'=>sg_date(SG\getFirst($data->info->qtdate,date('Y-m-d')),'Y'),
			)
		);

		$form->addField(
			'collectname',
			array(
				'type'=>'text',
				'label'=>'ชื่อผู้บันทึก',
				'class'=>'-fill',
				'require'=>true,
			'value'=>htmlspecialchars($data->info->collectname),
				)
		);

		$form->addField(
			'cid',
			array(
				'type'=>'text',
				'name'=>'header[HEADER.CID]',
				'label'=>'เลขบัตรประชาชน',
				'class'=>'-fill',
				'require'=>true,
				'maxlength'=>13,
				'value'=>htmlspecialchars($header['HEADER.CID']),
			)
		);

		$form->addField(
			'email',
			array(
				'type'=>'text',
				'name'=>'header[HEADER.EMAIL]',
				'label'=>'อีเมล์',
				'class'=>'-fill',
				'require'=>true,
				'value'=>htmlspecialchars($header['HEADER.EMAIL']),
			)
		);

		$form->addField(
			'phone',
			array(
				'type'=>'text',
				'name'=>'header[HEADER.PHONE]',
				'label'=>'เบอร์โทรศัพท์',
				'class'=>'-fill',
				'require'=>true,
				'value'=>htmlspecialchars($header['HEADER.PHONE']),
			)
		);

		$form->addField(
			'position',
			array(
				'type'=>'text',
				'name'=>'header[HEADER.POSITION]',
				'label'=>'ตำแหน่ง',
				'class'=>'-fill',
				'require'=>true,
				'value'=>htmlspecialchars($header['HEADER.POSITION']),
			)
		);

		$form->addField(
			'orgname',
			array(
				'type'=>'text',
				'name'=>'header[HEADER.ORGNAME]',
				'label'=>'หน่วยงาน',
				'class'=>'-fill',
				'require'=>true,
				'value'=>htmlspecialchars($header['HEADER.ORGNAME']),
			)
		);

		$form->addField('b1_e','<br clear="all" /></div><!-- box -->');


		$form->addField('h1','<h3 class="clear">วัตถุประสงค์ของแบบประเมิน</h3>');
	}

	$qtList[]=array(
		'group'=>'ก. การบริหารจัดการกองทุน (30 คะแนน)',
		'point'=>30,
	);

	$qtList[]=array(
		'id'=>'1',
		'title'=>'ศักยภาพของคณะกรรมการบริหารกองทุน',
		'point'=>12,
		'detail'=>'<b>เป้าหมาย:</b><br />
		คณะกรรมการมีศักยภาพในการบริหารจัดการให้เป็นไปตามวัตถุประสงค์ของกองทุน สอดคล้องกับสภาพปัญหาและความต้องการของชุมชนจนนำไปสู่การปรับเปลี่ยนพฤติกรรมด้านสุขภาพของประชาชน รวมทั้งการบริหารจัดการงบประมาณกองทุนมีความโปร่งใสและสามารถตรวจสอบได้<br />
		<b>แนวทางประเมินของทีมประเมิน:</b><br />
		สอบถามหรือสัมภาษณ์หรือสนทนากลุ่ม กรรมการกองทุนอย่างน้อย 8 คน หรือพิจารณาจากข้อมูลการนำเสนอ เอกสารอ้างอิง กระบวนการพิจารณาอนุมัติแผนงาน โครงการ ว่าทำกันอย่างไร ใครมีบทบาทอะไร ผลที่ได้เป็นอย่างไร และเป็นที่ยอมรับของคณะกรรมการหรือไม่ ฯลฯ<br />
		<b>แหล่งข้อมูล:</b><br />
		ระเบียบกองทุน แผนที่ทางเดินยุทธศาสตร์หรือแผนสุขภาพชุมชน ข้อมูลด้านสุขภาพของชุมชน รายงานการประชุม แผนงานโครงการ บันทึกข้อตกลง รายงานผลการดำเนินงานเมื่อสิ้นสุดโครงการของผู้รับผิดชอบโครงการ เอกสารการรับ-จ่ายเงิน หนังสือเชิญประชุมหรือแผนงาน/โครงการ ที่มีการพัฒนาศักยภาพกรรมการ การบันทึกรายงานต่าง ๆ (ค่าใช้จ่ายของกรรมการในการไปเข้าร่วมประชุม ความถูกต้องของการจำแนกค่าใช้จ่ายตามหมวดกิจกรรม ฯลฯ) รายงานผลการประเมินการบริหารจัดการตนเองของกองทุนหรือการนำผลการประเมินไปปรับปรุงการบริหารจัดการกองทุน)'
	);

	$qtList[]=array(
		'qtid'=>'01.1',
		'title'=>'1.1 กรรมการมีความรู้ ความเข้าใจในเรื่องวัตถุประสงค์ กลุ่มเป้าหมายที่ต้องดูแล อำนาจหน้าที่ และการใช้จ่ายงบประมาณ',
		'point'=>3,
		'detail'=>'สอบถามหรือสัมภาษณ์หรือสนทนากลุ่ม กรรมการกองทุนอย่างน้อย 8 คน ได้แก่
		1.นายกอบต./นายกเทศมนตรี หรือผู้ทรงคุณวุฒิ หรือเลขานุการกรรมการกองทุน หรือสมาชิกสภาที่เป็นคณะกรรมการกองทุน
		2.หัวหน้าหน่วยบริการ
		3.อาสาสมัครสาธารณสุข
		4.ตัวแทนจากชุมชน/หมู่บ้าน/ผู้แทนศูนย์ประสานงานหลักประกันสุขภาพภาคประชาชน

		เกณฑ์การให้คะแนน
		ค่าเฉลี่ย 0-6 ได้ 0 คะแนน
		ค่าเฉลี่ย 6.01- 10 ได้ 1 คะแนน
		ค่าเฉลี่ย 10.01-14 ได้ 2 คะแนน
		ค่าเฉลี่ยมากกว่า 14 ได้ 3 คะแนน'
	);

	$qtList[]=array(
		'qtid'=>'01.2',
		'title'=>'1.2 กรรมการผ่านการอบรมหรือประชุมหรือสัมนาหรือเวทีแลกเปลี่ยนเรียนรู้',
		'point'=>2,
		'detail'=>'ปี ๒๕๕๕ กรรมการกองทุนได้รับการพัฒนาให้มีความรู้ ความเข้าใจ ด้านการบริหารจัดการกองทุน

			หลักฐาน
			ดูหนังสือส่งตัวหรือการเบิกจ่ายงบประมาณกองทุนในการพัฒนาให้มีความรู้ ความเข้าใจด้านการบริหารจัดการกองทุน

			เกณฑ์การให้คะแนน
			จำนวนกรรมการได้รับการพัฒนาให้มีความรู้ ความเข้าใจ 81 - 100 % ให้ 2 คะแนน จำนวนกรรมการได้รับการพัฒนาให้มีความรู้ ความเข้าใจ 61 - 80 % ให้ 1 คะแนน'
	);

	$qtList[]=array(
		'qtid'=>'01.3',
		'title'=>'1.3 การประชุมคณะกรรมการบริหารกองทุน มีกรรมการเข้าร่วมประชุมอย่างน้อย 80% ทุกครั้ง',
		'point'=>3,
		'detail'=>'หลักฐาน
			ดูจากลายเซ็นผู้เข้าร่วมประชุมหรือการจ่ายเบี้ยประชุม

			เกณฑ์การให้คะแนน
			จำนวนคณะกรรมการกองทุนเข้าร่วมประชุมตั้งแต่ 80 %ขึ้นไปทุกครั้ง ให้ 3 คะแนน
			จำนวนคณะกรรมการกองทุนเข้าร่วมประชุมตั้งแต่ 80 %ขึ้นไปไม่ทุกครั้ง ให้ 2 คะแนน
			จำนวนคณะกรรมการกองทุนเข้าร่วมประชุมน้อยกว่า 80 % ให้ 1 คะแนน'
	);

	$qtList[]=array(
		'qtid'=>'01.4',
		'title'=>'1.4 มีการประเมินผลการบริหารจัดการกองทุนอย่างน้อยตามแบบประเมินที่กำหนดเพื่อการพัฒนากองทุน',
		'point'=>4,
		'detail'=>'หลักฐาน
			โดยสอบถามคณะกรรมการฯ และขอดูหลักฐาน ดังนี้
			1.	มีการประเมินโดยคณะกรรมการฯ หลักฐาน ดูจากรายงานการประชุมของคณะกรรมการ
			2.	มีสรุปผลการประเมินข้อที่ควรปรับปรุงและข้อที่ต้องพัฒนาต่อไปให้ดีขึ้น แต่ไม่มีแผนการพัฒนา หลักฐาน ดูจากรายงานการประชุมของคณะกรรมการ
			3.	มีสรุปผลการประเมินและมีแผนการพัฒนาฯ ที่ชัดเจน หลักฐาน ดูจากรายงานการประชุมของคณะกรรมการ และแผนการพัฒนาฯ
			4.	มีสรุปผลการประเมินและมีแผนการพัฒนาฯ ที่ชัดเจน และมีการดำเนินการตามแผนฯ หลักฐาน ดูจากรายงานการประชุมของคณะกรรมการ และแผนการพัฒนาฯและกิจกรรมการดำเนินการ

			เกณฑ์การประเมิน (ในแต่ละข้อมีคะแนนไม่เท่ากัน ให้คะแนนตามกิจกรรมที่ดำเนินการจริง)
			ไม่ได้มีการประเมิน ให้ 0 คะแนน
			ได้ดำเนินการตามข้อ 1 ให้ 1 คะแนน
			ได้ดำเนินการตามข้อ 2 ให้ 2 คะแนน
			ได้ดำเนินการตามข้อ 3 ให้ 3 คะแนน
			ได้ดำเนินการตามข้อ 4 ให้ 4 คะแนน'
	);

	$qtList[]=array(
		'id'=>'2',
		'title'=>'กระบวนการใช้จ่ายงบประมาณ	',
		'point'=>9,
	);

	$qtList[]=array(
		'qtid'=>'02.1',
		'title'=>'2.1 มีการจัดทำระเบียบข้อบังคับของกองทุน	',
		'point'=>2,
		'detail'=>'เกณฑ์การประเมิน
			-	มีและเป็นไปตามประกาศ สปสช.เรื่องการกำหนดหลักเกณฑ์เพื่อสนับสนุนให้องค์การบริหารส่วนท้องถิ่นดำเนินงานและบริหารจัดการกองทุนหลักประกันสุขภาพในระดับท้องถิ่นหรือพื้นที่ พ.ศ.๒๕๕๗ ให้ 2 คะแนน
			-	ไม่มีหรือมีแต่ขัดต่อประกาศ สปสช.เรื่องการกำหนดหลักเกณฑ์เพื่อสนับสนุนให้องค์การบริหารส่วนท้องถิ่นดำเนินงานและบริหารจัดการกองทุนหลักประกันสุขภาพในระดับท้องถิ่นหรือพื้นที่ พ.ศ.๒๕๕๗ ให้ 0 คะแนน'
	);

	$qtList[]=array(
		'qtid'=>'02.2',
		'title'=>'2.2 แผนงานโครงการได้รับการอนุมัติจากคณะกรรมการกองทุน	',
		'point'=>2,
		'detail'=>'หลักฐาน ดูรายงานการประชุมที่มีการพิจารณาอนุมัติแผนงานโครงการ
			เกณฑ์การประเมิน
			ไม่มีหลักฐานการอนุมัติแผนงานโครงการจากที่ประชุมกรรมการกองทุนหรือมีแต่ไม่ครบถ้วน
			(ไม่ถึง 80% ของจำนวนโครงการทั้งหมดในปีงบประมาณ) ให้ 0 คะแนน
			มี 80 - 99 % ให้ 1 คะแนน
			มี 100 % ให้ 2 คะแนน'
	);

	$qtList[]=array(
		'qtid'=>'02.3',
		'title'=>'2.3 โครงการที่สนับสนุนงบประมาณไม่ขัดต่อระเบียบการใช้เงินกองทุน ฯ	',
		'point'=>3,
		'detail'=>'หลักฐาน สุ่มดูโครงการที่ได้จ่ายงบประมาณสนับสนุนแล้ว อย่างน้อยประเภทละ 2 โครงการ
			ขัดต่อระเบียบการใช้เงินกองทุน ฯ ให้ 0 คะแนน
			ไม่ขัดต่อระเบียบการใช้เงินกองทุน ฯ ให้ 3 คะแนน'
		);

	$qtList[]=array(
		'qtid'=>'02.4',
		'title'=>'2.4 กิจกรรมที่นอกเหนือจากกิจกรรมหมวดที่ 4 มีเอกสารโครงการ และทุกโครงการมีการทำข้อตกลงและมีหลักฐานการรับ - จ่ายเงิน',
		'point'=>1,
		'detail'=>'สุ่มดูโครงการที่ได้จ่ายงบประมาณสนับสนุนแล้ว อย่างน้อยประเภทละ 2 โครงการ
			หลักฐาน ดูเอกสารโครงการ ข้อตกลงโครงการ และเอกสารการรับจ่ายเงิน

			เกณฑ์การประเมิน/หลักฐาน
			ไม่มีหรือมีไม่ครบถ้วน ให้ 0 คะแนน
			มีครบถ้วน ให้ 1 คะแนน'
	);

	$qtList[]=array(
		'qtid'=>'02.5',
		'title'=>'2.5 กิจกรรมหมวด 4 (การบริหารจัดการกองทุน) มีบันทึกมติกรรมการหรือมีการใช้จ่ายตามระเบียบข้อบังคับของกองทุน และมีหลักฐานการรับ – จ่ายเงิน',
		'point'=>1,
		'detail'=>'มีการจ่ายเงินตามระเบียบกองทุน หลักฐาน เอกสารการรายงาน ถ้าไม่มีเอกสารถือว่าไม่เป็นไปตามระเบียบกองทุน

			เกณฑ์การประเมิน/หลักฐาน
			ไม่มีเอกสาร ให้ 0 คะแนน
			มีบันทึกมติ/หลักฐานการรับจ่ายเงิน ให้ 1 คะแนน'
	);

	$qtList[]=array(
		'id'=>3,
		'title'=>'ระบบควบคุม ตรวจสอบ ติดตาม และประเมินผล ด้านการเงิน',
		'point'=>6,
	);

	$qtList[]=array(
		'qtid'=>'03.1',
		'title'=>'3.1 มีการรายงานด้านการเงินเสนอต่อกรรมการกองทุน',
		'point'=>1,
		'detail'=>'หลักฐาน รายงานการประชุมคณะกรรมบริหารกองทุน

			เกณฑ์ให้คะแนน
			ไม่พบวาระเรื่องการเงินในรายงานการประชุมหรือมีไม่ครบทุกครั้ง ให้ 0 คะแนน
			พบวาระเรื่องการเงินในรายงานการประชุมทุกครั้ง ให้ 1 คะแนน'
	);

	$qtList[]=array(
		'qtid'=>'03.2',
		'title'=>'3.2 มีการรายงานการใช้เงินตามกิจกรรม/โครงการครบถ้วนและถูกต้องทุกไตรมาสใน Website โปรแกรมกองทุน',
		'point'=>2,
		'detail'=>'หลักฐาน เอกสารรายงานการจ่ายเงินตามโครงการเปรียบเทียบกับ website โปรแกรมกองทุนตำบล
			เกณฑ์การให้คะแนน
			ไม่มีรายงานการจ่ายเงินใน Website ฯ ให้ 0 คะแนน
			มีรายงานการจ่ายเงินครบถ้วน 100 % แต่ไม่ตรงกับข้อมูลใน website ฯ ให้ 1 คะแนน
			มีรายงานการจ่ายเงินครบถ้วน 100 % และตรงกับข้อมูลใน website ฯ ให้ 2 คะแนน'
	);

	$qtList[]=array(
		'qtid'=>'03.3',
		'title'=>'3.3 มีการส่งรายงานสรุปผลการดำเนินงาน รายงานการรับจ่ายเงินคงเหลือประจำเดือน รายงานการรับจ่ายและเงินคงเหลือของกองทุนหลักประกันสุขภาพประจำไตรมาส',
		'point'=>3,
		'detail'=>'หลักฐาน
			1. สำเนาหนังสือส่งรายงานสรุปผลการดำเนินงาน รายงานการรับจ่ายและเงินคงเหลือของกองทุนหลักประกันสุขภาพประจำไตรมาสถึงสปสช.สาขาเขต สปสช.สาขาจังหวัด สำน้กงานส่งเสริมการปกครองส่วนท้องถิ่นจังหวัด และสำนักงานการตรวจเงินแผ่นดินจังหวัดทุกสิ้นปีงบประมาณ
			2.สรุปผลการดำเนินงาน รายงานการรับจ่ายเงินคงเหลือประจำเดือนลงใน website โปรแกรมกองทุนตำบล

			เกณฑ์การให้คะแนน
			ไม่มีหลักฐานข้อ 1 และข้อ 2 ให้ 0 คะแนน
			มีหลักฐานข้อ 1 หรือข้อ 2 ให้ 1 คะแนน
			มีหลักฐานครบทั้งข้อ 1 และข้อ 2 ให้ 3 คะแนน'
	);

	$qtList[]=array(
		'id'=>4,
		'title'=>'ระบบควบคุม ตรวจสอบ ติดตาม และประเมินผล ด้านการดำเนินงานโครงการกองทุนฯ',
		'point'=>3,
	);

	$qtList[]=array(
		'qtid'=>'04.1',
		'title'=>'4.1 มีการติดตามประเมินการดำเนินงานโครงการ/กิจกรรม',
		'point'=>3,
		'detail'=>'หลักฐาน คำสั่ง/หนังสือมอบหมายงาน /รายงานการประชุมการมอบหมายหน้าที่/เอกสารบันทึกผลการติดตามประเมินผลการดำเนินงานรายโครงการ
			เกณฑ์การประเมิน
			1. มีคำสั่งหรือหนังสือมอบหมายงาน หรือรายงานการประชุมการมอบหมายหน้าที่
			2. มีการติดตามประเมินผลรายโครงการมากกว่าร้อยละ 49 ของโครงการทั้งหมดที่ได้รับงบฯกองทุนฯ
			3. มีการติดตามประเมินผลรายโครงการ ทุกโครงการที่ได้รับงบฯกองทุนฯ
			เกณฑ์การให้คะแนน
			ไม่มีทั้ง 3 ข้อ ให้ 0 คะแนน
			มีข้อ 1 ข้อเดียว ให้ 1 คะแนน
			มีข้อ 1 และ 2 ให้ 2 คะแนน
			มีข้อ 1 และ 3 ให้ 3 คะแนน'
	);

	$qtList[]=array(
		'group'=>'ข. การมีส่วนร่วม (30 คะแนน)',
		'point'=>30,
		);

	$qtList[]=array(
		'id'=>5,
		'title'=>'การนำแผนที่ทางเดินยุทธศาสตร์หรือแผนสุขภาพชุนชนมาใช้ในการบริหารจัดการกองทุน',
		'point'=>13,
		'detail'=>'เป้าหมาย : มีกิจกรรมส่งเสริมการมีส่วนร่วมของทุกภาคส่วน(อปท. ภาครัฐ และ คนในชุมชน) ในการจัดการสุขภาพชุมชนอย่างยั่งยืนและเหมาะสมในพื้นที่
			แนวทางประเมินของทีมประเมิน :
			สอบถามหรือสัมภาษณ์หรือสนทนากลุ่มกรรมการกองทุนอย่างน้อย ๘ คน หรือพิจารณาจากข้อมูลการนำเสนอ เอกสารอ้างอิง ฯลฯ ในการคัดเลือกกรรมการโดยเฉพาะในส่วนของสมาชิกสภา อสม. ผู้แทนชุมชน/หมู่บ้าน และผู้ทรงคุณวุฒิ รวมทั้งการมีระบบเพื่อสร้างการการรับรู้ ความเข้าใจ และสร้างความสนใจของชุมชนต่อบทบาท ภารกิจ และผลงานของกองทุน
			แหล่งข้อมูล : ระเบียบกองทุน รายงานการประชุม สมุดบัญชีและรายงานทางการเงิน เอกสารการเผยแพร่ประชาสัมพันธ์ในรูปแบบต่าง ๆ แผนหรือผลการสำรวจความพึงพอใจและการรับรู้ข้อมูลข่าวสารต่อการดำเนินงานกองทุนหรือการนำผลการสำรวจไปปรับปรุงการบริหารจัดการกองทุน'
	);

	$qtList[]=array(
		'qtid'=>'05.1',
		'title'=>'5.1 มีการกำหนดบทบาทหน้าที่ให้คณะกรรมการ หรือมีการแต่งตั้งอนุกรรมการ/คณะทำงาน',
		'point'=>2,
		'detail'=>'หลักฐาน คำสั่งมอบหมายงาน/รายงานการประชุมที่มีการมอบหมายงาน คำสั่งแต่งตั้งอนุกรรมการ/คณะทำงาน
			เกณฑ์การประเมิน
			มีการกำหนดบทบาทหน้าที่คณะกรรมการ อนุกรรมการ คณะทำงานที่ชัดเจน
			เกณฑ์การให้คะแนน
			ไม่มีการกำหนดบทบาทฯหรือกำหนดไม่ชัดเจน ให้ 0 คะแนน
			(ถ้าไม่มีเอกสารประกอบถือว่าไม่มีการกำหนดบทบาท)
			มีการกำหนดบทบาทฯ ชัดเจน ให้ 2 คะแนน'
	);

	$qtList[]=array(
		'qtid'=>'05.2',
		'title'=>'5.2 คณะกรรมการกองทุนมีการประชุมอย่างต่อเนื่องอย่างน้อยปีละ 4 ครั้ง',
		'point'=>2,
		'detail'=>'หลักฐาน หนังสือเชิญประชุม/สรุปผลการประชุม
				เกณฑ์การให้คะแนน
				ไม่มีการประชุมในปีงบประมาณ ให้ ๐ คะแนน
				มีการประชุมในปีงบประมาณเท่ากับ 1 - 2 ครั้ง ให้ ๑ คะแนน
				มีการประชุมในปีงบประมาณเท่ากับ 3 - 4 ครั้งหรือมากกว่า ให้ ๒ คะแนน'
	);

	$qtList[]=array(
		'qtid'=>'05.3',
		'title'=>'5.3 มีบันทึกรายงานการประชุมคณะกรรมการกองทุนทุกครั้ง',
		'point'=>2,
		'detail'=>'หลักฐาน
			1. รายงานหรือสรุปผลการประชุมทุกครั้ง
			2. การนำผลการประชุมไปปรับใช้ในการดำเนินงาน (ดูจากวาระการติดตามประเมินผลโครงการ)
			เกณฑ์การให้คะแนน
			ไม่มีรายงานหรือมีไม่ครบ ให้ 0 คะแนน
			มีข้อ 1 ให้ 1 คะแนน
			มีข้อ 1 และ 2 ให้ 2 คะแนน'
	);

	$qtList[]=array(
		'qtid'=>'05.4',
		'title'=>'5.4 ที่ปรึกษากองทุนเข้าร่วมประชุมอย่างน้อย 2 ครั้งต่อปี',
		'point'=>2,
		'detail'=>'หลักฐาน ลายเซ็นการเข้าร่วมประชุม หรือเอกสารรายงานการประชุม
			เกณฑ์การให้คะแนน
			ไม่ได้เข้าร่วมประชุม ให้ 0 คะแนน
			ร่วมประชุมไม่ถึง 2 ครั้ง ให้ 1 คะแนน
			ร่วมประชุมตั้งแต่ 2 ครั้งขึ้นไป ให้ 2 คะแนน
			(การมาประชุมของที่ปรึกษากองทุนอาจมาด้วยตนเองหรือมอบตัวแทนมาร่วมประชุมก็ถือว่าได้ร่วมประชุม)'
	);

	$qtList[]=array(
		'qtid'=>'05.5',
		'title'=>'5.5 คณะกรรมอนุกรรมการมีการประชุม/ปฏิบัติงานตามหน้าที่ที่ได้รับมอบหมาย',
		'point'=>5,
		'detail'=>'หลักฐาน เอกสารรายงานการประชุมคณะอนุกรรมการ/คณะทำงาน รายงานการประชุมคณะกรรมการกองทุน
			เกณฑ์การประเมิน
			1.	มีรายงานการประชุมของอนุกรรมการ/คณะทำงานแยกจากรายงานการประชุมคณะกรรมการกองทุน
			2.	ในรายงานการประชุมของอนุกรรมการ/คณะทำงานพบการดำเนินการตามบทบาทหน้าที่ที่ได้รับมอบหมายชัดเจน
			3.	มีหลักฐานการปฏิบัติงานของอนุกรรมการ/คณะทำงาน เช่น แบบบันทึกการติดตามประเมินผลโครงการ
			4.	ในรายงานการประชุมคณะกรรมการกองทุนมีการนำเสนอผลการพิจารณา/ผลการปฏิบัติงานของคณะอนุกรรมการ/คณะทำงาน
			เกณฑ์การให้คะแนน
			ไม่มีข้อ 1-4 ให้ 0 คะแนน
			มีข้อ 1 หรือข้อ 3 หรือข้อ 4 ให้ 1 คะแนน
			มีข้อ 1 และข้อ 2 ให้ 2 คะแนน
			มีข้อ 1 และข้อ 2 และข้อ 3 ให้ 3 คะแนน
			มีครบทั้ง 4 ข้อ ให้ 5 คะแนน'
	);

	$qtList[]=array(
		'id'=>6,
		'title'=>'การสร้างการรับรู้ ความเข้าใจ และความสนใจของชุมชนต่อบทบาท ภารกิจ และผลงานของกองทุน',
		'point'=>11,
	);

	$qtList[]=array(
		'qtid'=>'06.1',
		'title'=>'6.1 มีการประกาศทางหอกระจายข่าว หรือเสียงตามสาย หรือติดประกาศ หรือป้ายประชาสัมพันธ์',
		'point'=>3,
		'detail'=>'หลักฐาน เอกสารข้อมูลเนื้อหาการประกาศ, บันทึก/ตาราง/ผู้รับผิดชอบการประกาศ , ภาพป้ายประชาสัมพันธ์/การติดประกาศ
			เกณฑ์การประเมิน
			1. มีเอกสารข้อมูลเนื้อหาการประกาศ
			2. มีบันทึก/ตาราง/ผู้รับผิดชอบการประกาศ
			3. มีภาพป้ายประชาสัมพันธ์/การติดประกาศ
			เกณฑ์การให้คะแนน
			ไม่มี ให้ 0 คะแนน
			มี 1 ข้อ ให้ 1 คะแนน
			มี 2 ข้อ ให้ 2 คะแนน โดยไม่ต้องเรียงข้อ
			มี 3 ข้อ ให้ 3 คะแนน โดยไม่ต้องเรียงข้อ'
	);

	$qtList[]=array(
		'qtid'=>'06.2',
		'title'=>'6.2 มีการเผยแพร่ข้อมูลข่าวสารของกองทุนทางหนังสือพิมพ์ หรือวิทยุ /วิทยุชุมชนหรือเคเบิลทีวี หรือโทรทัศน์ หรือเวปไซต์ของท้องถิ่น หรือสื่ออิเล็คทรอนิกส์',
		'point'=>3,
		'step'=>3,
		'detail'=>'หลักฐาน ขอดูหลักฐานการเผยแพร่
			เกณฑ์การให้คะแนน
			ไม่มี ให้ 0 คะแนน
			มี ให้ 3 คะแนน'
	);

	$qtList[]=array(
		'qtid'=>'06.3',
		'title'=>'6.3 มีการสำรวจความพึงพอใจ และการรับรู้ข้อมูลข่าวสาร ต่อการดำเนินงานกองทุน หลักประกันสุขภาพ',
		'point'=>5,
		'detail'=>'หลักฐาน เอกสารการสำรวจ /การสรุปผลการสำรวจ/แผนพัฒนากองทุน
			เกณฑ์การประเมิน/การให้คะแนน
			๑. ไม่มีการดำเนินการ ให้ 0 คะแนน
			๒. มีการสำรวจความพึงพอใจ ≥ 50 คน ขึ้นไป ให้ 1 คะแนน
			๓. มีการสรุปผลการสำรวจเป็นเอกสาร ให้ 2 คะแนน
			๔. มีการนำผลการสำรวจไปจัดทำแผนการพัฒนากองทุน ให้ 3 คะแนน
			๕. มีการจัดทำแผนตามข้อ 4 และดำเนินการตามแผน ให้ 4 คะแนน
			๖. มีการดำเนินงานตามข้อ 5 และมีการสรุปผลการดำเนินงาน ให้ 5 คะแนน'
	);

	$qtList[]=array(
		'id'=>7,
		'title'=>'การสร้างการมีส่วนร่วมของประชาชน',
		'point'=>2,
	);

	$qtList[]=array(
		'qtid'=>'07.1',
		'title'=>'7.1 มีการสมทบเงินกองทุนจากประชาชนหรือจากกองทุนอื่นๆ',
		'point'=>2,
		'detail'=>'หลักฐาน ข้อมูลการรับเงินจากโปรแกรมบริหารจัดการกองทุนเทียบกับบัญชีเงินฝากของกองทุนหรือสำเนาใบเสร็จรับเงินของกองทุน (กรณีไม่นำเงินรับเข้าบัญชีเงินฝากของกองทุนฯไม่ถือว่าเป็นการสมทบงบฯให้กองทุนฯ)
			เกณฑ์การให้คะแนน
			ไม่มีการสมทบ ให้ 0 คะแนน
			มีการสมทบภาพรวมในปีงบประมาณจำนวนอยู่ในหลักพันหรือต่ำกว่า ให้ 1 คะแนน
			มีการสมทบภาพรวมในปีงบประมาณจำนวนอยู่ในหลักหมื่นหรือมากกว่า ให้ 2 คะแนน'
	);

	$qtList[]=array(
		'id'=>8,
		'title'=>'การนำแผนที่ทางเดินยุทธศาสตร์ (SRM) หรือแผนสุขภาพชุมชนมาใช้ในการบริหารจัดการกองทุน',
		'point'=>4,
	);

	$qtList[]=array(
		'qtid'=>'08.1',
		'title'=>'8.1 มีกระบวนการจัดทำแผนแบบมีส่วนร่วม	',
		'point'=>4,
		'detail'=>'หลักฐาน
			-	หนังสือเชิญประชุมและรายชื่อผู้ร่วมประชุมจัดทำแผนฯ
			-	สรุปผลการจัดประชุม หรือสรุปผลการจัดเวทีประชาคม
			-	ข้อมูลที่ใช้ประกอบการจัดทำแผน
			-	ประเด็น/ทิศทางการพัฒนากองทุนหรือแผนชุมชนหรือ SRM
			เกณฑ์การประเมิน
			๑. มีการจัดเวทีวิเคราะห์ปัญหาสุขภาพชุมชนโดยมีเครือข่ายในชุมชนเข้าร่วมประชุมเช่น ชุมชน ผู้นำ/อสม./ผู้สูงอายุ/แม่บ้าน/เยาวชน/ครู/พระ/ผู้พิการ ฯลฯ หน่วยงาน/องค์กร สาธารณสุข/โรงเรียน/กศน./พัฒนาชุมชน ฯลฯ
			๒. มีการนำข้อมูลพื้นฐานที่เกี่ยวข้องมาร่วมวิเคราะห์ในการจัดทำแผน เช่น ข้อมูลบริบทชุมชน(เชื่อมโยงกับกับประเด็นเพื่อการจัดทำแผนที่เหมาะสมกับพื้นที่) ข้อมูลสุขภาพชุมชน(การป่วย การตาย สถานการณ์สุขภาพพื้นที่ สิ่งแวดล้อม )
			๓. ประเด็น/ทิศทางการพัฒนากองทุนที่ได้จากเวที เป็นแนวทางการพัฒนาพฤติกรรมสุขภาพอนามัยและแผนSRM หรือแผนชุมชนที่ใช้ในการพิจารณาโครงการเพื่ออนุมัติสนับสนุนงบฯ เกณฑ์การให้คะแนน
			มี 1 ข้อ ให้ 2 คะแนน
			มี 2 ข้อ ให้ 3 คะแนน
			มี 3 ข้อ ให้ 4 คะแนน'
	);

	$qtList[]=array(
		'group'=>'ค. ผลลัพธ์การดำเนินงาน (40 คะแนน)',
		'point'=>40,
	);

	$qtList[]=array(
		'detail'=>'เป้าหมาย : มีการดำเนินงานโครงการ กิจกรรมที่สอดคล้องกับสภาพปัญหาในพื้นที่ สอดคล้องกับประกาศสปสช.ฉบับปี ๒๕๕๗ ตลอดจนมีการสร้างหรือดัดแปลงสิ่งที่มีอยู่แล้วให้ดีขึ้นเพื่อให้ตอบสนองวัตถุประสงค์ของกองทุนจนนำไปสู่ความสำเร็จในการแก้ไขปัญหาสาธารณสุขหรือการปรับเปลี่ยนพฤติกรรมด้านสุขภาพของประชาชน
			แนวทางประเมินของทีมประเมิน : พิจารณาจากเอกสารโครงการ รายงานผลการดำเนินงานโครงการ แผนงานว่าดำเนินการครบถ้วนตามประกาศและมีการใช้งบประมาณแก้ไขปัญหาในพื้นทีให้ลุล่วงไปหรือไม่
			แหล่งข้อมูล : เอกสารโครงการ เอกสารรายงานผลการดำเนินโครงการ เอกสารแผนงานประจำปี เอกสารสรุปการใช้จ่ายงบประมาณรายเดือน รายไตรมาส รายปี'
	);

	$qtList[]=array(
		'id'=>9,
		'title'=>'มีกิจกรรมที่สอดคล้องกับนโยบายระดับประเทศ',
		'point'=>15,
	);

	$qtList[]=array(
		'qtid'=>'09.1',
		'title'=>'9.1 มีกิจกรรมคัดกรองเบาหวานความดันโลหิตสูง ดูแลผู้พิการ ดูแลผู้สูงอายุ',
		'point'=>5,
		'detail'=>'หลักฐาน แผนงาน/โครงการประจำปีงบประมาณ
			หัวข้อการประเมิน
			1.การคัดกรองเบาหวาน โดยใช้ verbal screening
			2.การคัดกรองความดันโลหิตสูง
			3.การดูแลผู้พิการ
			4.การดูแลผู้สูงอายุ
			การให้คะแนน
			ไม่มีกิจกรรม/โครงการทั้ง 4 อย่าง ให้ 0 คะแนน
			มีกิจกรรม/โครงการ 1 อย่าง ให้ 1 คะแนน
			มีกิจกรรม/โครงการ 2 อย่าง ให้ 2 คะแนน
			มีกิจกรรม/โครงการ 3 อย่าง ให้ 3 คะแนน
			มีกิจกรรม/โครงการครบถ้วน 4 อย่าง ให้ 5 คะแนน'
	);

	$qtList[]=array(
		'qtid'=>'09.2',
		'title'=>'9.2 มีกิจกรรมการสร้างเสริมสุขภาพ การป้องกันโรค การฟื้นฟูสมรรถภาพ และการรักษาพยาบาลระดับปฐมภูมิเชิงรุก ของศูนย์เด็กเล็ก ศูนย์พัฒนาและฟื้นฟูคุณภาพชีวิตผู้สูงอายุและคนพิการ',
		'point'=>5,
		'detail'=>'หลักฐาน แผนงาน/โครงการประจำปีงบประมาณ
			หัวข้อการประเมิน
			1. การสร้างเสริมสุขภาพ การป้องกันโรค การสร้างเสริมสุขภาพของศูนย์เด็กเล็ก
			2. การสร้างเสริมสุขภาพ การป้องกันโรค การฟื้นฟูสมรรถภาพ และการรักษาพยาบาลระดับปฐมภูมิเชิงรุก ของศูนย์พัฒนาและฟื้นฟูคุณภาพชีวิตผู้สูงอายุ
			3. การสร้างเสริมสุขภาพ การป้องกันโรค การฟื้นฟูสมรรถภาพ และการรักษาพยาบาลระดับปฐมภูมิเชิงรุก ของศูนย์พัฒนาและฟื้นฟูคุณภาพชีวิตคนพิการ
			การให้คะแนน
			ไม่มีกิจกรรม/โครงการทั้ง 3 ข้อ ให้ 0 คะแนน
			มีกิจกรรม/โครงการ 1 ข้อ ให้ 1 คะแนน
			มีกิจกรรม/โครงการ 2 อย่าง ให้ 3 คะแนน
			มีกิจกรรม/โครงการครบถ้วน 3 ข้อ ให้ 5 คะแนน'
	);

	$qtList[]=array(
		'qtid'=>'09.3',
		'title'=>'9.3 มีการใช้งบประมาณในการดำเนินกิจกรรมการสร้างเสริมสุขภาพ การป้องกันโรค การฟื้นฟูสมรรถภาพ และการรักษาพยาบาลระดับปฐมภูมิเชิงรุก ของศูนย์เด็กเล็ก ศูนย์พัฒนาและฟื้นฟูคุณภาพชีวิตผู้สูงอายุและคนพิการ เป็นเงินไม่น้อยกว่าร้อยละ 15 ของเงินรายรับประจำปีงบประมาณ',
		'point'=>5,
		'detail'=>'หลักฐาน แผนงาน/โครงการประจำปีงบประมาณ
			เกณฑ์การให้คะแนน
			ไม่มีการใช้เงิน ให้ 0 คะแนน
			ใช้เงินถึง 1 – 3 % ให้ 1 คะแนน
			ใช้เงินถึง 4 – 6 % ให้ 2 คะแนน
			ใช้เงินถึง 7 – 10 % ให้ 3 คะแนน
			ใช้เงินถึง 11 – 14 % ให้ 4 คะแนน
			ใช้เงินถึง 15 % ให้ 5 คะแนน'
	);

	$qtList[]=array(
		'id'=>10,
		'title'=>'การใช้จ่ายงบประมาณกองทุนเพื่อแก้ไขปัญหาในพื้นที่',
		'point'=>8,
	);

	$qtList[]=array(
		'qtid'=>'10.1',
		'title'=>'10.1 กองทุนมีการใช้จ่ายงบประมาณอย่างน้อย 80 % ของเงินในบัญชีทั้งหมดในปีงบฯนั้น ๆ',
		'point'=>8,
		'detail'=>'หลักฐาน ดูข้อมูลเงินในสมุดบัญชี และในโปรแกรมกองทุนฯในรอบปีงบประมาณว่ามีการใช้เงินถึง 80 % หรือไม่<br />เกณฑ์การให้คะแนน<br />ใช้เงินไม่ถึง 70 % ให้ 0 คะแนน<br />ใช้เงินถึง 70-74 % ให้ 4 คะแนน<br />ใช้เงินถึง 75-79 % ให้ 6 คะแนน<br />ใช้เงินถึง 80 % ให้ 8 คะแนน'
	);

	$qtList[]=array(
		'id'=>11,
		'title'=>'การให้กลุ่มหรือองค์กรประชาชนเป็นผู้ดำเนินงานสร้างเสริมสุขภาพ ป้องกันโรค',
		'point'=>3,
	);

	$qtList[]=array(
		'qtid'=>'11.1',
		'title'=>'11.1 กองทุนมีการใช้จ่ายงบประมาณอย่างน้อย 40 % ให้กลุ่มหรือองค์กรประชาชนเป็นผู้ดำเนินงานสร้างเสริมสุขภาพ ป้องกันโรค',
		'point'=>3,
		'detail'=>'หลักฐาน ดูแผนงานประจำปีหรือโครงการที่ได้รับการสนับสนุนงบประมาณในปีงบประมาณว่ามีการใช้จ่ายเงินให้กลุ่มองค์กรประชาชนเป็นผู้ดำเนินงานสร้างเสริมสุขภาพ ป้องกันโรค ถึง 40 % หรือไม่
			เกณฑ์การให้คะแนน
			ใช้เงินไม่ถึง 31 % ให้ 0 คะแนน
			ใช้เงินถึง 31-34 % ให้ 1 คะแนน
			ใช้เงินถึง 35-39 % ให้ 2 คะแนน
			ใช้เงินถึง 40 % ให้ 3 คะแนน'
	);

	$qtList[]=array(
		'id'=>12,
		'title'=>'ความสอดคล้องของแผนงานประจำปีกับโครงการในปีงบประมาณ',
		'point'=>4,
	);

	$qtList[]=array(
		'qtid'=>'12.1',
		'title'=>'12.1 โครงการที่ได้รับการสนับสนุนงบฯสอดคล้องกับแผนงานประจำปีงบประมาณ',
		'point'=>4,
		'detail'=>'หลักฐาน แผนงานประจำปีงบประมาณ และโครงการที่ได้รับอนุมัติฯ
			เกณฑ์การให้คะแนน
			โครงการที่อนุมัติฯไม่สอดคล้องกับแผนประจำปี ให้ 0 คะแนน
			โครงการที่อนุมัติฯสอดคล้องกับแผนประจำปี น้อยกว่า 50% ให้ 1 คะแนน
			โครงการที่อนุมัติฯสอดคล้องกับแผนประจำปี 50-79 % ให้ 2 คะแนน
			โครงการที่อนุมัติฯสอดคล้องกับแผนประจำปี 80-99 % ให้ 3 คะแนน
			โครงการที่อนุมัติฯสอดคล้องกับแผนประจำปี 100% ให้ 4 คะแนน'
	);

	$qtList[]=array(
		'id'=>13,
		'title'=>'การนำเสนอผลของโครงการต่อกรรมการกองทุนและองค์กร อื่น ๆ',
		'point'=>5,
	);

	$qtList[]=array(
		'qtid'=>'13.1',
		'title'=>'13.1 มีการรายงานผลการดำเนินงานของแต่ละโครงการในที่ประชุมคณะกรรมการกองทุนและบันทึกผลแต่ละโครงการลงใน website โปรแกรมกองทุนตำบล',
		'point'=>5,
		'detail'=>'หลักฐาน รายงานผลการดำเนินงานรายโครงการของกองทุนที่ปรากฏในรายงานการประชุมคณะกรรมการกองทุน และมีการบันทึกลงใน website โปรแกรมกองทุน เมนู ๒.๒ (หากไม่บันทึกลงใน website ให้คะแนนลดลงครึ่งหนึ่งในแต่ละข้อ)
			เกณฑ์การให้คะแนน
			ไม่มีการรายงานหรือรายงานน้อยกว่า 50 % ของจำนวนโครงการที่ดำเนินการในรอบปีงบประมาณ ให้ 0 คะแนน
			มีการรายงานหลังสิ้นสุดโครงการ 50 - 59 % ของจำนวนโครงการที่ดำเนินการในรอบปีงบประมาณ ให้ 1 คะแนน
			มีการรายงานหลังสิ้นสุดโครงการ 60 – 69 % ของจำนวนโครงการที่ดำเนินการในรอบปีงบประมาณ ให้ 2 คะแนน
			มีการรายงานหลังสิ้นสุดโครงการ 70 - 79 % ของจำนวนโครงการที่ดำเนินการในรอบปีงบประมาณ ให้ 3 คะแนน
			มีการรายงานหลังสิ้นสุดโครงการ 80 - 99 % ของจำนวนโครงการที่ดำเนินการในรอบปีงบประมาณ ให้ 4 คะแนน
			มีการรายงานหลังสิ้นสุดโครงการ ครบ 100 % ของจำนวนโครงการที่ดำเนินการในรอบปีงบประมาณ ให้ 5 คะแนน
			*หากไม่บันทึกลงใน website ให้คะแนนลดลงครึ่งหนึ่งในแต่ละข้อ'
	);

	$qtList[]=array(
		'id'=>14,
		'title'=>'การสร้างนวัตกรรมสุขภาพชุมชน	',
		'point'=>5,
		'detail'=>'เป้าหมาย : มีการสร้างหรือดัดแปลงสิ่งที่มีอยู่แล้วให้ดีขึ้นเพื่อให้ตอบสนองวัตถุประสงค์ของกองทุน จนนำไปสู่ความสำเร็จในการแก้ไขปัญหาสาธารณสุขหรือการปรับเปลี่ยนพฤติกรรมด้านสุขภาพของประชาชน
			แนวทางประเมินขององค์กรภายนอก : สอบถามหรือสัมภาษณ์หรือสนทนากลุ่ม กรรมการกองทุนอย่างน้อย ๔ คน หรือพิจารณาจากข้อมูลการนำเสนอและเอกสารอ้างอิง'
	);

	$qtList[]=array(
		'qtid'=>'14.1',
		'title'=>'14.1 มีนวัตกรรมสุขภาพชุมชนที่สามารถแก้ไขปัญหาสุขภาพหรือสามารถปรับเปลี่ยนพฤติกรรมสุขภาพของประชาชนอย่างเป็นรูปธรรมชัดเจน',
		'point'=>5,
		'detail'=>'แหล่งข้อมูล : แผนงาน/โครงการ และรายงานผลการดำเนินงานเมื่อสิ้นสุดโครงการของผู้รับผิดชอบโครงการ
			เกณฑ์การประเมิน
			1.	สามารถบอกเล่านวัตกรรมการดำเนินงานได้
			2.	มีเอกสารสรุปบทเรียนนวัตกรรม
			3.	มีการเผยแพร่นวัตกรรม (เอกสาร/สิ่งพิมพ์/ฯลฯ)
			4.	สามารถเป็นแหล่งเรียนรู้/ศึกษาดูงานแก่พื้นที่อื่นๆ โดยต้องมีบันทึก/ภาพผู้มาเรียนรู้/ศึกษาดูงาน
			เกณฑ์การให้คะแนน
			ไม่มีนวัตกรรม ให้ 0 คะแนน
			มีข้อ 1 ให้ 2 คะแนน
			มีข้อ 1 + 2 ให้ 3 คะแนน
			มีข้อ 1 + 2 + 3 ให้ 4 คะแนน
			มีครบทั้ง 4 ข้อ ให้ 5 คะแนน'
	);



	$tables = new Table();
	$tables->addClass('project-fund-estimate-table');
	$tables->thead=array('หมวดการประเมิน','center -1'=>'ข้อ','ประเมินประเด็น','center -2'=>'คะแนนเต็ม','center -3'=>'คะแนนที่ได้รับจากการประเมิน');
	foreach ($qtList as $item) {
		$row=array();
		if ($item['group']) {
			$row[]='<td colspan="3"><b><big>'.$item['group'].'</big></b></td>';
			$row[]=$item['point'];
			$row[]='';
			$tables->rows[]=$row;
		} else if ($item['title']) {
			$row[]='';
			$row[]=$item['id'];
			$row[]=$item['title']
							.($item['detail']?'<div class="-detail" style="font-size:0.8em;color:gray;font-weight:normal;"><p><b>เป้าหมาย/แนวทางประเมิน/แหล่งข้อมูล</b></p>'.$item['detail'].'</div>':'');
			$row[]=$item['point'];
			if ($item['qtid'] && $item['point']) {
				if ($editMode) {
					$row[]='<select class="form-select" name="rate[RATE.'.$item['qtid'].']" style="width:3em;text-align:center;">'.__view_project_fund_estimate_form_options($item['point'],$rate['RATE.'.$item['qtid']]).'</select>';
				} else {
					$row[]=number_format($rate['RATE.'.$item['qtid']]);
				}
			} else {
				$row[]='';
			}
			$row['config']=array('class'=>'-qtitem');
			$tables->rows[]=$row;
		}

		/*
		if ($item['detail']) {
			$tables->rows[]=array('','','<td colspan="3"><p><b>เป้าหมาย/แนวทางประเมิน/แหล่งข้อมูล</b></p>'.$item['detail'].'</td>','config'=>array('class'=>'-detail'));
		}
		*/
	}
	$tables->rows[]=array('','','<b>รวมคะแนน</b>',100,number_format($data->info->rates));
	$tables->rows[]=array('<td colspan="2"><b>Grade A+</b>','<td colspan="3">90-100 คะแนน = กองทุนที่มีศักยภาพสูง สามารถเป็นศูนย์เรียนรู้</td>');
	$tables->rows[]=array('<td colspan="2"><b>Grade A</b>','<td colspan="3">70-89 คะแนน = กองทุนที่มีศักยภาพดี</td>');
	$tables->rows[]=array('<td colspan="2"><b>Grade B</b>','<td colspan="3">50-69 คะแนน = กองทุนที่มีศักยภาพปานกลาง</td>');
	$tables->rows[]=array('<td colspan="2"><b>Grade C</b>','<td colspan="3">0-49 คะแนน = กองทุนที่ยังขาดความพร้อมต้องเร่งพัฒนา</td>');

	$form->addField('table',$tables->build());

	if ($editMode) {
		$form->addField(
			'submit',
			array(
				'type'=>'button',
				'value' => '<i class="icon -material">done_all</i><span>{tr:SAVE}</span>',
				'pretext'=>'<a class="btn -link -cancel" href="'.url('project/fund/'.$orgId.'/estimate'.($data->qtref ? '/'.$data->qtref : '')).'"><i class="icon -material">cancel</i><span>{tr:CANCEL}</span></a>',
				)
			);
	}

	$ret.=$form->build();

	$ret.='<style type="text/css">
	.project-fund-estimate-table tr.-qtitem {font-weight:bold;;}
	.project-fund-estimate-table tr.-detail {color:#999; font-size: 0.9em;}
	.form-item {display: block; width: 24%; float:left; margin-right:1%;}
	.form-item.-edit-fullname {clear:left;}
	.form .title {padding:8px; background:#666;color:#fff;}
	.project-fund-estimate-table th {white-space:nowrap;}
	.form-item.-edit-yearestimate-collectname {clear:left;}
	.form-item.-edit-yearestimate-submit {width:100%;text-align:right;}
	</style>';
	return $ret;
}

function __view_project_fund_estimate_form_options($end,$value=NULL) {
	$ret='';
	for ($i=0;$i<=$end;$i++) {
		$ret.='<option value="'.$i.'" '.($value==$i?'selected="selected"':'').'>'.$i.'</option>';
	}
	return $ret;
}
?>