<?php
/**
* Module  :: Description
* Created :: 2024-03-01
* Modify  :: 2024-03-01
* Version :: 1
*
* @param String $arg1
* @return Widget
*
* @usage module/{id}/method
*/

class CookiesPolicy extends Page {
	var $arg1;

	function __construct($arg1 = NULL) {
		parent::__construct([
			'arg1' => $arg1
		]);
	}

	function build() {
		return new Scaffold([
			'appBar' => new AppBar([
				'title' => 'นโยบายคุกกี้ (Cookies Policy)',
			]), // AppBar
			'body' => new Widget([
				'children' => [
					'<ol>
					<li>คุกกี้คืออะไร<br />คุกกี้เป็นไฟล์ข้อมูลขนาดเล็กที่ถูกดาว์นโหลดมาจัดเก็บไว้ในคอมพิวเตอร์ แท็บเล็ต หรืออุปกรณ์มือถือของผู้ใช้บริการ โดยคุกกี้จะทำหน้าที่จัดเก็บการตั้งค่าต่างๆ โดยค่าที่ใช้เก็บนั้นจะเป็นค่าที่ช่วยจดจำตัวคุณและวิธีที่คุณเข้าใช้งานเว็บไซต์ รวมถึงประวัติการใช้บริการที่คุณชื่นชอบในรูปแบบของไฟล์ ซึ่งจะทำให้คุณได้รับประสบการณ์ในการใช้งานออนไลน์ได้ดียิ่งขึ้น โดยคุกกี้ที่จัดเก็บบนเครื่องนั้นจะไม่ได้ทำอันตรายกับผู้ใช้บริการ หรืออุปกรณ์ของผู้ใช้บริการ</li>
					<li>ประโยชน์ของคุกกี้<br />คุกกี้เป็นสิ่งที่บอกให้ทราบถึงว่ามีผู้ใช้บริการเข้าชมส่วนใดในเว็บไซต์ เพื่อที่จะนำมาปรับใช้และมอบประสบการณ์ที่ดีให้กับผู้ใช้บริการ นอกจากนี้การตั้งค่าแรกของเว็บไซต์ด้วยคุกกี้จะช่วยให้ผู้ใช้บริการเข้าถึงเว็บไซต์ด้วยค่าที่ตั้งไว้ทุกครั้งที่ใช้งาน ยกเว้นคุกกี้ถูกลบจะทำให้การตั้งค่ากลับไปยังค่าเริ่มต้น</li>
					<li>วิธีการใช้งานคุกกี้<br />เว็บไซต์มีการใช้บริการวิเคราะห์เว็บไซต์โดยใช้เครื่องมือ Google Analytics ซึ่งจะมีการใช้งานคุกกี้เพื่อช่วยในการวิเคราะห์เว็บไซต์และนำไปปรับปรุงเพื่อเป็นประสบการณ์ที่ดีในการใช้งานเว็บไซต์ ข้อมูลที่เป็นรหัสผู้ใช้บริการนั้น Google Analytics จะมีการจัดเก็บในรูปแบบที่ไม่ระบุชื่อ และนอกจากนั้นคุกกี้ที่มีการจัดเก็บข้อมูลการเข้าใช้งานเว็บไซต์ จะถูกส่งไปจัดเก็บไว้โดย Google โดยจะใช้ข้อมูลนี้เพื่อวัตถุประสงค์ในการประเมินการใช้งานเว็บไซต์ของมหาวิทยาลัย และ Google อาจจะส่งข้อมูลนี้ไปยังบุคคลที่สามในกรณีที่กฏหมายกำหนดให้ดำเนินการ หรือให้บุคคลที่สาม สามารถประมวลผลข้อมูลได้</li>
					<li>วิธีปิดการทำงานของคุกกี้<br />ผู้ใช้บริการสามารถตั้งค่าเบราว์เซอร์ให้ปิดการทำงานของคุกกี้ และตั้งความเป็นส่วนตัวเพื่อไม่ให้มีการเก็บรวบรวมข้อมูลของคุกกี้ในอนาคตได้ แต่อย่างไรก็ตามการปิดการใช้งานคุกกี้นั้นจะมีผลทำให้การใช้งานบางอย่างหรือทั้งหมดของการบริการไม่สมบูรณ์ หากต้องการศึกษาเพิ่มเติมวิธีการในการบริหารจัดการคุกกี้ สามารถศึกษาได้ที่ <a href="https://www.allaboutcookies.org" target="_blank">www.allaboutcookies.org</a> หรือ <a href="https://www.aboutcookies.org" target="_blank">www.aboutcookies.org</a></li>
					<li>ข้อตกลงผู้ใช้<br />หากต้องการใช้งานเว็บไซต์ของเราต่อ ถือว่าคุณยินยอมให้มีการติดตั้งคุกกี้ในคอมพิวเตอร์ แท็บเล็ต หรืออุปกรณ์มือถือของผู้ใช้บริการ เพื่อให้ได้รับประสบการณ์ในการบริการอย่างสมบูรณ์</li>
					</ol>'
				], // children
			]), // Widget
		]);
	}
}
?>