<?php
function ibuy_hatyaigogreen_app_report($self) {
	R::View('ibuy.hatyaigogreen.toolbar',$self,'HATYAI GO GREEN : Report');
	$ret.='<h2>Report</h2>';

	$ret.='<h3>ข้อมูลผู้ผลิต</h3>';
	$ui=new Ui();
	$ui->add('<a href="">รายงานผลจำนวนผู้ผลิตระดับพื้นที่ (รายย่อย/กลุ่มหมู่บ้าน/ตำบล/อำเภอ/จังหวัด)</a>');
	$ui->add('<a href="">รายงานผลประเภทผลผลิตระดับพื้นที่</a>');
	$ui->add('<a href="">รายงานผลลักษณะการผลิตระดับพื้นที่</a>');
	$ui->add('<a href="">รายงานผลรูปแบบผลิตระดับพื้นที่</a>');
	$ui->add('<a href="">รายงานผลปัญหาผลิตระดับพื้นที่</a>');
	$ui->add('<a href="">รายงานผลความต้องการสนับสนุนระดับพื้นที่</a>');
	$ret.=$ui->build();

	$ret.='<h3>ข้อมูลการจัดจำหน่ายผลผลิต</h3>';
	$ui=new Ui();
	$ui->add('<a href="">รายการผลผลิตเกษตรสุขภาพที่พร้อมจำหน่าย (รายวัน) (รายย่อย/กลุ่มหมู่บ้าน/ตำบล/อำเภอ/จังหวัด</a>');
	$ui->add('<a href="">รายการผลผลิตเกษตรสุขภาพที่พร้อมจำหน่ายล่วงหน้า (รายเดือน) (รายย่อย/กลุ่มหมู่บ้าน/ตำบล/อำเภอ/จังหวัด)</a>');
	$ui->add('<a href="">แผนที่แสดงจุดจำหน่าย</a>');
	$ui->add('<a href="">รายงานผลรูปแบบผลิตระดับพื้นที่</a>');
	$ui->add('<a href="">แผนที่แสดงจุดผลิต</a>');
	$ret.=$ui->build();

	$ret.='<h3>รายการผลิผลิตที่มาจำหน่ายตลาดกรีนเวย์</h3>';
	$ui=new Ui();
	$ui->add('<a href="">วัน เดือน ปี</a>');
	$ui->add('<a href="">รายการผลผลิตเกษตรสุขภาพที่พร้อมจำหน่ายล่วงหน้า (A1,A2,A3-A10/B1-B10)</a>');
	$ui->add('<a href="">แผนที่แสดงจุดจำหน่าย</a>');
	$ui->add('<a href="">ภาพกิจกรรม</a>');
	$ret.=$ui->build();

	$ret.='<h3>ข้อมูลความต้องการของผู้บริโภค</h3>';
	$ui=new Ui();
	$ui->add('<a href="">รายการแสดงที่อยู่ของผู้บริโภค (หมู่บ้าน/ตำบล/อำเภอ/จังหวัด)</a>');
	$ui->add('<a href="">รายการแสดงช่องทางในการจัดส่งผลผลิตให้ผู้บริโภค</a>');
	$ui->add('<a href="">ช่องทางสื่อสารให้ข้อเสนอแนะ</a>');
	$ret.=$ui->build();

	return $ret;
}
?>