<?php
/**
* iMed Care :: How to use app
* Created 2021-08-03
* Modify 2021-08-03
*
* @return Widget
*
* @usage imed/care/our/about
*/

$debug = true;

class ImedCareOurCondition {
	function __construct() {}

	function build() {
		$isAdmin = is_admin('imed care');

		return new Scaffold([
			'appBar' => new AppBar([
				'title' => 'เงื่อนไขการใช้งาน',
			]),
			'body' => new Column([
				'children' => [
					'การยินยอมตามเงื่อนไขของการใช้แอพทั้ง 4 ประเภท',
					'1)เป็นข้อมูลระหว่างผู้ใช้บริการกับผู้รับบริการ ส่วนแรกเป็นเรื่องของนิยามคำศัพท์ เช่น แอพพลิเคชั่น iMed@home หมายถึงใคร การให้บริการเป็นอย่างไร คนที่ใช้แอพพลิเคชั่นต้องเตรียมอุปกรณ์เอง การนัดหมายในการให้บริการ การคุ้มครองความเสียหายระหว่างผู้ใช้บริการ การแจ้งรายละเอียดให้แอดมินทราบภายใน 24 ชั่วโมง การประเมินความเสียหายตามความเป็นจริง',
					'2)การเขียนอธิบายให้อธิบายเชิงหลักการไว้ก่อน เนื่องจากรายละเอียดบางอย่างเป็นเรื่องที่ยังไม่เกิดขึ้น วิธีคิดเป็นไปในลักษณะการปรึกษาหารือในการแก้ปัญหาร่วมกัน ไม่ควรเป็นไปในลักษณะการผูกมัดจนเกินไป บางเรื่องเป็นเรื่องที่ควรนำไปปรึกษานิติกรผู้เชี่ยวชาญทางกฎหมาย ให้ช่วยตรวจสอบร่างอีกครั้ง',
					'3)ที่มาของ iMedCare หลักการเป็นอย่างไร เพิ่มเติมรายละเอียดสั้น ๆ',
					'4)มีช่องแชทสอบถามระหว่างผู้ให้บริการและผู้รับบริการ',
					'5)เงื่อนไขการให้บริการ โดยเขียนหลักการกว้าง ๆ เพิ่มนิยามผู้ใช้บริการให้ชัดเจนมากขึ้น ระบุรายละเอียดให้ชัด',
					'6)ระบุความรับผิดชอบขององค์กรหลักที่ดูแล ทำอะไรบ้าง รับผิดชอบต่อความเสียหายแค่ไหน เพิ่มเติมในเงื่อนไขภาพรวม',
				],
			]), // Container
		]); // Scaffold
	}
}
?>