<?php
/*

Read Me First

หน้าหลัก web => ibuy/green
หน้าหลัก app => ibuy/green/app
ผู้ขาย => ibuy/green/my/shop
urlConsumer = ibuy/green/my
urlSupporter = ibuy/green/supporter
urlSignout = ibuy/green/signout
urlHelp = ibuy/green/help


Green Smile GPS

กลุ่มเกษตรอินทรีย์คูเต่า 7 แปลง
วัลลภ(สวนหลังบ้าน)		7.112898, 100.465995
วัลลภ(สวนไผ่)					7.097298, 100.480492
โสภณ								7.112757, 100.466048
เถี้ยน ธรรมสุรินทร์			7.096452, 100.477017
ธรรมนูญ(สวน)					7.113228,100.460950
ธรรมนูญ(ที่บ้าน)				7.090330,100.476812
ฐิตาภา เพ็งอุดม				7.107975,100.468550



พิราวรรณ					7.07902778,100.43250000
ตำบล ท่าช้าง อำเภอบางกล่ำ สงขลา 90110



กลุ่มเกษตรอินทรีย์ ทำกินทำใช้
แปลงระนอง หลังบ้าน		7 662564         100 816339
แปลงระนอง สวนป่า		7662886    100 816587
แปลงโรงเรียนชุมชนบ้านบ่อประดู่ 7662681   100816948
แปลงจิตรสิริ					7 662496    100 816223
แปลงสุกัญา สุยสุด		7  661441  100816283
แปลงเยาวนิช				7 660802   100 816283
ลลิตา							7   660945      100  818998

มนูญ								6.823079,100.540779





จะมีกรณีที่สมาชิกกลุ่มต้องการป้อนข้อมูลเอง สามารถทำได้ 2 แบบ

แบบที่ 1 ให้เป็นสมาชิกกลุ่ม แล้วจัดการแปลงผลิตของตนเอง

ขั้นตอนคือ
1. ให้แต่ละคนสมัครสมาชิก แต่ไม่ต้องสร้างร้านค้า
2. หลังจากสมัครสมาชิกแล้ว ให้แจ้งผู้ดูแลกลุ่ม
3. ผู้ดูแลกลุ่มเพิ่มเขาเข้ามาอยู่ในรายชื่อทีมบริหารร้านค้า
4. เมื่อเข้ามาในหน้าร้านค้า เขาจะเห็นชื่อกลุ่ม
5. ให้เข้าไปหน้า "ผลผลิต"
6. เพิ่มแปลงผลิต
7. เพิ่ม ผลผลิตรอบใหม่ ของแปลงตนเอง
8. แต่ละคนจะสามารถจัดการแปลงผลิตของตนเองได้
9. ผู้ดูแลจะสามารถแก้ไขแปลงผลิต/ผลผลิตของทุกแปลงได้


แบบที่ 2 แต่ละคนสร้างร้านค้าเอง แล้วกลุ่มค่อยดึงร้านค้าเข้าอยู่ภายใต้กลุ่ม

ขั้นตอนคือ
1. ให้แต่ละคนสมัครสมาชิก
2. สร้างร้านค้าของตนเอง
2. หลังจากสร้างร้านค้าแล้ว ให้แจ้งผู้ดูแลกลุ่ม
3. ผู้ดูแลกลุ่มเพิ่มร้าค้าเข้ามาอยู่ในรายชื่อ ร้านค้าเครือข่าย (ยังทำโปรแกรมไม่เสร็จ)
4. เมื่อเข้ามาในหน้าร้านค้า เขาจะเห็นชื่อร้านค้าของตนเอง
5. ให้เข้าไปหน้า "ผลผลิต"
6. เพิ่มแปลงผลิต
7. เพิ่ม ผลผลิตรอบใหม่

แบบที่ 2 ยังอยู่ในขั้นตอนพัฒนาโปรแกรมนะครับ


11:45 วัลลภ สวนสมาชิกในกลุ่ม จะไม่ปรากฏ QR code ครับ
11:46 วัลลภ แต่ของกลุ่ม มี QRcode ครับ
ตรง"รายละเอียด" กรอกยากครับ แป้นพิมพ์มันบัง
1.กรณีเป็นกลุ่ม ได้ QRcode เป็นของกลุ่ม 1 อัน, ส่วนร้านค้าสมาชิก ไม่แสดง QRcode ครับ
2.ป้อนรายละเอียดสินค้ายากครับ แป้นพิมพ์ของผมมันบังช่องกรอกข้อมูล
*/

 return;
 ?>