<?php
function project_assessor_report_summary($self) {
$ret.='วิเคราะห์';

$ret.='<pre>';
$ret.='วิเคราะห์ตามรายวิชา ทีละรายการ
 - เครือข่าย
 - จังหวัด
 - ช่วงอายุ <20,21-40,41-60,>60
 - การศึกษา
 - ประสบการณ์ <5 , 6-10 , 11-15 , 16-20, > 20 ปี
หาค่าเฉลี่ยคะแนน 7 ข้อ (ตามแบบสอบถาม)
ผลรวมคะแนน

เครือข่ายชุมชนท้องถิ่นน่าอยู่ (เลือก)
รายวิชา						หัวข้อประเมิน 									คะแนนเฉลี่ย
						เนื้อหา	เอกสาร	วิทยากร	..	...
วิชาที่ ๑				?				?				?									SUM()/35
วิชาที่ ๒					?
วิชาที่ ๓					?
...							..
ค่าเฉลี่ย				SUM(COL)/(5*จำนวนวิชา)							SUM(ALL)/??';
$ret.='</pre>';
	return $ret;
}
?>