<?php
/**
* Module Method
*
* @param Object $self
* @param Int $var
* @return String
*/

$debug = true;

function imed_help_input_birth($self) {
	$ret='<h3>รูปแบบของวันที่</h3><ul><li>รูปแบบการป้อนวันที่คือ วว/ดด/ปปปป</li><li>ศักราชที่แสดงในการป้อนข้อมูลของวันที่จะเป็นรูปแบบ ค.ศ.แต่ท่านสามารถป้อนข้อมูลได้ทั้งรูปแบบ พ.ศ. และ ค.ศ. ก็ได้ เช่น 16 พฤษภาคม 2512 สามารถป้อนว่า 16/05/2512 หรือ 16/05/1969</li><li>วิธีการแปลง พ.ศ. เป็น ค.ศ. คือ ให้เอา 543 ไปลบออกจากปี พ.ศ. ตามสูตร<br /><strong>ค.ศ. = พ.ศ. - 543</strong><br />เช่น พ.ศ. 2510 คือ 2510-543 = ค.ศ. 1967</li></ul>';
	return $ret;
}
?>