<?php
$qtRadio=array(

		);

$qtText='

	"key":"ELDER.GROUP", "type":"radio", "label":"กลุ่มผู้สูงอายุ", "option":"1:ติดเตียง:กลุ่มที่ 1 ติดเตียง ผู้สูงอายุที่ป่วยและช่วยเหลือตนเองไม่ได้ พิการ/ทุพพลภาพ, 2:ติดบ้าน:กลุ่มที่ 2 ติดบ้าน ผู้สูงอายุกลุ่มที่ช่วยเหลือตนเองได้บ้าง, 3:ติดสังคม:กลุ่มที่ 3 ติดสังคม ผู้สูงอายุกลุ่มที่ช่วยเหลือตนเองได้ ช่วยเหลือผู้อื่นและสังคม ชุมชนได้"

	"key":"section1", "section":"ส่วนที่ 2 ข้อมูลทั่วไปผู้สูงอายุ"
	"key":"น้ำหนัก", "type":"text", "posttext":"กิโลกรัม", "class":"w-1 w-center"
	"key":"ส่วนสูง", "type":"text", "posttext":"เซนติเมตร", "class":"w-1 w-center"
	"key":"Arm span", "type":"text", "posttext":"เซนติเมตร", "class":"w-1 w-center"
	"key":"ดัชนีมวลกาย", "type":"text", "label":"ดัชนีมวลกาย (BMI)", "posttext":"กก./ตร.ม.", "class":"w-1 w-center"
	"key":"รอบเอว", "type":"text", "posttext":"เซนติเมตร", "class":"w-1 w-center"
	"key":"รอบสะโพก", "type":"text", "posttext":"เซนติเมตร", "class":"w-1 w-center"
	"key":"ชีพจร", "type":"text", "posttext":"ครั้ง/นาที", "class":"w-1 w-center"
	"key":"ชีพจร-ความแรง", "type":"radio", "option":"1:ปกติ, 2:เบา","display":"block"
	"key":"ชีพจร-ความเร็ว", "type":"radio", "option":"1:สม่ำเสมอ, 2:ไม่สม่ำเสมอ","display":"block"
	"key":"ความดันโลหิต", "type":"text", "posttext":"/มม.ปรอท", "class":"w-1 w-center"
	"key":"ความดันโลหิต-ท่าที่ใช้วัด", "type":"radio", "option":"1:นั่ง, 2:นอน","display":"block"
	"key":"ความสามารถในการมองเห็น", "type":"radio", "option":"1:เห็นชัดเจน, 2:เห็นไม่ชัดมัว, 3:ไม่เห็น","display":"block"
	"key":"ความสามารถในการได้ยิน", "type":"radio", "option":"1:ได้ยินชัดเจน, 2:ได้ยินไม่ชัดเจน, 3:ไม่ได้ยิน","display":"block"

"key":"section-การรับรู้ภาวะสุขภาพ", "subsection":"2.1 การรับรู้ภาวะสุขภาพ"

"key":"สุขภาพ-โดยรวม", "label":"1. สุขภาพโดยทั่วไปของท่านในปัจจุบันเป็นอย่างไร", "type":"radio", "option":"1:ดีมาก, 5:ดี , 2:ปานกลาง, 3:แย่, 4:แย่มาก","display":"block"
"key":"สุขภาพ-เปรียบเทียบ", "label":"2. สุขภาพเป็นอย่างไรเมื่อเปรียบเทียบกับบุคคลอื่นที่มีอายุเท่ากัน", "type":"radio", "option":"1:ดีกว่า, 2:เท่ากัน, 3:ด้อยกว่า","display":"block"
"key":"สุขภาพ-เปรียบเทียบ-ด้อยกว่า", "type":"text", "label":"ระบุ", "class":"-fill", "subqt":true
"key":"อุปกรณ์ทางการแพทย์", "label":"3. อุปกรณ์ทางการแพทย์/เครื่องช่วยเหลือที่ใช้ เช่น ฟันปลอม ไม้เท้า อุปกรณ์ช่วยเดิน รถนั่งเข็น เครื่องช่วยฟัง แว่นตา อื่นๆ", "type":"radio", "option":"1:ไม่มี, 2:มี","display":"block"
"key":"อุปกรณ์ทางการแพทย์-ระบุ", "type":"text", "label":"ระบุ", "class":"-fill", "subqt":true





"key":"การอ่านเขียน", "question":"7. ความสามารถในการอ่านเขียน?", "type":"radio", "option":"1:อ่านไม่ออก เขียนไม่ได้, 2:อ่านออก เขียนไม่ได้, 3:อ่านออก เขียนได้", "display":"block"
"key":"การอ่านเขียน-เพราะ", "type":"text", "pretext":"เพราะ"

"key":"สมาชิก-คู่สมรส", "question":"8. ในครอบครัวมีสมาชิกทั้งหมดรวมทั้งตัวเองกี่คน ใครบ้าง?", "type":"text", "pretext":"คู่สมรส", "posttext":"คน", "class":"w-1 w-center"
"key":"สมาชิก-บุตร", "type":"text", "pretext":"บุตร", "posttext":"คน", "class":"w-1 w-center"
"key":"สมาชิก-สะใภ้", "type":"text", "pretext":"สะใภ้", "posttext":"คน", "class":"w-1 w-center"
"key":"สมาชิก-บุตรเขย", "type":"text", "pretext":"บุตรเขย", "posttext":"คน", "class":"w-1 w-center"
"key":"สมาชิก-หลาน", "type":"text", "pretext":"หลาน", "posttext":"คน", "class":"w-1 w-center"
"key":"สมาชิก-ญาติ", "type":"text", "pretext":"ญาติ", "posttext":"คน", "class":"w-1 w-center"
"key":"สมาชิก-อื่นๆ", "type":"text", "pretext":"อื่น ๆ", "posttext":"คน", "class":"w-1 w-center"
"key":"รวมสมาชิกครอบครัว", "type":"text", "posttext":"คน", "class":"w-1 w-center"
"key":"สรุปสมาชิกครอบครัว", "type":"radio", "option":"1:อาศัยอยู่คนเดียว, 2:อาศัยอยู่ตามลำพังสามี-ภรรยา, 3:อาศัยอยู่กับสมาชิกไม่เกิน 6 คน, 4:อาศัยอยู่กับสมาชิกเกิน 6 คน", "display":"block"
"key":"PSNL.1.10.1", "question":"11. สิทธิในการรับการรักษาพยาบาล", "type":"radio", "label":"สิทธิในการรักษาพยาบาล", "option":"สิทธิหลักประกันสุขภาพถ้วนหน้า,สิทธิประกันสังคม,สิทธิข้าราชการ/วิสาหกิจ,สิทธิ์ประกันชีวิต,สิทธิหลักประกันสุขภาพถ้วนหน้า (ท.74),สิทธิว่าง (อยู่ระหว่างรอสิทธิ์),สิทธิว่าง (ไม่มีสิทธิ์ใด ๆ),สิทธิอื่น ๆ", "display":"block"

"key":"section2","section":"<h3>ส่วนที่ 2 สุขภาพกายของผู้สูงอายุ</h3>"

"key":"q.2.1", "subsection":"2.1 การรับรู้ภาวะสุขภาพ"
"key":"สุขภาพ-โดยรวม", "question":"1. สุขภาพโดยรวมเป็นอย่างไร?", "type":"radio", "label":" ", "option":"1:1. แข็งแรงดีมาก, 2:2. ปานกลาง, 3:3. ค่อนข้างอ่อนแอ ไม่ค่อยดี, 4:4. อ่อนแอ ไม่ดี","display":"block"
"key":"สุขภาพ-เปรียบเทียบ", "question":"2. สุขภาพเป็นอย่างไรเมื่อเปรียบเทียบกับบุคคลอื่นที่มีอายุเท่ากัน?", "type":"radio", "label":" ", "option":"1:1. ดีกว่า, 2:2. เท่ากัน, 3:3. ด้อยกว่า"
"key":"หกล้ม", "question":"3. ในรอบ 1 ปีที่ผ่านมา เคยหกล้มบ้างหรือไม่ บ่อยครั้งเพียงใด?", "type":"radio", "label":" ", "option":"1:1. ไม่เคย, 2:2. เคย ประมาณ 1-3 ครั้ง/ปี, 3:3. เคย มากกว่า 3 ครั้ง/ปี"

"key":"q.2.2", "subsection":"2.2 โรคประจำตัว"
"key":"โรคประจำตัว-ความดันโลหิตสูง", "type":"checkbox", "label":" ", "option":"1:ความดันโลหิตสูง"
"key":"โรคประจำตัว-เบาหวาน", "type":"checkbox", "label":" ", "option":"1:เบาหวาน"
"key":"โรคประจำตัว-โรคหัวใจ", "type":"checkbox", "label":" ", "option":"1:โรคหัวใจ"
"key":"โรคประจำตัว-โรคเส้นเลือดสมองตีบ", "type":"checkbox", "label":" ", "option":"1:อัมพฤกษ์/อัมพาต"
"key":"โรคประจำตัว-โรคปอด", "type":"checkbox", "label":" ", "option":"1:โรคปอด/หอบหืด"
"key":"โรคประจำตัว-มะเร็ง", "type":"checkbox", "label":" ", "option":"1:โรคมะเร็ง"
"key":"โรคประจำตัว-เก๊าท์", "type":"checkbox", "label":" ", "option":"1:เก๊าท์/ข้อเสื่อม"
"key":"โรคประจำตัว-อัลไซเมอร์", "type":"checkbox", "label":" ", "option":"1:อัลไซเมอร์/สมองเสื่อม"
"key":"โรคประจำตัว-จิตเวช", "type":"checkbox", "label":" ", "option":"1:มีอาการทางจิตเวช"
"key":"โรคประจำตัว-โรคอ้วน", "type":"checkbox", "label":" ", "option":"1:โรคอ้วน"
"key":"โรคประจำตัว-โรคสมองและหลอดเลือด", "type":"checkbox", "label":" ", "option":"1:โรคสมองและหลอดเลือด"
"key":"โรคประจำตัว-อื่นๆ", "type":"text", "label":" ", "pretext":"โรคอื่น ๆ ระบุ"

"key":"HLTH.2.5.2.1", "question":"โรงพยาบาลที่รับการรักษาประจำ", "label":" ", "type":"text", "class":"w-10"

"key":"q.2.3", "subsection":"2.3 อาการเจ็บป่วย"
"key":"อาการ-การได้ยิน", "type":"checkbox", "label":" ", "option":"1:ได้ยินไม่ชัดเจน"
"key":"อาการ-การมองเห็น", "type":"checkbox", "label":" ", "option":"1:เห็นไม่ชัดเจน"
"key":"อาการ-อาการปวด", "type":"checkbox", "label":" ", "option":"1:อาการเจ็บปวด"
"key":"อาการ-มึนเวียนศีรษะ", "type":"checkbox", "label":" ", "option":"1:มึน/เวียนศีรษะ"
"key":"อาการ-ท้องผูก", "type":"checkbox", "label":" ", "option":"1:ท้องผูก"
"key":"อาการ-อ่อนเพลีย", "type":"checkbox", "label":" ", "option":"1:อ่อนเพลีย/เหนื่อยง่าย"
"key":"อาการ-ไอจาม", "type":"checkbox", "label":" ", "option":"1:ไอ/จาม"
"key":"อาการ-นอนไม่หลับ", "type":"checkbox", "label":" ", "option":"1:นอนไม่หลับ/หลับไม่สนิท"
"key":"อาการ-ปัสสาวะลำบาก", "type":"checkbox", "label":" ", "option":"1:ปัสสาวะลำบาก"
"key":"อาการ-ปัสสาวะไม่สุด", "type":"checkbox", "label":" ", "option":"1:ปัสสาวะไม่สุด"
"key":"อาการ-หลงลืม", "type":"checkbox", "label":" ", "option":"1:หลงลืม"
"key":"อาการ-ระบบประสาทสัมผัส", "type":"checkbox", "label":" ", "option":"1:ระบบประสาทสัมผัส"

-"key":"อาการ-ผิวหนังแห้ง", "type":"checkbox", "option":"1:ผิวหนังแห้ง/คัน"
-"key":"อาการ-ผื่นจ้ำ", "type":"checkbox", "option":"1:ผิวหนังมีผื่นเป็นจ้ำ"
-"key":"อาการ-ปวดศีรษะ", "type":"checkbox", "option":"1:ปวดศีรษะ"
-"key":"อาการ-เบื่ออาหาร", "type":"checkbox", "option":"1:เบื่ออาหาร"
-"key":"อาการ-ท้องอืด", "type":"checkbox", "option":"1:ท้องอืด"
-"key":"อาการ-ปวดท้อง", "type":"checkbox", "option":"1:ปวดท้อง"
-"key":"อาการ-หายใจไม่เต็มปอด", "type":"checkbox", "option":"1:หายใจไม่เต็มปอด"
-"key":"อาการ-เป็นหวัดง่าย", "type":"checkbox", "option":"1:เป็นหวัดง่าย"
-"key":"อาการ-ขี้หนาว", "type":"checkbox", "option":"1:ขี้หนาว/มือเท้าเย็น"
-"key":"อาการ-เป็นตะคริว", "type":"checkbox", "option":"1:เป็นตะคริว"
-"key":"อาการ-เจ็บแน่นหน้าอก", "type":"checkbox", "option":"1:เจ็บแน่นหน้าอก"

"key":"section3", "section":"<h3>ส่วนที่ 3 แบบประเมินความสามารถในการทำกิจวัตรประจำวันของผู้สูงอายุ ดัชนีบาร์เธล (Barthel ADL index)</h3>"
"key":"ADL-Feeding", "type":"radio", "label":"1. การรับประทานอาหารเมื่อเตรียมสำรับไว้ให้เรียบร้อยต่อหน้า", "option":"0:0 = ไม่สามารถตักอาหารเข้าปากได้,1:1 = ตักอาหารเองได้ แต่ต้องมีคนช่วย เช่น ช่วยใช้ช้อนตักเตรียมไว้ให้ หรือตัดเป็นชิ้นเล็ก ๆ ไว้ล่วงหน้า,2:2 = ตักอาหารและช่วยตัวเองได้เป็นปกติ", "display":"block"
"key":"ADL-Grooming", "type":"radio", "label":"2. การล้างหน้าหวีผม โกนหนวด ในระยะ 24-48 ชั่วโมงที่ผ่านมา", "option":"0:0 = ต้องการความช่วยเหลือ,1:1 = ทำได้เอง (รวมทั้งที่ทำได้เองถ้าเตรียมอุปกรณ์ไว้ให้", "display":"block"
"key":"ADL-Transfer", "type":"radio", "label":"3. การขึ้น/ลงเตียงหรือลุกนั่งจากที่นอนไปยังเก้าอี้ได้", "option":"0:0 = ไม่สามารถนั่งได้ (นั่งแล้วจะล้มลงเสมอ) หรือต้องใช้คนสองคนช่วยกันยกขึ้น,1:1 = ต้องการความช่วยเหลืออย่างมากจึงจะนั่งได้ เช่น ต้องใช้คนที่แข็งแรงหรือมีทักษะ 1 คน หรือใช้คนทั่วไปช่วยพยุงหรือดันขึ้นมาจึงจะนั่งอยู่ได้,2:2 = ต้องการความช่วยเหลือบ้าง เช่น บอกให้ทำตามหรือช่วยพยุงเล็กน้อย หรือต้องมีคนดูแลเพื่อความปลอดภัย,3:3 = ทำได้เอง", "display":"block"
"key":"ADL-Toilet use", "type":"radio", "label":"4. การใช้ห้องน้ำสุขา", "option":"0:0 = ช่วยตัวเองไม่ได้,1:1 = ทำเองได้บ้าง (อย่างน้อยทำความสะอาดตัวเองได้หลังจากเสร็จธุระ) แต่ต้องการความช่วยเหลือในบางสิ่ง,2:2 = ช่วยตนเองได้ดี (ขึ้นนั่งและลงจากโถส้วมเอง ทำความสะอาดตัวเองได้เรียบร้อยหลังจากเสร็จธุระ ถอดใส่เสื้อผ้าได้เรียบร้อย)", "display":"block"
"key":"ADL-Mobility", "type":"radio", "label":"5. การเคลื่อนที่ภายในห้องหรือบ้าน", "option":"0:0 = เคลื่อนที่ไหนไม่ได้,1:1 = ต้องใช้รถเข็นช่วยตัวเองให้เคลื่อนที่ได้ และจะต้องเข้าออกมุมห้องหรือประตูได้ (ไม่ต้องมีคนเข็น),2:2 = เดินหรือเคลื่อนที่โดยมีคนช่วย เช่น พยุง หรือบอกให้ทำตาม หรือต้องให้ความสนใจดูแลเพื่อความปลอดภัย,3:3 = เดินหรือเคลื่อนที่ได้เอง", "display":"block"
"key":"ADL-Dressing", "type":"radio", "label":"6. การสวมใส่/ถอดเสื้อผ้า", "option":"0:0 = ต้องมีคนส่วมใส่ให้ ช่วยตนเองไม่ได้,1:1 = ช่วยตัวเองได้รายร้อยละ 50 ที่เหลือต้องมีคนช่วย,2:2 = ช่วยตัวเองได้ดี (รวมทั้งการติดกระดุม รูดซิปหรือใช้เสื้อผ้าที่ดัดแปลงให้เหมาะสมก็ได้)", "display":"block"
"key":"ADL-Stair", "type":"radio", "label":"7. การขึ้นลงบันได", "option":"0:0 = ไม่สามารถทำได้,1:1 = ต้องการคนช่วย,2:2 = ขึ้นลงได้เอง (ถ้าต้องใช้เครื่องช่วยเดิน เช่น Walker จะต้องเอาขึ้นลงได้ด้วย)", "display":"block"
"key":"ADL-Bathing", "type":"radio", "label":"8. การอาบน้ำ", "option":"0:0 = ต้องมีคนช่วยหรือทำให้,1:1 = อาบน้ำเองได้", "display":"block"
"key":"ADL-Bowel", "type":"radio", "label":"9. การกลั้นการถ่ายอุจจาระในระยะ 1 สัปดาห์ที่ผ่านมา", "option":"0:0 = กลั้นไม่ได้หรือต้องการการสวนอุจจาระอยู่เสมอ,1:1 = กลั้นไม่ได้เป็นครั้งคราว (เป็นน้อยกว่า 1 ครั้งต่อสัปดาห์),2:2 = กลั้นได้เป็นปกติ", "display":"block"
"key":"ADL-Bladder", "type":"radio", "label":"10. การกลั้นปัสสาวะในระยะ 1 สัปดาห์ที่ผ่านมา", "option":"0:0 = กลั้นไม่ได้หรือต้องการการสวนปัสสาวะอยู่เสมอ,1:1 = กลั้นไม่ได้เป็นครั้งคราว (เป็นน้อยกว่าวันละ 1 ครั้ง),2:2 = กลั้นได้เป็นปกติ", "display":"block"

"key":"ADL", "type":"text", "label":"รวมคะแนนบาร์เธล", "posttext":"คะแนน"

"key":"section4", "section":"<h3>ส่วนที่ 4 สุขภาพจิตของผู้สูงอายุ</h3>"
"key":"sub.4.1", "subsection":"4.1 แบบวัดความซึมเศร้าในผู้สูงอายุไทย"
"key":"dep1", "question":"4.1.1 ใน 2 สัปดาห์ผ่านมารวมวันนี้ รู้สึกหดหู่ เศร้า หรือท้อแท้สิ้นหวังหรือไม่?", "type":"radio", "label":" ", "option":"มี,ไม่มี"
"key":"dep2", "question":"4.1.2 ใน 2 สัปดาห์ผ่านมารวมวันนี้ รู้สึกเบื่อ ทำอะไรก็ไม่เพลิดเพลินหรือไม่?", "type":"radio", "label":" ", "option":"มี,ไม่มี"
"key":"happy", "question":"4.2 มีความพึงพอใจในชีวิตปัจจุบันมากน้อยเพียงใด?", "type":"radio", "label":" ", "option":"1:1. ไม่พึงพอใจเลย, 2:2. พึงพอใจปานกลาง, 3:3. พึงพอใจมาก"

"key":"section5", "section":"<h3>ส่วนที่ 5 สุขภาพสังคมและเศรษฐกิจของผู้สูงอายุ</h3>"
"key":"q.5.1", "subsection":"5.1 แหล่งสนับสนุนด้านผู้ดูแล"
"key":"ผู้ดูแลต่อเนื่อง", "question":"1. ผู้ที่คอยดูแลอย่างต่อเนื่องมากที่สุดคือใคร?", "type":"radio", "option":"1:ไม่มี,2:มี"
"key":"ผู้ดูแลต่อเนื่อง-สามีภรรยา", "type":"checkbox", "option":"1:สามีหรือภรรยา"
"key":"ผู้ดูแลต่อเนื่อง-ลูกสาว", "type":"checkbox", "option":"1:บุตรสาว"
"key":"ผู้ดูแลต่อเนื่อง-ลูกชาย", "type":"checkbox", "option":"1:บุตรชาย"
"key":"ผู้ดูแลต่อเนื่อง-หลานสาว", "type":"checkbox", "option":"1:หลานสาว"
"key":"ผู้ดูแลต่อเนื่อง-หลานชาย", "type":"checkbox", "option":"1:หลานชาย"
"key":"ผู้ดูแลต่อเนื่อง-หลานเขย", "type":"checkbox", "option":"1:หลานเขย"
"key":"ผู้ดูแลต่อเนื่อง-หลานสะใภ้", "type":"checkbox", "option":"1:หลานสะใภ้"
"key":"ผู้ดูแลต่อเนื่อง-เพื่อนบ้าน", "type":"checkbox", "option":"1:เพื่อนบ้าน"
"key":"ผู้ดูแลต่อเนื่อง-อสม.", "type":"checkbox", "option":"1:อาสาสมัครสาธารณสุขประจำหมู่บ้าน (อสม.)"
"key":"ผู้ดูแลต่อเนื่อง-ผู้ดูแลอื่นๆ", "type":"checkbox", "option":"1:อื่นๆ"
"key":"สรุปการดูแล", "type":"radio", "option":"1:1. ไม่มีใครดูแลหรือบุคคลภายนอกครอบครัวดูแลไม่ต่อเนื่อง, 2:2. บุคคลในครอบครัวให้การดูแลไม่ต่อเนื่อง, 3:3. บุคคลในครอบครัวให้การดูแลอย่างต่อเนื่อง", "display":"block"
"key":"care_have", "type":"radio", "question":"2. รู้สึกอย่างไรกับการดูแลที่ได้รับในปัจจุบัน?", "label":" ", "option":"1:1. ไม่พึงพอใจเลย, 2:2. เฉย ๆ, 3:3. พึงพอใจแล้ว", "display":"block"
"key":"care_need", "type":"radio", "question":"3. ต้องการให้มีบุคคลคอยช่วยเหลือ อำนวยความสะดวกในเรื่องอะไรบ้าง?", "label":" ", "option":"1:1. ต้องการให้ดูแลอย่างมาก, 2:2. ต้องการให้ดูแลบ้าง, 3:3. ไม่ต้องการเลย รู้สึกพึงพอใจแล้ว", "display":"block"
เรื่องที่ต้องการดูแล

"key":"q.5.2", "subsection":"5.2 แหล่งสนับสนุนด้านจิตสังคม"
"key":"บุคคลที่ปรับทุกข์", "question":"1. มีบุคคลที่สามารถพูดคุยด้วยเมื่อเกิดความกังวลใจหรือไม่?", "type":"radio", "option":"1:ไม่มี, 2:มี"
"key":"ผู้ที่ต้องการปรับทุกข์", "label":"ระบุความสัมพันธ์ผู้ที่ต้องการปรับทุกข์", "type":"text", "class":"w-10"
"key":"บุคคลมาเยี่ยม", "question":"2. เมื่อเจ็บป่วยมีบุคคลมาเยี่ยมเยียนบ่อย ๆ หรือไม่?", "type":"radio", "option":"1:ไม่มี, 2:มี"
"key":"ผู้ที่มาเยี่ยม", "label":"ชื่อผู้มาเยี่ยมและความถี่", "type":"text", "class":"w-10"
"key":"กิจกรรมสังคม", "question":"3. ความบ่อยของการเข้าร่วมกิจกรรมทางสังคมและศาสนา?", "type":"radio", "option":"1:ไม่เข้าร่วม, 2:เข้าร่วม"
กิจกรรมสังคม-1
ความถี่-1
กิจกรรมสังคม-2
ความถี่-2
กิจกรรมสังคม-3
ความถี่-3
กิจกรรมสังคม-4
ความถี่-4


"key":"q.5.3", "subsection":"5.3 ความต้องการช่วยเหลือ"
"key":"help.org.1", "type":"text", "question":"5.3.1 ต้องการให้เทศบาลช่วยเหลือในเรื่องใดบ้าง?", "label":" ", "class":"w-10"











"key":"section6", "section":"<h3>ส่วนที่ 6 อื่น ๆ</h3>"
"key":"ลักษณะบ้าน", "type":"radio", "option":"1:ชั่วคราว, 2:ชั้นเดียว, 3:สองชั้นขั้นไป"
บรรยายลักษณะบ้าน
ตำบลเดิม
อำเภอเดิม
จังหวัดเดิม
"key":"ภูมิลำเนา-เขต", "type":"radio", "option":"1:เขตเมือง, 2:เขตชนบท"
"key":"จำนวนปีในชุมชน", "type":"text", "posttext":"ปี", "class":"w-1"
"key":"จำนวนเดือนในชุมชน", "type":"text", "posttext":"เดือน", "class":"w-1"
"key":"สรุปเวลาในชุมชน", "type":"radio", "option":"1:1-4 ปี 11 เดือน, 2:5-9 ปี 11 เดือน, 3:10 ปีขั้นไป"
"key":"รู้จัก อสม.", "type":"radio", "option":"1:ไม่รู้จักเลย, 2:รู้จัก อสม. แต่ไม่เคยได้รับข้อมูลข่าวสารหรือคำแนะนำด้านสุขภาพ, 3:รู้จัก อสม. และเคยได้รับข้อมูลข่าวสาร คำแนะนำด้านสุขภาพ","display":"block"

"key":"พฤติกรรมเสี่ยง-ดื่มสุรา", "type":"radio", "option":"3:ไม่เคยเลยหรือน้อยกว่า 1 ครั้ง/สัปดาห์, 2:บ่อย ๆ แต่ไม่ทุกวัน หรือ 2-3 ครั้ง/สัปดาห์, 1:เป็นประจำทุกวัน หรือ 4-5 ครั้ง/สัปดาห์, 0:เคย แต่เลิกแล้ว","display":"block"
"key":"พฤติกรรมเสี่ยง-สูบบุหรี่", "type":"radio", "option":"3:ไม่เคยเลยหรือน้อยกว่า 1 ครั้ง/สัปดาห์, 2:บ่อย ๆ แต่ไม่ทุกวัน หรือ 2-3 ครั้ง/สัปดาห์, 1:เป็นประจำทุกวัน หรือ 4-5 ครั้ง/สัปดาห์, 0:เคย แต่เลิกแล้ว","display":"block"
"key":"พฤติกรรมเสี่ยง-เคี้ยวหมาก", "type":"radio", "option":"3:ไม่เคยเลยหรือน้อยกว่า 1 ครั้ง/สัปดาห์, 2:บ่อย ๆ แต่ไม่ทุกวัน หรือ 2-3 ครั้ง/สัปดาห์, 1:เป็นประจำทุกวัน หรือ 4-5 ครั้ง/สัปดาห์, 0:เคย แต่เลิกแล้ว","display":"block"
"key":"พฤติกรรมเสี่ยง-ยาชุดแก้ปวดเมื่อย", "type":"radio", "option":"3:ไม่เคยเลยหรือน้อยกว่า 1 ครั้ง/สัปดาห์, 2:บ่อย ๆ แต่ไม่ทุกวัน หรือ 2-3 ครั้ง/สัปดาห์, 1:เป็นประจำทุกวัน หรือ 4-5 ครั้ง/สัปดาห์, 0:เคย แต่เลิกแล้ว","display":"block"
"key":"พฤติกรรมเสี่ยง-ยาชูกำลัง", "type":"radio", "option":"3:ไม่เคยเลยหรือน้อยกว่า 1 ครั้ง/สัปดาห์, 2:บ่อย ๆ แต่ไม่ทุกวัน หรือ 2-3 ครั้ง/สัปดาห์, 1:เป็นประจำทุกวัน หรือ 4-5 ครั้ง/สัปดาห์, 0:เคย แต่เลิกแล้ว","display":"block"

"key":"ออกกำลังกาย-เดิน", "type":"checkbox", "option":"1:เดินเล่นตอนเช้า-เย็น 25-30 นาที"
"key":"ออกกำลังกาย-แอโรบิก", "type":"checkbox", "option":"1:เต้นแอโรบิค 30-40 นาที"
"key":"ออกกำลังกาย-ใช้เครื่อง", "type":"checkbox", "option":"1:ใช้อุปกรณ์เครื่องช่วยออกกำลังกาย 30-40 นาที"
"key":"ออกกำลังกาย-วิ่ง", "type":"checkbox", "option":"1:วิ่งเหยาะ ๆ 25-30 นที"
"key":"ออกกำลังกาย-กายบริหาร", "type":"checkbox", "option":"1:ฝึกกายบริหารท่าต่าง ๆ 30-40 นาที"
"key":"ออกกำลังกาย-อื่นๆ", "type":"checkbox", "option":"1:อื่น ๆ"
การออกกำลังกาย
"key":"การพักผ่อน", "type":"radio", "option":"1:นอนไม่หลับ, 2:นอนหลับไม่สนิท ตื่นบ่อย ๆ, 3:นอนหลับดี"

"key":"การตรวจสุขภาพ", "type":"radio", "option":"1:ไม่เคยตรวจ, 2:ตรวจนาน ๆ ครั้ง 2-3 ปี/ครั้ง, 3:ตรวจเป็นประจำทุกปี"
สถานที่ตรวจสุขภาพ

"key":"รายได้-รับจ้าง", "type":"money", "ret":"money", "posttext":"บาท/เดือน"
"key":"รายได้-ค้าขาย", "type":"money", "ret":"money", "posttext":"บาท/เดือน"
"key":"รายได้-บุตรหลาน", "type":"money", "ret":"money", "posttext":"บาท/เดือน"
"key":"รายได้-อื่นๆ", "type":"money", "ret":"money", "posttext":"บาท/เดือน"
"key":"รายได้ผู้สูงอายุรวม", "type":"money", "ret":"money", "posttext":"บาท/เดือน"

"key":"เกณฑ์รายได้", "type":"radio", "option":"1:น้อยกว่า 2000 บาท/เดือน, 2:2000-3000 บาท/เดือน, 3:3000 บาทขึ้นไป"
"key":"เงินเก็บ-ไม่พอใช้", "type":"checkbox", "option":"1: ไม่พอใช้"
"key":"เงินสะสม-พอใช้", "type":"checkbox", "option":"1:พอใช้"
"key":"เงินสะสม-มีเหลือเก็บ", "type":"checkbox", "option":"1:มีเหลือเก็บ"
ประเภทเงินเก็บ

"key":"รายได้ทาง-รับจ้างครอบครัว", "type":"money", "ret":"money", "posttext":"บาท"
"key":"รายได้ทาง-ค้าขายครอบครัว", "type":"money", "ret":"money", "posttext":"บาท"
"key":"รายได้ทาง-รับราชการครอบครัว", "type":"money", "ret":"money", "posttext":"บาท"
"key":"รายได้ทาง-อื่นๆ", "type":"money", "ret":"money", "posttext":"บาท"
"key":"รายได้ครอบครัวรวม", "type":"money", "ret":"money", "posttext":"บาท/เดือน"
"key":"เกณฑ์วัดรายได้ครอบครัว", "type":"radio", "option":"1:น้อยกว่า 2800 บาท, 2:2800-4000 บาท/เดือน, 3:มากกว่า 4000 บาท/เดือน"
"key":"สภาพการเงินครอบครัว", "type":"radio", "option":"1:มีเงินไม่พอใช้ ต้องหยิบยืมคนอื่นเป็นประจำ, 2:มีเงินพอใช้ แต่ไม่เหลือเก็บ หรืออาจจะต้องหยิบยืมคนอื่นบ้างนาน ๆ ครั้ง, 3:มีเงินเหลือเก็บ", "display":"block"
"key":"เงินเก็บครอบครัว", "type":"money", "ret":"money", "posttext":"บาท/เดือน"

"key":"ของใช้-หมอหุงข้าว", "type":"checkbox", "option":"1:หมอหุงข้าวไฟฟ้า"
"key":"ของใช้-ตู้เย็น", "type":"checkbox", "option":"1:ตู้เย็น"
"key":"ของใช้-เตาแก้ส", "type":"checkbox", "option":"1:เตาแก้ส"
"key":"ของใช้-กระติกน้ำร้อน", "type":"checkbox", "option":"1:กระติกน้ำร้อนไฟฟ้า"
"key":"ของใช้-พัดลม", "type":"checkbox", "option":"1:พัดลม"
"key":"ของใช้-โทรทัศน์", "type":"checkbox", "option":"1:โทรทัศน์"
"key":"ของใช้-มือถือ", "type":"checkbox", "option":"1:โทรศัพท์มือถือ"
"key":"ของใช้-รถยนต์", "type":"checkbox", "option":"1:รถยนต์"
"key":"ของใช้-จักรยานยนต์", "type":"checkbox", "option":"1:จักรยานยนต์"
"key":"ของใช้-แอร์", "type":"checkbox", "option":"1:แอร์"
"key":"เกณฑ์วัดสิ่งอำนวยความสะดวก", "type":"radio", "option:1:มี 1-3 อย่าง, 2:มี 4-6 อย่าง, 3:มี 7-9 อยาง"

"key":"ที่อยู่-บ้านคงทนถาวร", "type":"radio", "option":"มี,ไม่มี", "pretext":"สภาพบ้านคงทนถาวร"
"key":"ที่อยู่-มีส้วมใช้", "type":"radio", "option":"มี,ไม่มี", "pretext":"มีส้วมใช้"
"key":"ที่อยู่-มีห้องส่วนตัว", "type":"radio", "option":"มี,ไม่มี", "pretext":"ห้องส่วนตัวหรือบริเวณที่จัดเป็นสัดส่วน"
"key":"ที่อยู่-การระบายอากาศ", "type":"radio", "option":"มี,ไม่มี", "pretext":"การระบายอากาศและแสงสว่างที่พอเหมาะ"
"key":"ที่อยู่-บริเวณรอบบ้าน", "type":"radio", "option":"มี,ไม่มี", "pretext":"บริเวณรอบบ้านและในบริเวณมีความเป็นระเบียบเรียบร้อย สะอาดสะอ้าน"
"key":"ที่อยู่-ความปลอดภัยในบ้าน", "type":"radio", "option":"มี,ไม่มี", "pretext":"มีความปลอดภัยภายในบ้าน เช่น มีประตู หน้าต่าง"
"key":"ที่อยู่-เกณฑ์วัดที่อยู่อาศัย", "type":"radio", "option":"1:มีลักษณะดังกล่าว 1 ข้อ หรือไม่มีเลย, 2:มีลักษณะดังกล่าว 2-4 ข้อ, 3:มีลักษณะดังกล่าว 5-6 ข้อ", "display":"block"





"key":"ระยะทางไปสถานบริการ", "type":"radio", "option":"1:ใกล้บ้าน (<5 กม.), 2:ปานกลางไม่ไกล้ไม่ไกล (5-10 กม.), 3:ไกลบ้านมาก (>10 กม.)", "display":"block"
"key":"ความสะดวกในการเดินทางไปสถานบบริการ", "type":"radio", "option":"1:ไม่สะดวก, 2:สะดวก"
เดินทางไปสถานบริการโดย

"key":"ผู้ให้ความช่วยเหลือ", "type":"radio", "option":"1:ไม่มี, 2:มี"
ระบุผู้ให้ความช่วยเหลือ
';
?>