<?php
$qtRadio=array(

		);

$qtText='
"key":"ELDER.GROUP", "type":"radio", "label":"กลุ่มผู้สูงอายุ", "option":"1:ติดสังคม:กลุ่มที่ 1 ติดสังคม ผู้สูงอายุกลุ่มที่ช่วยเหลือตนเองได้ ช่วยเหลือผู้อื่นและสังคม ชุมชนได้, 2:ติดบ้าน:กลุ่มที่ 2 ติดบ้าน ผู้สูงอายุกลุ่มที่ช่วยเหลือตนเองได้บ้าง, 3:ติดเตียง:กลุ่มที่ 3 ติดเตียง ผู้สูงอายุที่ป่วยและช่วยเหลือตนเองไม่ได้ พิการ/ทุพพลภาพ"

"key":"ลักษณะบ้าน", "type":"radio", "option":"1:ชั่วคราว, 2:ชั้นเดียว, 3:สองชั้นขั้นไป"
บรรยายลักษณะบ้าน
"key":"การอ่านเขียน", "type":"radio", "option":"1:อ่านไม่ออก เขียนไม่ได้, 2:อ่านออก เขียนไม่ได้, 3:อ่านออก เขียนได้"

"key":"น้ำหนัก", "type":"text", "posttext":"กก.", "class":"w-1"
"key":"ส่วนสูง", "type":"text", "posttext":"ซม.", "class":"w-1"
"key":"ดัชนีมวลกาย", "type":"text", "posttext":"กก./ม<sup>2</sup>", "class":"w-1"

"key":"สมาชิก-คู่สมรส", "type":"text", "posttext":"คน", "class":"w-1"
"key":"สมาชิก-บุตร", "type":"text", "posttext":"คน", "class":"w-1"
"key":"สมาชิก-สะใภ้", "type":"text", "posttext":"คน", "class":"w-1"
"key":"สมาชิก-บุตรเขย", "type":"text", "posttext":"คน", "class":"w-1"
"key":"สมาชิก-หลาน", "type":"text", "posttext":"คน", "class":"w-1"
"key":"สมาชิก-ญาติ", "type":"text", "posttext":"คน", "class":"w-1"
"key":"สมาชิก-อื่นๆ", "type":"text", "posttext":"คน", "class":"w-1"
"key":"รวมสมาชิกครอบครัว", "type":"text", "posttext":"คน", "class":"w-1"
"key":"สรุปสมาชิกครอบครัว", "type":"radio", "option":"1:อาศัยอยู่คนเดียว, 2:อาศัยอยู่ตามลำพังสามี-ภรรยา, 3:อาศัยอยู่กับสมาชิกไม่เกิน 6 คน, 4:อาศัยอยูกับสมาชิกเกิน 6 คน", "display":"block"
ตำบลเดิม
อำเภอเดิม
จังหวัดเดิม
"key":"ภูมิลำเนา-เขต", "type":"radio", "option":"1:เขตเมือง, 2:เขตชนบท"
"key":"จำนวนปีในชุมชน", "type":"text", "posttext":"ปี", "class":"w-1"
"key":"จำนวนเดือนในชุมชน", "type":"text", "posttext":"เดือน", "class":"w-1"
"key":"สรุปเวลาในชุมชน", "type":"radio", "option":"1:1-4 ปี 11 เดือน, 2:5-9 ปี 11 เดือน, 3:10 ปีขั้นไป"
"key":"รู้จัก อสม.", "type":"radio", "option":"1:ไม่รู้จักเลย, 2:รู้จัก อสม. แต่ไม่เคยได้รับข้อมูลข่าวสารหรือคำแนะนำด้านสุขภาพ, 3:รู้จัก อสม. และเคยได้รับข้อมูลข่าวสาร คำแนะนำด้านสุขภาพ","display":"block"

"key":"อาการ-การได้ยิน", "type":"checkbox", "option":"1:ได้ยินไม่ชัดเจน"
"key":"อาการ-การมองเห็น", "type":"checkbox", "option":"1:เห็นไม่ชัดเจน"
"key":"อาการ-อาการปวด", "type":"checkbox", "option":"1:อาการเจ็บปวด"
"key":"อาการ-ผิวหนังแห้ง", "type":"checkbox", "option":"1:ผิวหนังแห้ง/คัน"
"key":"อาการ-ผื่นจ้ำ", "type":"checkbox", "option":"1:ผิวหนังมีผื่นเป็นจ้ำ"
"key":"อาการ-ปวดศีรษะ", "type":"checkbox", "option":"1:ปวดศีรษะ"
"key":"อาการ-มึนเวียนศีรษะ", "type":"checkbox", "option":"1:มึน/เวียนศีรษะ"
"key":"อาการ-เบื่ออาหาร", "type":"checkbox", "option":"1:เบื่ออาหาร"
"key":"อาการ-ท้องอืด", "type":"checkbox", "option":"1:ท้องอืด"
"key":"อาการ-ปวดท้อง", "type":"checkbox", "option":"1:ปวดท้อง"
"key":"อาการ-ท้องผูก", "type":"checkbox", "option":"1:ท้องผูก"
"key":"อาการ-อ่อนเพลีย", "type":"checkbox", "option":"1:อ่อนเพลีย/เหนื่อยง่าย"
"key":"อาการ-ไอจาม", "type":"checkbox", "option":"1:ไอ/จาม"
"key":"อาการ-หายใจไม่เต็มปอด", "type":"checkbox", "option":"1:หายใจไม่เต็มปอด"
"key":"อาการ-เป็นหวัดง่าย", "type":"checkbox", "option":"1:เป็นหวัดง่าย"
"key":"อาการ-ขี้หนาว", "type":"checkbox", "option":"1:ขี้หนาว/มือเท้าเย็น"
"key":"อาการ-เป็นตะคริว", "type":"checkbox", "option":"1:เป็นตะคริว"
"key":"อาการ-เจ็บแน่นหน้าอก", "type":"checkbox", "option":"1:เจ็บแน่นหน้าอก"
"key":"อาการ-นอนไม่หลับ", "type":"checkbox", "option":"1:นอนไม่หลับ/หลับไม่สนิท"
"key":"อาการ-ปัสสาวะลำบาก", "type":"checkbox", "option":"1:ปัสสาวะลำบาก"
"key":"อาการ-ปัสสาวะไม่สุด", "type":"checkbox", "option":"1:ปัสสาวะไม่สุด"
"key":"อาการ-หลงลืม", "type":"checkbox", "option":"1:หลงลืม"

"key":"พฤติกรรมเสี่ยง-ดื่มสุรา", "type":"radio", "option":"3:ไม่เคยเลยหรือน้อยกว่า 1 ครั้ง/สัปดาห์, 2:บ่อย ๆ แต่ไม่ทุกวัน หรือ 2-3 ครั้ง/สัปดาห์, 1:เป็นประจำทุกวัน หรือ 4-5 ครั้ง/สัปดาห์, 0:เคย แต่เลิกแล้ว","display":"block"
"key":"พฤติกรรมเสี่ยง-สูบบุหรี่", "type":"radio", "option":"3:ไม่เคยเลยหรือน้อยกว่า 1 ครั้ง/สัปดาห์, 2:บ่อย ๆ แต่ไม่ทุกวัน หรือ 2-3 ครั้ง/สัปดาห์, 1:เป็นประจำทุกวัน หรือ 4-5 ครั้ง/สัปดาห์, 0:เคย แต่เลิกแล้ว","display":"block"
"key":"พฤติกรรมเสี่ยง-เคี้ยวหมาก", "type":"radio", "option":"3:ไม่เคยเลยหรือน้อยกว่า 1 ครั้ง/สัปดาห์, 2:บ่อย ๆ แต่ไม่ทุกวัน หรือ 2-3 ครั้ง/สัปดาห์, 1:เป็นประจำทุกวัน หรือ 4-5 ครั้ง/สัปดาห์, 0:เคย แต่เลิกแล้ว","display":"block"
"key":"พฤติกรรมเสี่ยง-ยาชุดแก้ปวดเมื่อย", "type":"radio", "option":"3:ไม่เคยเลยหรือน้อยกว่า 1 ครั้ง/สัปดาห์, 2:บ่อย ๆ แต่ไม่ทุกวัน หรือ 2-3 ครั้ง/สัปดาห์, 1:เป็นประจำทุกวัน หรือ 4-5 ครั้ง/สัปดาห์, 0:เคย แต่เลิกแล้ว","display":"block"
"key":"พฤติกรรมเสี่ยง-ยาชูกำลัง", "type":"radio", "option":"3:ไม่เคยเลยหรือน้อยกว่า 1 ครั้ง/สัปดาห์, 2:บ่อย ๆ แต่ไม่ทุกวัน หรือ 2-3 ครั้ง/สัปดาห์, 1:เป็นประจำทุกวัน หรือ 4-5 ครั้ง/สัปดาห์, 0:เคย แต่เลิกแล้ว","display":"block"

"key":"ออกกำลังกาย-เดิน", "type":"checkbox", "option":"1:เดินเล่นตอนเช้า-เย็น 25-30 นาที"
"key":"ออกกำลังกาย-แอโรบิก", "type":"checkbox", "option":"1:เต้นแอโรบิค 30-40 นาที"
"key":"ออกกำลังกาย-ใช้เครื่อง", "type":"checkbox", "option":"1:ใช้อุปกรณ์เครื่องช่วยออกกำลังกาย 30-40 นาที"
"key":"ออกกำลังกาย-วิ่ง", "type":"checkbox", "option":"1:วิ่งเหยาะ ๆ 25-30 นที"
"key":"ออกกำลังกาย-กายบริหาร", "type":"checkbox", "option":"1:ฝึกกายบริหารท่าต่าง ๆ 30-40 นาที"
"key":"ออกกำลังกาย-อื่นๆ", "type":"checkbox", "option":"1:อื่น ๆ"
การออกกำลังกาย
"key":"การพักผ่อน", "type":"radio", "option":"1:นอนไม่หลับ, 2:นอนหลับไม่สนิท ตื่นบ่อย ๆ, 3:นอนหลับดี"

"key":"หกล้ม", "type":"radio", "option":"1:ไม่เคย, 2:เคย ประมาณ 1-3 ครั้ง/ปี, 3:เคย มากกว่า 3 ครั้ง/ปี"
"key":"การตรวจสุขภาพ", "type":"radio", "option":"1:ไม่เคยตรวจ, 2:ตรวจนาน ๆ ครั้ง 2-3 ปี/ครั้ง, 3:ตรวจเป็นประจำทุกปี"
สถานที่ตรวจสุขภาพ

"key":"dep1", "type":"radio", "option":"มี,ไม่มี", "pretext":"ใน 2 สัปดาห์ผ่านมารวมวันนี้ ท่านรู้สึกหดหู่ หรือท้อแท้สิ้นหวังหรือไม่"
"key":"dep2", "type":"radio", "option":"มี,ไม่มี", "pretext":"ใน 2 สัปดาห์ผ่านมารวมวันนี้ ท่านรู้สึกเบื่อ ทำอะไรก็ไม่เพลิดเพลินหรือไม่"

"key":"รายได้-รับจ้าง", "type":"money", "ret":"money", "posttext":"บาท/เดือน"
"key":"รายได้-ค้าขาย", "type":"money", "ret":"money", "posttext":"บาท/เดือน"
"key":"รายได้-บุตรหลาน", "type":"money", "ret":"money", "posttext":"บาท/เดือน"
"key":"รายได้-อื่นๆ", "type":"money", "ret":"money", "posttext":"บาท/เดือน"
"key":"รายได้ผู้สูงอายุรวม", "type":"money", "ret":"money", "posttext":"บาท/เดือน"

"key":"เกณฑ์รายได้", "type":"radio", "option":"1:น้อยกว่า 2000 บาท/เดือน, 2:2000-3000 บาท/เดือน, 3:3000 บาทขึ้นไป"
"key":"เงินเก็บ-ไม่พอใช้", "type":"checkbox", "option":"1: ไม่พอใช้"
"key":"เงินสะสม-พอใช้", "type":"checkbox", "option":"1:พอใช้"
"key":"เงินสะสม-มีเหลือเก็บ", "type":"checkbox", "option":"1:มีเหลือเก็บ"
ประเภทเงินเก็บ

"key":"รายได้ทาง-รับจ้างครอบครัว", "type":"money", "ret":"money", "posttext":"บาท"
"key":"รายได้ทาง-ค้าขายครอบครัว", "type":"money", "ret":"money", "posttext":"บาท"
"key":"รายได้ทาง-รับราชการครอบครัว", "type":"money", "ret":"money", "posttext":"บาท"
"key":"รายได้ทาง-อื่นๆ", "type":"money", "ret":"money", "posttext":"บาท"
"key":"รายได้ครอบครัวรวม", "type":"money", "ret":"money", "posttext":"บาท/เดือน"
"key":"เกณฑ์วัดรายได้ครอบครัว", "type":"radio", "option":"1:น้อยกว่า 2800 บาท, 2:2800-4000 บาท/เดือน, 3:มากกว่า 4000 บาท/เดือน"
"key":"สภาพการเงินครอบครัว", "type":"radio", "option":"1:มีเงินไม่พอใช้ ต้องหยิบยืมคนอื่นเป็นประจำ, 2:มีเงินพอใช้ แต่ไม่เหลือเก็บ หรืออาจจะต้องหยิบยืมคนอื่นบ้างนาน ๆ ครั้ง, 3:มีเงินเหลือเก็บ", "display":"block"
"key":"เงินเก็บครอบครัว", "type":"money", "ret":"money", "posttext":"บาท/เดือน"

"key":"ของใช้-หมอหุงข้าว", "type":"checkbox", "option":"1:หมอหุงข้าวไฟฟ้า"
"key":"ของใช้-ตู้เย็น", "type":"checkbox", "option":"1:ตู้เย็น"
"key":"ของใช้-เตาแก้ส", "type":"checkbox", "option":"1:เตาแก้ส"
"key":"ของใช้-กระติกน้ำร้อน", "type":"checkbox", "option":"1:กระติกน้ำร้อนไฟฟ้า"
"key":"ของใช้-พัดลม", "type":"checkbox", "option":"1:พัดลม"
"key":"ของใช้-โทรทัศน์", "type":"checkbox", "option":"1:โทรทัศน์"
"key":"ของใช้-มือถือ", "type":"checkbox", "option":"1:โทรศัพท์มือถือ"
"key":"ของใช้-รถยนต์", "type":"checkbox", "option":"1:รถยนต์"
"key":"ของใช้-จักรยานยนต์", "type":"checkbox", "option":"1:จักรยานยนต์"
"key":"ของใช้-แอร์", "type":"checkbox", "option":"1:แอร์"
"key":"เกณฑ์วัดสิ่งอำนวยความสะดวก", "type":"radio", "option:1:มี 1-3 อย่าง, 2:มี 4-6 อย่าง, 3:มี 7-9 อยาง"

"key":"ที่อยู่-บ้านคงทนถาวร", "type":"radio", "option":"มี,ไม่มี", "pretext":"สภาพบ้านคงทนถาวร"
"key":"ที่อยู่-มีส้วมใช้", "type":"radio", "option":"มี,ไม่มี", "pretext":"มีส้วมใช้"
"key":"ที่อยู่-มีห้องส่วนตัว", "type":"radio", "option":"มี,ไม่มี", "pretext":"ห้องส่วนตัวหรือบริเวณที่จัดเป็นสัดส่วน"
"key":"ที่อยู่-การระบายอากาศ", "type":"radio", "option":"มี,ไม่มี", "pretext":"การระบายอากาศและแสงสว่างที่พอเหมาะ"
"key":"ที่อยู่-บริเวณรอบบ้าน", "type":"radio", "option":"มี,ไม่มี", "pretext":"บริเวณรอบบ้านและในบริเวณมีความเป็นระเบียบเรียบร้อย สะอาดสะอ้าน"
"key":"ที่อยู่-ความปลอดภัยในบ้าน", "type":"radio", "option":"มี,ไม่มี", "pretext":"มีความปลอดภัยภายในบ้าน เช่น มีประตู หน้าต่าง"
"key":"ที่อยู่-เกณฑ์วัดที่อยู่อาศัย", "type":"radio", "option":"1:มีลักษณะดังกล่าว 1 ข้อ หรือไม่มีเลย, 2:มีลักษณะดังกล่าว 2-4 ข้อ, 3:มีลักษณะดังกล่าว 5-6 ข้อ", "display":"block"

ADL-walk
ADL-cook
ADL-clean
ADL-money
ADL-travel

"key":"ผู้ดูแลต่อเนื่อง-สามีภรรยา", "type":"checkbox", "option":"1:สามีหรือภรรยา"
"key":"ผู้ดูแลต่อเนื่อง-ลูกสาว", "type":"checkbox", "option":"1:บุตรสาว"
"key":"ผู้ดูแลต่อเนื่อง-ลูกชาย", "type":"checkbox", "option":"1:บุตรชาย"
"key":"ผู้ดูแลต่อเนื่อง-หลานสาว", "type":"checkbox", "option":"1:หลานสาว"
"key":"ผู้ดูแลต่อเนื่อง-หลานชาย", "type":"checkbox", "option":"1:หลานชาย"
"key":"ผู้ดูแลต่อเนื่อง-หลานเขย", "type":"checkbox", "option":"1:หลานเขย"
"key":"ผู้ดูแลต่อเนื่อง-หลานสะใภ้", "type":"checkbox", "option":"1:หลานสะใภ้"
"key":"ผู้ดูแลต่อเนื่อง-เพื่อนบ้าน", "type":"checkbox", "option":"1:เพื่อนบ้าน"
"key":"ผู้ดูแลต่อเนื่อง-อสม.", "type":"checkbox", "option":"1:อาสาสมัครสาธารณสุขประจำหมู่บ้าน (อสม.)"
"key":"ผู้ดูแลต่อเนื่อง-ผู้ดูแลอื่นๆ", "type":"checkbox", "option":"1:อื่นๆ"
"key":"สรุปการดูแล", "type":"radio", "option":"1:ไม่มีใครดูแลหรือบุคคลภายนอกครอบครัวดูแลไม่ต่อเนื่อง, 2:บุคคลในครอบครัวให้การดูแลไม่ต่อเนื่อง, 3:บุคคลในครอบครัวให้การดูแลอย่างต่อเนื่อง", "display":"block"

"key":"care_need", "type":"radio", "option":"1:ต้องการให้ดูแลอย่างมาก, 2:ต้องการให้ดูแลบ้าง, 3:ไม่ต้องการเลย รู้สึกพึงพอใจแล้ว", "display":"block"
เรื่องที่ต้องการดูแล

"key":"ระยะทางไปสถานบริการ", "type":"radio", "option":"1:ใกล้บ้าน (<5 กม.), 2:ปานกลางไม่ไกล้ไม่ไกล (5-10 กม.), 3:ไกลบ้านมาก (>10 กม.)", "display":"block"
"key":"ความสะดวกในการเดินทางไปสถานบบริการ", "type":"radio", "option":"1:ไม่สะดวก, 2:สะดวก"
เดินทางไปสถานบริการโดย

"key":"บุคคลที่ปรับทุกข์", "type":"radio", "option":"1:ไม่มี, 2:มี"
ผู้ที่ต้องการปรับทุกข์
"key":"ผู้ให้ความช่วยเหลือ", "type":"radio", "option":"1:ไม่มี, 2:มี"
ระบุผู้ให้ความช่วยเหลือ
"key":"กิจกรรมสังคม", "type":"radio", "option":"1:ไม่เข้าร่วม, 2:เข้าร่วม"
กิจกรรมสังคม-1
ความถี่-1
กิจกรรมสังคม-2
ความถี่-2
กิจกรรมสังคม-3
ความถี่-3
กิจกรรมสังคม-4
ความถี่-4

โรคประจำตัว-2
โรคประจำตัว-โรคทางระบบหัวใจและหลอดเลือด
โรคประจำตัว-โรคทางระบบหลอดเลือดสมอง
โรคประจำตัว-โรคระบบกระดูกและข้อ
โรคประจำตัว-โรคระบบทางเดินอาหารและช่องท้อง
โรคประจำตัว-โรคทางเดินปัสสาวะ
โรคประจำตัว-โรคทางตา
โรคประจำตัว-โรคออโตอิมมูน
โรคประจำตัว-โรคระบบทางเดินหายใจ
โรคประจำตัว-โรคระบบต่อมไร้ท่อ
โรคประจำตัว-โรคทางระบบผิวหนัง
โรคประจำตัว-อื่นๆ
ADL
dep1-new
dep2-new
ADLG';
?>