<?php
$qtRadio=array(

		);

$qtText='

	"key":"section1", "section":"ส่วนที่ 1 ข้อมูลทั่วไปของผู้ป่วย"



"key":"section2", "section":"ส่วนที่ 2 สุขภาพกายของผู้ป่วย"
"key":"น้ำหนัก", "type":"text", "posttext":"กิโลกรัม", "class":"w-1 w-center"
"key":"ส่วนสูง", "type":"text", "posttext":"เซนติเมตร", "class":"w-1 w-center"
"key":"Arm span", "type":"text", "posttext":"เซนติเมตร", "class":"w-1 w-center"
"key":"ดัชนีมวลกาย", "type":"text", "label":"ดัชนีมวลกาย (BMI)", "posttext":"กก./ตร.ม.", "class":"w-1 w-center"
"key":"รอบเอว", "type":"text", "posttext":"เซนติเมตร", "class":"w-1 w-center"
"key":"รอบสะโพก", "type":"text", "posttext":"เซนติเมตร", "class":"w-1 w-center"
"key":"ชีพจร", "type":"text", "posttext":"ครั้ง/นาที", "class":"w-1 w-center"
"key":"ชีพจร-ความแรง", "type":"radio", "option":"1:ปกติ, 2:เบา","display":"block"
"key":"ชีพจร-ความเร็ว", "type":"radio", "option":"1:สม่ำเสมอ, 2:ไม่สม่ำเสมอ","display":"block"
"key":"ความดันโลหิต", "type":"text", "posttext":"/มม.ปรอท", "class":"w-1 w-center"
"key":"ความดันโลหิต-ท่าที่ใช้วัด", "type":"radio", "option":"1:นั่ง, 2:นอน","display":"block"
"key":"ความสามารถในการมองเห็น", "type":"radio", "option":"1:เห็นชัดเจน, 2:เห็นไม่ชัดมัว, 3:ไม่เห็น","display":"block"
"key":"ความสามารถในการได้ยิน", "type":"radio", "option":"1:ได้ยินชัดเจน, 2:ได้ยินไม่ชัดเจน, 3:ไม่ได้ยิน","display":"block"

"key":"section-การรับรู้ภาวะสุขภาพ", "subsection":"2.1 การรับรู้ภาวะสุขภาพ"

"key":"สุขภาพ-โดยรวม", "label":"1. สุขภาพโดยทั่วไปของท่านในปัจจุบันเป็นอย่างไร", "type":"radio", "option":"1:ดีมาก, 5:ดี , 2:ปานกลาง, 3:แย่, 4:แย่มาก","display":"block"
"key":"สุขภาพ-เปรียบเทียบ", "label":"2. สุขภาพเป็นอย่างไรเมื่อเปรียบเทียบกับบุคคลอื่นที่มีอายุเท่ากัน", "type":"radio", "option":"1:ดีกว่า, 2:เท่ากัน, 3:ด้อยกว่า","display":"block"
"key":"สุขภาพ-เปรียบเทียบ-ด้อยกว่า", "type":"text", "label":"ระบุ", "class":"-fill", "subqt":true
"key":"อุปกรณ์ทางการแพทย์", "label":"3. อุปกรณ์ทางการแพทย์/เครื่องช่วยเหลือที่ใช้ เช่น ฟันปลอม ไม้เท้า อุปกรณ์ช่วยเดิน รถนั่งเข็น เครื่องช่วยฟัง แว่นตา อื่นๆ", "type":"radio", "option":"1:ไม่มี, 2:มี","display":"block"
"key":"อุปกรณ์ทางการแพทย์-ระบุ", "type":"text", "label":"ระบุ", "class":"-fill", "subqt":true


"key":"section-โรคและการเจ็บป่วย", "subsection":"2.2 โรคและการเจ็บป่วย"
"key":"โรคประจำตัว-ความดันโลหิตสูง", "type":"radio", "label":"1. ความดันโลหิตสูง", "option":"1:มี/เป็น, 2:ไม่มี/ไม่เป็น, 3:ไม่ทราบ"
"key":"โรคประจำตัว-เบาหวาน", "type":"radio", "label":"2. เบาหวาน", "option":"1:มี/เป็น, 2:ไม่มี/ไม่เป็น, 3:ไม่ทราบ"
"key":"โรคประจำตัว-โรคหัวใจ", "type":"radio", "label":"3. โรคหัวใจ", "option":"1:มี/เป็น, 2:ไม่มี/ไม่เป็น, 3:ไม่ทราบ"
"key":"โรคประจำตัว-โรคหัวใจ-ระบุ", "type":"text", "label":"ระบุ", "class":"-fill", "subqt":true
"key":"โรคประจำตัว-หลอดลมอักเสบ", "type":"radio", "label":"4. หลอดลมอักเสบ", "option":"1:มี/เป็น, 2:ไม่มี/ไม่เป็น, 3:ไม่ทราบ"
"key":"โรคประจำตัว-โรคถุงลมโป่งพอง", "type":"radio", "label":"5. ถุงลมโป่งพอง", "option":"1:มี/เป็น, 2:ไม่มี/ไม่เป็น, 3:ไม่ทราบ"
"key":"โรคประจำตัว-โรคปอด", "type":"radio", "label":"6. ปอดอักเสบ/หอบหืด", "option":"1:มี/เป็น, 2:ไม่มี/ไม่เป็น, 3:ไม่ทราบ"
"key":"โรคประจำตัว-วัณโรคปอด", "type":"radio", "label":"7. วัณโรคปอด", "option":"1:มี/เป็น, 2:ไม่มี/ไม่เป็น, 3:ไม่ทราบ"
"key":"โรคประจำตัว-ต้อหิน", "type":"radio", "label":"8. ต้อหิน", "option":"1:มี/เป็น, 2:ไม่มี/ไม่เป็น, 3:ไม่ทราบ"
"key":"โรคประจำตัว-ต้อกระจก", "type":"radio", "label":"9. ต้อกระจก", "option":"1:มี/เป็น, 2:ไม่มี/ไม่เป็น, 3:ไม่ทราบ"
"key":"โรคประจำตัว-มะเร็ง", "type":"radio", "label":"10. มะเร็ง", "option":"1:มี/เป็น, 2:ไม่มี/ไม่เป็น, 3:ไม่ทราบ"
"key":"โรคประจำตัว-ต่อมลูกหมากโต", "type":"radio", "label":"11. ต่อมลูกหมากโต", "option":"1:มี/เป็น, 2:ไม่มี/ไม่เป็น, 3:ไม่ทราบ"
"key":"โรคประจำตัว-กระเพาะอาหาร", "type":"radio", "label":"12. กระเพาะอาหาร / กระเพาะอาหารอักเสบ", "option":"1:มี/เป็น, 2:ไม่มี/ไม่เป็น, 3:ไม่ทราบ"
"key":"โรคประจำตัว-เก๊าท์", "type":"radio", "label":"13. ข้อเสื่อม เก๊าต์ รูมาตอยด์ ปวดข้อ", "option":"1:มี/เป็น, 2:ไม่มี/ไม่เป็น, 3:ไม่ทราบ"
"key":"โรคประจำตัว-พาร์กินสัน", "type":"radio", "label":"14. โรคพาร์กินสัน โรคสั่น", "option":"1:มี/เป็น, 2:ไม่มี/ไม่เป็น, 3:ไม่ทราบ"
"key":"โรคประจำตัว-ไตวาย", "type":"radio", "label":"15. ไต", "option":"1:มี/เป็น, 2:ไม่มี/ไม่เป็น, 3:ไม่ทราบ"
"key":"โรคประจำตัว-ไตวาย-ระบุ", "type":"text", "label":"ระบุ", "class":"-fill", "subqt":true
"key":"โรคประจำตัว-อัลไซเมอร์", "type":"radio", "label":"16. สมองเสื่อม โรคหลงลืม ความจำเสื่อม", "option":"1:มี/เป็น, 2:ไม่มี/ไม่เป็น, 3:ไม่ทราบ"
"key":"ภาวะแทรกซ้อน-แผลกดทับ", "type":"radio", "label":"17. แผลกดทับ", "option":"1:มี/เป็น, 2:ไม่มี/ไม่เป็น, 3:ไม่ทราบ"
"key":"โรคประจำตัว-อื่นๆ", "type":"text", "label":"18. โรคอื่น ๆ", "pretext":"โรคอื่น ๆ ระบุ"




"key":"section-ปัญหาสำคัญของผู้ป่วย", "subsection":"2.3 ปัญหาสำคัญของผู้ป่วย (ภายใน 6 เดือน)"

"key":"อาการ-หกล้ม", "type":"radio", "label":"1. หกล้ม", "option":"1:มี/เป็น, 2:ไม่มี/ไม่เป็น, 3:ไม่ทราบ"
"key":"อาการ-ระบุ-หกล้ม", "type":"text", "label":" ", "class":"-fill", "pretext":"ถ้ามี ระบุ","posttext":"<em>(ความถี่ สถานที่ วันเวลา กลางวัน-กลางคืน)</em>"

"key":"อาการ-กลั้นปัสสาวะไม่อยู่", "type":"radio", "label":"2. กลั้นปัสสาวะไม่อยู่ <em>(มีปัสสาวะเล็ด-ราด ปัสสาวะลำบาก ไม่สามารถกลั้นปัสสาวะได้ขณะไอ หัวเราะ หรือเคลื่อนไหว ไม่สามารถควบคุมการขับปัสสาวะได้)</em>", "option":"1:มี/เป็น, 2:ไม่มี/ไม่เป็น, 3:ไม่ทราบ"
"key":"อาการระบุ-กลั้นปัสสาวะไม่อยู่", "type":"text", "label":" ", "class":"-fill", "pretext":"ถ้ามี ระบุ","posttext":"<em>(ความถี่ จำนวน ระยะเวลา)</em>"

"key":"อาการ-ท้องผูก", "type":"radio", "label":"3. ท้องผูก/อุจจาระราด <em>(ไม่สามารถกลั้นอุจจาระได้)</em>", "option":"1:มี/เป็น, 2:ไม่มี/ไม่เป็น, 3:ไม่ทราบ"
"key":"อาการ-ระบุ-ท้องผูก", "type":"text", "label":" ", "class":"-fill", "pretext":"ถ้ามี ระบุ"

"key":"อาการ-นอนไม่หลับ", "type":"radio", "label":"4. มีปัญหาเรื่องการนอนหลับ <em>(ตื่นกลางคืน นอนหลับกลางวันมา อื่นๆ)</em>", "option":"1:มี/เป็น, 2:ไม่มี/ไม่เป็น, 3:ไม่ทราบ"
"key":"อาการ-ระบุ-นอนไม่หลับ", "type":"text", "label":" ", "class":"-fill", "pretext":"ถ้ามี ระบุ"

"key":"อาการ-หลงลืม", "type":"radio", "label":"5. สูญเสียความจำ <em>(ขี้ลืม ทบทวนความจำได้ยาก)</em>", "option":"1:มี/เป็น, 2:ไม่มี/ไม่เป็น, 3:ไม่ทราบ"
"key":"อาการ-ระบุ-หลงลืม", "type":"text", "label":" ", "class":"-fill", "pretext":"ถ้ามี ระบุ"

"key":"อาการ-รับประทานอาหาร", "type":"radio", "label":"6. มีปัญหาเรื่องการรับประทานอาหาร <em>(เคี้ยวและกลืนลำบาก ไม่อยากรับประทานอาหาร มีอาการเจ็บปวดในช่องปาก)</em>", "option":"1:มี/เป็น, 2:ไม่มี/ไม่เป็น, 3:ไม่ทราบ"
"key":"อาการ-ระบุ-รับประทานอาหาร", "type":"text", "label":" ", "class":"-fill", "pretext":"ถ้ามี ระบุ"

"key":"อาการ-การได้ยิน", "type":"radio", "label":"7. มีปัญหาเรื่องการได้ยิน <em>(ได้ยินไม่ชัดเจน ใช้เครื่องช่วยฟัง)</em>", "option":"1:มี/เป็น, 2:ไม่มี/ไม่เป็น, 3:ไม่ทราบ"
"key":"อาการ-ระบุ-การได้ยิน", "type":"text", "label":" ", "class":"-fill", "pretext":"ถ้ามี ระบุ"

"key":"อาการ-การมองเห็น", "type":"radio", "label":"8. มีปัญหาเรื่องการมองเห็น <em>(สายตายาว มองเห็นไม่ชัดเจน)</em>", "option":"1:มี/เป็น, 2:ไม่มี/ไม่เป็น, 3:ไม่ทราบ"
"key":"อาการ-ระบุ-การมองเห็น", "type":"text", "label":" ", "class":"-fill", "pretext":"ถ้ามี ระบุ"

"key":"อาการ-การเคลื่อนที่", "type":"radio", "label":"9. มีปัญหาเรื่องการเคลื่อนที่ <em>(เดินลำบาก ต้องใช้อุปกรณ์ช่วยเดิน)</em>", "option":"1:มี/เป็น, 2:ไม่มี/ไม่เป็น, 3:ไม่ทราบ"
"key":"อาการ-ระบุ-การเคลื่อนที่", "type":"text", "label":" ", "class":"-fill", "pretext":"ถ้ามี ระบุ"


"key":"อาการ-การนอนกรน", "type":"radio", "label":"10. มีปัญหาเรื่องการนอนกรน", "option":"1:มี/เป็น, 2:ไม่มี/ไม่เป็น, 3:ไม่ทราบ"
"key":"อาการ-ระบุ-การนอนกรน", "type":"text", "label":" ", "class":"-fill", "pretext":"ถ้ามี ระบุ"

"key":"อาการ-อื่นๆ", "type":"radio", "label":"11. ปัญหาอื่นๆ", "option":"1:มี/เป็น, 2:ไม่มี/ไม่เป็น, 3:ไม่ทราบ"
"key":"อาการ-ระบุ-อื่นๆ", "type":"text", "label":" ", "class":"-fill", "pretext":"ถ้ามี ระบุ"


"key":"section-พฤติกรรมสุขภาพ", "subsection":"2.4 พฤติกรรมสุขภาพ (ในรอบ 6 เดือนที่ผ่านมา)"

"key":"พฤติกรรม-ออกกำลังกาย", "type":"radio", "label":"1. ท่านออกกำลังกายหรือไม่", "option":"1:ไม่เลย, 2:ได้ทำบางครั้ง, 3:ได้ทำสม่ำเสมอ"
"key":"พฤติกรรม-ระบุ-ออกกำลังกาย", "type":"text", "label":" ", "class":"-fill", "pretext":"ถ้าทำ ระบุ", "posttext":"<em>(ชนิด  จำนวนวันต่อสัปดาห์  และระยะเวลาที่ใช้)</em>"

"key":"พฤติกรรม-งานอดิเรก", "type":"radio", "label":"2. ท่านทำงานอดิเรก  เช่น  ทำสวน  เย็บปักถักร้อย  จักสาน  วาดรูป  เลี้ยงสัตว์  อื่นๆ  หรือไม่", "option":"1:ไม่เลย, 2:ได้ทำบางครั้ง, 3:ได้ทำสม่ำเสมอ"
"key":"พฤติกรรม-ระบุ-งานอดิเรก", "type":"text", "label":" ", "class":"-fill", "pretext":"ถ้าทำ ระบุ", "posttext":"<em>(ประเภทงานอดิเรก  จำนวนวันต่อสัปดาห์  และระยะเวลาที่ใช้)</em>"

"key":"พฤติกรรม-สูบบุหรี่", "type":"radio", "label":"3. ท่านสูบบุหรี่หรือไม่", "option":"1:ไม่เลย, 2:ได้ทำบางครั้ง, 3:ได้ทำสม่ำเสมอ"
"key":"พฤติกรรม-ระบุ-สูบบุหรี่", "type":"text", "label":" ", "class":"-fill", "pretext":"ถ้าทำ ระบุ", "posttext":"<em>(ชนิด  จำนวนที่สูบต่อวัน)</em>"

"key":"พฤติกรรม-ดื่มสุรา", "type":"radio", "label":"4. ท่านดื่มสุราหรือไม่", "option":"1:ไม่เลย, 2:ได้ทำบางครั้ง, 3:ได้ทำสม่ำเสมอ"
"key":"พฤติกรรม-ระบุ-ดื่มสุรา", "type":"text", "label":" ", "class":"-fill", "pretext":"ถ้าทำ ระบุ", "posttext":"<em>(ชนิด  จำนวนที่ที่ดื่มต่อสัปดาห์)</em>"

"key":"พฤติกรรม-รับประทานอาหาร", "type":"radio", "label":"5. ท่านได้รับประทานอาหาร ทั้งเนื้อสัตว์ แป้ง และไขมัน เพียงพอกับความต้องการในแต่ละวัน หรือไม่", "option":"1:ไม่เลย, 2:ได้ทำบางครั้ง, 3:ได้ทำสม่ำเสมอ"
"key":"พฤติกรรม-ระบุ-รับประทานอาหาร", "type":"text", "label":" ", "class":"-fill", "pretext":"ถ้าไม่เพียงพอ ระบุ", "posttext":"<em>(ปริมาณต่อวัน ประเภทอาหารที่ขาด)</em>"

"key":"พฤติกรรม-รับประทานผัก", "type":"radio", "label":"6. ท่านรับประทานผัก ผลไม้สม่ำเสมอหรือไม่", "option":"1:ไม่เลย, 2:ได้ทำบางครั้ง, 3:ได้ทำสม่ำเสมอ"
"key":"พฤติกรรม-ระบุ-รับประทานผัก", "type":"text", "label":" ", "class":"-fill", "pretext":"ถ้ารับประทานสม่ำเสมอ ระบุ", "posttext":"<em>(จำนวนครั้ง/สัปดาห์)</em>"

"key":"พฤติกรรม-อาหารเสริม", "type":"radio", "label":"7. ท่านรับประทานอาหารเสริมหรือไม่ (รวมทั้งสมุนไพร วิตามิน แร่ธาตุ)", "option":"1:ไม่เลย, 2:ได้ทำบางครั้ง, 3:ได้ทำสม่ำเสมอ"
"key":"พฤติกรรม-ระบุ-อาหารเสริม", "type":"text", "label":" ", "class":"-fill", "pretext":"ถ้ารับประทาน ระบุ", "posttext":"<em>(ประเภท ปริมาณ จำนวนครั้งต่อสัปดาห์)</em>"

"key":"พฤติกรรม-ตรวจร่างกาย", "type":"radio", "label":"8. ท่านตรวจร่างกายสม่ำเสมอหรือไม่ (หมายถึงการตรวจร่างกายโดยไม่ได้มารักษาโรค)", "option":"1:ไม่เลย, 2:ได้ทำบางครั้ง, 3:ได้ทำสม่ำเสมอ"
"key":"พฤติกรรม-ระบุ-ตรวจร่างกาย", "type":"text", "label":" ", "class":"-fill", "pretext":"ถ้าตรวจ ระบุ", "posttext":"<em>(จำนวนครั้งต่อปี สถานที่ไปตรวจ)</em>"

"key":"พฤติกรรม-ร่วมกิจกรรม", "type":"radio", "label":"9. ท่านเข้าร่วมกิจกรรมของชุมชนบ้างหรือไม่ เช่น การพัฒนาชุมชนการประชุมในชุมชน บ้างหรือไม่", "option":"1:ไม่เลย, 2:ได้ทำบางครั้ง, 3:ได้ทำสม่ำเสมอ"
"key":"พฤติกรรม-ระบุ-ร่วมกิจกรรม", "type":"text", "label":" ", "class":"-fill", "pretext":"ถ้าร่วม ระบุ", "posttext":"<em>(ประเภทของกิจกรรม จำนวนครั้งต่อสัปดาห์/เดือน)</em>"

	UPDATE `sgz_imed_qt` SET `part`="ADL-Feeding" WHERE `part` LIKE "ADL-cook";
	UPDATE `sgz_imed_qt` SET `part`="ADL-Grooming" WHERE `part` LIKE "ADL-clean";
	UPDATE `sgz_imed_qt` SET `part`="ADL-Transfer" WHERE `part` LIKE "ADL-walk";
	UPDATE `sgz_imed_qt` SET `part`="ADL-Toilet use" WHERE `part` LIKE "ADL-toilet";
	UPDATE `sgz_imed_qt` SET `part`="ADL-Mobility" WHERE `part` LIKE "ADL-travel";
	UPDATE `sgz_imed_qt` SET `part`="ADL-Dressing" WHERE `part` LIKE "ADL-dress";
	UPDATE `sgz_imed_qt` SET `part`="ADL-Stair" WHERE `part` LIKE "ADL-stairs";
	UPDATE `sgz_imed_qt` SET `part`="ADL-Bathing" WHERE `part` LIKE "ADL-bath";
	UPDATE `sgz_imed_qt` SET `part`="ADL-Bowel" WHERE `part` LIKE "ADL-defecation";
	UPDATE `sgz_imed_qt` SET `part`="ADL-Bladder" WHERE `part` LIKE "ADL-urination";


"key":"section3", "section":"ส่วนที่ 3 ความสามารถเชิงปฏิบัติของผู้ป่วย"
"key":"section3.1", "subsection":"ความสามารถในการปฏิบัติกิจวัตรประจำวันพื้นฐาน (ดัชนีบาร์เธลเอดีแอล : Barthel ADL Index)"

"key":"ADL-Feeding", "type":"radio", "label":"1. Feeding (รับประทานอาหารเมือเตรียมสำรับไว้ให้เรียบร้อยต่อหน้า)", "option":"0:0 = ไม่สามารถตักอาหารเข้าปากได้ ต้องมีคนช่วยป้อนให้,1:1 = ตักอาหารเองได้ แต่งต้องมีคนช่วย เช่น ช่วยใช้ช้อนตักเตรียมไว้ให้ หรือตัดให้เป็นชิ้นเล็กๆ ไว้ล่วงหน้า,2:2 = ตักอาหารและช่วยตนเองได้เป็นปกติ", "display":"block"

"key":"ADL-Grooming", "type":"radio", "label":"2. Grooming (ล้างหน้า หวีผม แปรงฟัน โกนหนวด ในระยะ 24 – 48 ชั่วโมงที่ผ่านมา)", "option":"0:0 = ความต้องการความช่วยเหลือ,1:1 = ทำได้เอง (รวมทั้งที่ทำได้เองถ้าเตรียมอุปกรณ์ไว้ให้)", "display":"block"

"key":"ADL-Transfer", "type":"radio", "label":"3. Transfer (ลุกนั่งจากที่นอน หรือจากเตียงไปยังเก้าอี้)>", "option":"0:0 = ไม่สามารถนั่งได้ (นั่งแล้วจะล้มเสมอ) หรือต้องใช้สองคนช่วยกันยกขึ้น,1:1 = ต้องการความช่วยเหลืออย่างมากจึงจะนั่งได้ เช่น ต้องใช้คนที่แข็งแรงหรือมีทักษะ 1 คน หรือใช้คนทั่วไป 2 คน พยุงหรือดันขึ้นมาจึงจะนั่งอยู่ได้,2:2 = ต้องการความช่วยเหลือบ้าง เช่น บอกให้ทำตาม หรือช่วยพยุงเล็กน้อย หรือต้องมีคนช่วยดูแลเพื่อความปลอดภัย,3:3 = ทำได้เอง", "display":"block"

"key":"ADL-Toilet use", "type":"radio", "label":"4. Toilet use (ใช้ห้องสุขา)", "option":"0:0 = ช่วยเหลือตนเองไม่ได้,1:1 = ทำเองได้บ้าง (อย่างน้อยทำความสะอาดตนเองได้หลังธุระ) แต่ต้องการความช่วยเหลือในบางสิ่ง,2:2 = ช่วยเหลือตนเองได้ดี (ขึ้นนั่งหรือลงจากชักโครกได้เอง ทำความสะอาดได้เรียบร้อยหลังจากเสร็จธุระ ถอดใส่เสื้อผ้าได้เรียบร้อย)", "display":"block"

"key":"ADL-Mobility", "type":"radio", "label":"5. Mobility (การเคลื่อนที่ภายในห้องหรือบ้าน)", "option":"0:0 = เคลื่อนที่ไปไหนไม่ได้,1:1 = ต้องใช้รถเข็นช่วยตัวเองให้เคลื่อนที่ได้เอง (ไม่ต้องมีคนเข็นให้) และจะต้องเข้าออกมุมห้องหรือประตูได้,2:2 = เดินหรือเคลื่อนที่โดยมีคนช่วย เช่น พยุง หรือบอกให้ทำตาม หรือต้องให้ความสนใจดูแลเพื่อความปลอดภัย,3:3 = เดินหรือเคลื่อนที่ได้เอง", "display":"block"

"key":"ADL-Dressing", "type":"radio", "label":"6. Dressing (การสวมใส่เสื้อผ้า)", "option":"0:0 = ต้องมีคนสวมใส่ให้ ช่วยเหลือตนเองแทบไม่ได้หรือน้อย,1:1 = ช่วยเหลือตนเองได้ราว ร้อยละ 50,2:2 = ช่วยเหลือตนเองได้ดี (รวมทั้งการติดกระดุม รูดซิป หรือใช้เสื้อผ้าที่ดัดแปลงให้เหมาะสมก็ได้)", "display":"block"

"key":"ADL-Stair", "type":"radio", "label":"7. Stair (การขึ้นลงบันได 1 ชั้น)", "option":"0:0 = ไม่สามารถทำได้,1:1 = ต้องการคนช่วย,2:2 = ขึ้นลงได้เอง (ถ้าต้องใช้เครื่องช่วยเดิน เช่น Walker จะต้องเอาขึ้นลงได้ด้วย)", "display":"block"

"key":"ADL-Bathing", "type":"radio", "label":"8. Bathing (การอาบน้ำ)", "option":"0:0 = ต้องมีคนช่วยหรือทำให้,1:1 = อาบน้ำเองได้", "display":"block"

"key":"ADL-Bowel", "type":"radio", "label":"9. Bowel (การกลั้นการถ่ายอุจจาระในระยะ 1 สัปดาห์ที่ผ่านมา)", "option":"0:0 = กลั้นไม่ได้ หรือต้องการการสวนอุจจาระอย่างสม่ำเสมอ,1:1 = กลั้นไม่ได้เป็นบางครั้ง (เป็นน้อยกว่า 1 ครั้ง ต่อสัปดาห์),2:2 = กลั้นได้ปกติ", "display":"block"

"key":"ADL-Bladder", "type":"radio", "label":"10. Bladder (การกลั้นปัสสาวะในระยะ 1 สัปดาห์ ที่ผ่านมา)", "option":"0:0 = กลั้นไม่ได้ หรือใส่สายสวนปัสสาวะแต่ไม่สามารถดูแลตนเองได้,1:1 = กลั้นไม่ได้บางครั้ง (เป็นน้อยกว่าวันละ 1ครั้ง),2:2 = กลั้นได้เป็นปกติ", "display":"block"

"key":"remark-ADL", "type":"textfield", "label":" ", "pretext":"หมายเหตุ<br />1. เป็นการวัดว่าผู้ป่วยทำอะไรได้บ้าง (ทำอยู่ได้จริง) ไม่ใช่เป็นการทดสอบว่า/หรือถามว่าสามารถทำได้หรือไม่<br />2. โดยทั่วเป็นการสอบถามถึงกิจที่ปฏิบัติในระยะ 24 -48 ชั่วโมง<br />3. จุดประสงค์เป็นการวัดระดับ Independence ดังนั้น ถ้าหากมีคนคอยดูแลหรือเฝ้าระวังเวลาปฏิบัติกิจให้ถือว่าได้คะแนนไม่เต็ม<br />4. ถ้าหมดสติให้คะแนน 0 ทั้งหมด<br />5. ระดับความรุนแรงของ BAI<br />* 0-4 = very low initial score (total dependence)<br />* 5-8 = low initial score (severe dependence)<br />* 9-11 = intermediate initial score (mild severe dependence , consideration of discharging home)<br />* 12 = initial high (mild severe dependence, consideration of discharging home)"





"key":"section4", "section":"ส่วนที่ 4 สุขภาพจิตผู้ป่วย"
"key":"section4.1", "subsection":"4.1 ภาวะซึมเศร้า (แบบวัดความซึมเศร้าในผู้สูงอายุของไทย Thai Geriatric Depression Scale : TGDS) ในช่วง 1 สัปดาห์ที่ผ่านมา"
"key":"section4.1.msg", "type":"textfield", "label":" ", "pretext":"<b>คำชี้แจง</b> โปรดอ่านข้อความแต่ละข้ออย่างละเอียด และประเมินความรู้สึกของผู้ป่วยในช่วงเวลาหนึ่งสัปดาห์ที่ผ่านมา และให้ขีด / ลงในช่องที่ตรงกับ “ใช่” ถ้าข้อความนั้นตรงกับความรู้สึกของผู้ป่วยให้ขีด / ลงในช่องที่ตรงกับ “ไม่ใช่” ถ้าข้อความนั้นไม่ตรงกับความรู้สึกของผู้ป่วยและในกรณีที่ผู้ป่วย ถ้าสามารถอ่านออกและเขียนได้ สามารถทำแบบประเมินนี้ได้ด้วยตนเอง"
"key":"TGDS-01", "type":"radio", "label":"1. ท่านพอใจกับชีวิตความเป็นอยู่ตอนนี้", "option":"0:0 = ใช่,1:1 = ไม่ใช่", "display":"block"
"key":"TGDS-02", "type":"radio", "label":"2. ท่านไม่อยากทำในสิ่งที่เคยสนใจหรือเคยทำเป็นประจำ", "option":"1:1 = ใช่,0:0 = ไม่ใช่", "display":"block"
"key":"TGDS-03", "type":"radio", "label":"3. ท่านรู้สึกชีวิตของท่านช่วงนี้ว่างเปล่าไม้รู้จะทำอะไร", "option":"1:1 = ใช่,0:0 = ไม่ใช่", "display":"block"
"key":"TGDS-04", "type":"radio", "label":"4. ท่านรู้สึกเบื่อหน่ายบ่อยๆ", "option":"1:1 = ใช่,0:0 = ไม่ใช่", "display":"block"
"key":"TGDS-05", "type":"radio", "label":"5. ท่านหวังว่าจะมีสิ่งที่ดีเกิดขึ้นในวันหน้า", "option":"0:0 = ใช่,1:1 = ไม่ใช่", "display":"block"
"key":"TGDS-06", "type":"radio", "label":"6. ท่านมีเรื่องกังวลตลอดเวลา และเลิกคิดไม่ได้", "option":"1:1 = ใช่,0:0 = ไม่ใช่", "display":"block"
"key":"TGDS-07", "type":"radio", "label":"7. ส่วนใหญ่แล้วท่านรู้สึกอารมณ์ดี", "option":"0:0 = ใช่,1:1 = ไม่ใช่", "display":"block"
"key":"TGDS-08", "type":"radio", "label":"8. ท่านรู้สึกกลัวว่าจะมีเรื่องไม่ดีเกิดขึ้นกับท่าน", "option":"1:1 = ใช่,0:0 = ไม่ใช่", "display":"block"
"key":"TGDS-09", "type":"radio", "label":"9. ส่วนใหญ่ท่านรู้สึกมีความสุข", "option":"0:0 = ใช่,1:1 = ไม่ใช่", "display":"block"
"key":"TGDS-10", "type":"radio", "label":"10. บ่อยครั้งที่ท่านรู้สึกไม่มีที่พึ่ง", "option":"1:1 = ใช่,0:0 = ไม่ใช่", "display":"block"
"key":"TGDS-11", "type":"radio", "label":"11. ท่านรู้สึกกระวนกระวาย กระสับการส่ายบ่อยๆ", "option":"1:1 = ใช่,0:0 = ไม่ใช่", "display":"block"
"key":"TGDS-12", "type":"radio", "label":"12. ท่านชอบอยู่กับบ้านมากกว่าที่จะออกนอกบ้าน", "option":"1:1 = ใช่,0:0 = ไม่ใช่", "display":"block"
"key":"TGDS-13", "type":"radio", "label":"13. บ่อยครั้งที่ท่านรู้สึกวิตกกังวลเกี่ยวกับชีวิตข้างหน้า", "option":"1:1 = ใช่,0:0 = ไม่ใช่", "display":"block"
"key":"TGDS-14", "type":"radio", "label":"14. ท่านคิดว่าความจำท่านไม่ดีเท่ากับคนอื่น", "option":"1:1 = ใช่,0:0 = ไม่ใช่", "display":"block"
"key":"TGDS-15", "type":"radio", "label":"15. การที่มีชีวิตอยู่ถึงปัจจุบันนี้เป็นเรื่องที่น่ายินดีหรือไม่", "option":"0:0 = ใช่,1:1 = ไม่ใช่", "display":"block"
"key":"TGDS-16", "type":"radio", "label":"16. ท่านรู้สึกหมดกำลังใจหรือเศร้าใจบ่อยๆ", "option":"1:1 = ใช่,0:0 = ไม่ใช่", "display":"block"
"key":"TGDS-17", "type":"radio", "label":"17. ท่านรู้สึกว่าชีวิตท่านค่อนข้างไม่มีคุณค่า", "option":"1:1 = ใช่,0:0 = ไม่ใช่", "display":"block"
"key":"TGDS-18", "type":"radio", "label":"18. ท่านรู้สึกกังวลมากกับชีวิตที่ผ่านมา", "option":"1:1 = ใช่,0:0 = ไม่ใช่", "display":"block"
"key":"TGDS-19", "type":"radio", "label":"19. ท่านรู้สึกว่าชีวิตนี้มีเรื่องน่าสนุกอีกมาก", "option":"0:0 = ใช่,1:1 = ไม่ใช่", "display":"block"
"key":"TGDS-20", "type":"radio", "label":"20. ท่านรู้สึกลำบากที่จะเริ่มต้นทำอะไรใหม่", "option":"1:1 = ใช่,0:0 = ไม่ใช่", "display":"block"
"key":"TGDS-21", "type":"radio", "label":"21. ท่านรู้สึกกระตือรือร้น", "option":"0:0 = ใช่,1:1 = ไม่ใช่", "display":"block"
"key":"TGDS-22", "type":"radio", "label":"22. ท่านรู้สึกสิ้นหวัง", "option":"1:1 = ใช่,0:0 = ไม่ใช่", "display":"block"
"key":"TGDS-23", "type":"radio", "label":"23. ท่านคิดว่าคนอื่นดีกว่าท่าน", "option":"1:1 = ใช่,0:0 = ไม่ใช่", "display":"block"
"key":"TGDS-24", "type":"radio", "label":"24. ท่านอารมณ์เสียง่ายกับเรื่องเล็กๆน้อยๆ อยู่เสมอ", "option":"1:1 = ใช่,0:0 = ไม่ใช่", "display":"block"
"key":"TGDS-25", "type":"radio", "label":"25. ท่านรู้สึกอยากร้องไห้บ่อยๆ", "option":"1:1 = ใช่,0:0 = ไม่ใช่", "display":"block"
"key":"TGDS-26", "type":"radio", "label":"26. ท่านมีความตั้งใจทำสิ่งใดสิ่งหนึ่งได้ไม่นาน", "option":"1:1 = ใช่,0:0 = ไม่ใช่", "display":"block"
"key":"TGDS-27", "type":"radio", "label":"27. ท่านรู้สึกสดชื่นในเวลาตื่นนอนตอนเช้า", "option":"0:0 = ใช่,1:1 = ไม่ใช่", "display":"block"
"key":"TGDS-28", "type":"radio", "label":"28. ท่านไม่อยากพบปะพูดคุยกับคนอื่น", "option":"1:1 = ใช่,0:0 = ไม่ใช่", "display":"block"
"key":"TGDS-29", "type":"radio", "label":"29. ท่านตัดสินใจอะไรได้เร็ว", "option":"0:0 = ใช่,1:1 = ไม่ใช่", "display":"block"
"key":"TGDS-30", "type":"radio", "label":"30 ท่านมีจิตใจสบายแจ่มใสเหมือนก่อน", "option":"0:0 = ใช่,1:1 = ไม่ใช่", "display":"block"

"key":"section-TGDS-remark", "type":"textfield", "label":" ", "pretext":"<b>หมายเหตุ</b> <br />1. การคิดคะแนน ข้อ 1,5,7,9,15,19,21,27,29,30 ถ้าตอบว่า “ไม่ใช่” ได้ 1 คะแนน ข้อที่เหลือถ้าตอบว่า “ใช่” ได้ 1 คะแนน<br />2. การแปลผล<br />* ผู้สูงอายุปกติ คะแนน 0 – 12 คะแนน<br />* ผู้มีความเศร้าเล็กน้อย (Mild depression) คะแนน 13 – 18 คะแนน<br />* ผู้มีความเศร้าปานกลาง (Moderate depression) คะแนน 19 – 24 คะแนน<br />* ผู้มีความเศร้ารุนแรง (Severe depression) คะแนน 25 – 30 คะแนน"









"key":"section5", "section":"ส่วนที่ 5 สุขภาพสังคมผู้ป่วย"
"key":"section5.1", "subsection":"5.1 สัมพันธภาพในครอบครัวและชุมชน"

"key":"สมาชิก-คู่สมรส", "type":"radio", "label":"5.1.1 คู่สมรส", "option":"0: ถึงแก่กรรม, 1:มีชีวิตอยู่", "display":"block"
"key":"คู่สมรส-อายุ", "type":"text", "label":"อายุ", "subqt":true
"key":"คู่สมรส-อาชีพ", "type":"text", "label":"อาชีพ", "class":"-fill", "subqt":true
"key":"สมาชิก-บุตร-h", "text":"<b>5.1.2 บุตร</b>"
"key":"สมาชิก-บุตร", "type":"text", "label":"มีชีวิตอยู่", "posttext":"คน", "subqt":true
"key":"สมาชิก-บุตรถึงแก่กรรม", "type":"text", "label":"ถึงแก่กรรม", "posttext":"คน", "subqt":true
"key":"สมาชิก-ชื่อ","type":"textarea","label":" ","pretext":"ชื่อบุตรที่มีชีวิตอยู่"
"key":"รวมสมาชิกครอบครัว", "type":"text", "label":"5.1.3 บุคคลที่อยู่ในครอบครัว/ครัวเรือน (ปัจจุบัน)", "pretext":"จำนวน", "posttext":"คน"
"key":"สมาชิก-ครอบครัว","type":"textarea","label":" ", "pretext":"ชื่อบุคคลที่อยู่ในครอบครัว/ครัวเรือน"


"key":"section.5.2", "subsection":"5.2 แหล่งสนับสนุนด้านการเงิน"
"key":"การเงิน-จาก-คู่สมรส", "type":"checkbox", "label":"5.2.1 แหล่ง/ผู้ช่วยท่านด้านการเงินคือใคร (เลือกได้มากกว่า 1 คำตอบ พร้อมจัดลำดับความสำคัญตามการรับรู้)", "option":"1:คู่สมรส"
"key":"การเงิน-จาก-รัฐบาลหรือชุมชน", "type":"checkbox", "label":" ", "option":"1:รัฐบาลหรือชุมชน"
"key":"การเงิน-จาก-บุตร", "type":"checkbox", "label":" ", "option":"1:บุตร"
"key":"การเงิน-จาก-หน่วยงาน", "type":"checkbox", "label":" ", "option":"1:หน่วยงาน"
"key":"การเงิน-จาก-ระบุ-หน่วยงาน", "type":"text", "label":" ", "pretext":"ระบุ"
"key":"การเงิน-จาก-หลาน", "type":"checkbox", "label":" ", "option":"1:หลาน"
"key":"การเงิน-จาก-ญาติ", "type":"checkbox", "label":" ", "option":"1:ญาติ"
"key":"การเงิน-จาก-ระบุ-ญาติ", "type":"text", "label":" ", "pretext":"ระบุ"
"key":"การเงิน-จาก-บำเหน็จบำนาญ", "type":"checkbox", "label":" ", "option":"1:บำเหน็จ บำนาญ"
"key":"การเงิน-จาก-อื่นๆ", "type":"checkbox", "label":" ", "option":"1:อื่นๆ"
"key":"การเงิน-จาก-ระบุ-อื่นๆ", "type":"text", "label":" ", "pretext":"ระบุ"

"key":"PSNL.1.10.1", "label": "การประกันสุขภาพ", "type":"radio", "option":"สิทธิข้าราชการ/วิสาหกิจ, สิทธิประกันสังคม, สิทธิหลักประกันสุขภาพถ้วนหน้า (ท.74), สิทธิหลักประกันสุขภาพถ้วนหน้า, สิทธิ์ประกันชีวิต, สิทธิว่าง (อยู่ระหว่างรอสิทธิ์), สิทธิว่าง (ไม่มีสิทธิ์ใด ๆ), ประกันสุขภาพเอกชน, สิทธิอื่น ๆ","display":"block"
"key":"PSNL.1.10.1.IDENTIFY", "type":"text", "label":" ", "pretext":"ระบุ"

"key":"การเงิน-จ่ายค่ารักษา", "type":"radio", "label":"5.2.2 ท่านสามารถจ่าย/จัดการกับค่ารักษาพยาบาลของตนได้", "option":"1:ใช่,2:ไม่ใช่"
"key":"การเงิน-จ่ายค่ารักษา.IDENTIFY", "type":"text", "label":" ", "pretext":"ระบุ"

"key":"การเงิน-วางแผน", "type":"radio", "label":"5.2.3 ท่านรับคำแนะนำเกี่ยวกับการวางแผนเรื่องการเงินสำหรับการดูแลตัวท่านเองระยะยาวหรือไม่", "option":"1:ใช่,2:ไม่ใช่"
"key":"การเงิน-วางแผน.IDENTIFY", "type":"text", "label":" ", "pretext":"ระบุ"

"key":"การเงิน-กังวล", "type":"radio", "label":"5.2.4 ท่านมีความกังวลเรื่องการเงินหรือไม่", "option":"1:ใช่,2:ไม่ใช่"
"key":"การเงิน-กังวล.IDENTIFY", "type":"text", "label":" ", "pretext":"ระบุ"



"key":"section.5.3", "subsection":"5.3 แหล่งสนับสนุนด้านผู้ดูแล"

"key":"ผู้ดูแลต่อเนื่อง", "question":"5.3.1 เมื่อท่านเจ็บป่วย ใครคือผู้ดูแลหลักสำหรับท่าน (สามารถตอบได้มากกว่า 1 ตำตอบ)", "type":"radio", "option":"2:มี,1:ไม่มี","display":"block"
"key":"ผู้ดูแลต่อเนื่อง-สามีภรรยา", "type":"checkbox", "label":" ", "option":"1:คู่สมรส"
"key":"ผู้ดูแลต่อเนื่อง-ลูกสาว", "type":"checkbox", "label":" ", "option":"1:บุตรสาว"
"key":"ผู้ดูแลต่อเนื่อง-ลูกชาย", "type":"checkbox", "label":" ", "option":"1:บุตรชาย"
"key":"ผู้ดูแลต่อเนื่อง-หลานสาว", "type":"checkbox", "label":" ", "option":"1:หลานสาว"
"key":"ผู้ดูแลต่อเนื่อง-หลานชาย", "type":"checkbox", "label":" ", "option":"1:หลานชาย"
"key":"ผู้ดูแลต่อเนื่อง-หลานเขย", "type":"checkbox", "label":" ", "option":"1:หลานเขย"
"key":"ผู้ดูแลต่อเนื่อง-หลานสะใภ้", "type":"checkbox", "label":" ", "option":"1:หลานสะใภ้"
"key":"ผู้ดูแลต่อเนื่อง-เพื่อนบ้าน", "type":"checkbox", "label":" ", "option":"1:เพื่อน"
"key":"ผู้ดูแลต่อเนื่อง-เจ้าหน้าที่บ้านพักผู้สูงอายุ", "type":"checkbox", "label":" ", "option":"1:เจ้าหน้าที่บ้านพักผู้สูงอายุ"
"key":"ผู้ดูแลต่อเนื่อง-เจ้าหน้าที่ด้านบริการสังคม", "type":"checkbox", "label":" ", "option":"1:เจ้าหน้าที่ด้านบริการสังคม"
"key":"ผู้ดูแลต่อเนื่อง-อสม.", "type":"checkbox", "label":" ", "option":"1:อาสาสมัครสาธารณสุขประจำหมู่บ้าน (อสม.)"
"key":"ผู้ดูแลต่อเนื่อง-สมาชิกครอบครัว", "type":"checkbox", "label":" ", "option":"1:สมาชิกครอบครัว"
"key":"ผู้ดูแลต่อเนื่อง-ผู้ดูแลอื่นๆ", "type":"checkbox", "label":" ", "option":"1:อื่นๆ"
"key":"ผู้ดูแลต่อเนื่อง-IDENTIFY", "type":"text", "label":" ", "pretext":"ระบุ"

"key":"ผู้ดูแล-ทำงาน", "label":"5.3.2 ผู้ดูแลหลักของท่านทำงานหรือไม่", "type":"radio", "option":"0:ไม่ทำ,1:ทำ","display":"block"
"key":"ผู้ดูแล-ทำงาน-ที่", "label":" ", "type":"radio", "option":"1:ทำงานนอกบ้าน,2:ทำงานที่บ้าน,99:อื่นๆ","display":"block"
"key":"ผู้ดูแล-ทำงาน-IDENTIFY", "type":"text", "label":" ", "pretext":"ระบุ"
"key":"ผู้ดูแล-ดูแลบ้าน", "label":"5.3.3 โดยปกติใครเป็นผู้ดูแลบ้าน เช่น ทำความสะอาด เป็นต้น", "type":"radio", "option":"1:ผู้สูงอายุ,1:บุคคลอื่น,3:ผู้สูงอายุ และบุคคลอื่นร่วมกัน","display":"block"



"key":"section.5.4", "subsection":"5.4 แหล่งสนับสนุนด้านจิตสังคม"

"key":"จิตสังคม-ทำงาน", "label":"5.4.1 ท่านมีบุคคลที่ไว้วางใจหรือไม่", "type":"radio", "option":"0:ไม่มี,1:มี","display":"block"
"key":"จิตสังคม-ทำงาน-IDENTIFY", "type":"text", "label":" ", "class":"-fill", "pretext":"ระบุ"

"key":"จิตสังคม-มีช่วยเหลือ", "label":"5.4.2 ท่านมีบุคคลที่ช่วยเหลือเกื้อหนุนด้านจิตใจ เมื่อท่านต้องการหรือไม่", "type":"radio", "option":"0:ไม่มี,1:มี","display":"block"
"key":"จิตสังคม-มีช่วยเหลือ-IDENTIFY", "type":"text", "label":" ", "class":"-fill", "pretext":"ระบุ","posttext":"(เป็นใคร และให้ความช่วยเหลือในด้านใด)"
	
"key":"จิตสังคม-มีพูดคุย", "label":"5.4.3 ท่านมีบุคคลที่สามารถพูดคุยด้วยเมื่อท่านเกิดความกังวลใจหรือไม่", "type":"radio", "option":"0:ไม่มี,1:มี","display":"block"
"key":"จิตสังคม-มีพูดคุย-IDENTIFY", "type":"text", "label":" ", "class":"-fill", "pretext":"ระบุ","posttext":"(เป็นใคร)"
	
"key":"จิตสังคม-มีเยี่ยมเยี่ยน", "label":"5.4.4 เมื่อท่านเจ็บป่วยมีบุคคลมาเยี่ยมเยียนท่านบ่อยๆ หรือไม่", "type":"radio", "option":"0:ไม่มี,1:มี","display":"block"
"key":"จิตสังคม-มีเยี่ยมเยี่ยน-IDENTIFY", "type":"text", "label":" ", "class":"-fill", "pretext":"ระบุ","posttext":"(เป็นใคร และความถี่)"

"key":"จิตสังคม-ร่วมศาสนา", "label":"5.4.5 ความบ่อยของการเข้าร่วมกิจกรรมทางศาสนา", "type":"radio", "option":"0:ไม่มี,1:มี","display":"block"
"key":"จิตสังคม-ร่วมศาสนา-IDENTIFY", "type":"textarea", "label":" ", "class":"-fill", "pretext":"ระบุ","posttext":"(ระบุกิจกรรมและความถี่)"
';
?>