<?php
function project_data_boardqt($self,$tpid=NULL) {
	$projectInfo = is_object($tpid) ? $tpid : R::Model('project.get', $tpid, '{initTemplate:true}');

	$tpid = $projectInfo->tpid;

	if (empty($projectInfo)) return message('error','ERROR : No Project');

	R::View('project.toolbar',$self, 'แบบสำรวจความคิดเห็นของกลไกคณะกรรมการหมู่บ้าน', NULL, $projectInfo);


	$ret.='<p class="notify">กำลังดำเนินการ</p>';

	$ret.='<h3>แบบสัมภาษณ์คณะกรรมการหมู่บ้านแบบสำรวจความคิดเห็นของกลไกคณะกรรมการหมู่บ้าน (ด้าน........................)<br />การดำเนินงานหมู่บ้าน/ชุมชนเข้มแข็ง มั่นคง มั่งคั่ง ยั่งยืน ประจำปี 2560</h3>

	<p><em>คำชี้แจง  แบบสอบถามมี 3 ส่วน คือ<br />
	ส่วนที่ 1 ข้อมูลทั่วไปของผู้ตอบแบบสอบถาม<br />
	ส่วนที่ 2 ผลการประเมินกลไกคณะกรรมการหมู่บ้าน<br />
	ส่วนที่ 3 ความคิดเห็นอื่นๆ (การดำเนินงาน ปัญหา ผลการดำเนินงานและข้อเสนอแนะ)<br />
เพื่อประโยชน์ในการขับเคลื่อนโครงการหมู่บ้านชุมชนเข้มแข็ง มั่นคง มั่งคั่ง ยั่งยืน ไปสู่ความสำเร็จอย่างยั่งยืนจึงใคร่ขอให้ท่านให้ความเห็นตามที่เป็นจริง</em></p>';

	$ret.='<h3>ส่วนที่ 1 ข้อมูลทั่วไปของผู้ตอบแบบสอบถาม</h3>
	<pre>
1.1 ท่านดำรงตำแหน่งในคณะกรรมหมู่บ้าน ด้านใด
 	  ด้านอำนวยการ
 	 ด้านการปกครองและรักษาความสงบเรียบร้อย
 	  ด้านแผนพัฒนาหมู่บ้าน
 	  ด้านส่งเสริมเศรษฐกิจ
 	  ด้านสังคมสิ่งแวดล้อมและสาธารณาสุข
 	  ด้านการศึกษา ศาสนาและวัฒนธรรม
 	  ด้านอื่นๆ ................................................................................

1.2  ท่านเป็นคณะกรรมการหมู่บ้านประเภทใด
	  โดยตำแหน่ง
	  โดยการคัดเลือก

1.3  เพศ
	  ชาย
	  หญิง

1.4  อายุ
	  18-30 ปี
	  31-40 ปี
	  41-50 ปี
	  51-60 ปี
	  60 ปี ขึ้นไป

1.5  ศาสนา
	  อิสลาม
	  พุทธ
	  คริสต์
	  อื่นๆ (ระบุ)...............................

1.6 สถานะในชุมชน
	  กลุ่มผู้นำท้องที่
	  กลุ่มผู้นำท้องถิ่น
	  กลุ่มผู้นำศาสนา
	  กลุ่มผู้นำทางธรรมชาติ
	 กลุ่มสตรี
	 กลุ่ม อสม.
	 กลุ่มเยาวชน 
	 อื่นๆ...............

1.7  อาชีพ (ท่านสามารถตอบได้มากกว่า 1 ข้อ)
	
	 1 อาชีพการเกษตร	
		  ทำนา
		  ทำสวนยางพารา
		  ทำสวนปาล์ม
		  ทำสวนไม้ผล
		  เลี้ยงสัตว์
		  อื่นๆ (ระบุ)...........
		
	 2 อาชีพประมง	
		  ประมงพื้นบ้านชายฝั่ง
		  ประมงเชิงพาณิชย์
		  ประมงน้ำจืด
		  เพาะเลี้ยงสัตว์น้ำ
		  อื่นๆ (ระบุ).................
	 3 รับจ้าง
	 4 ค้าขาย
	 5 ประกอบกิจการส่วนตัว
	 6 อื่นๆ (ระบุ)........................
		</pre>';

	$ret.='<h3>ส่วนที่ 2 ผลการประเมินกลไกคณะกรรมการหมู่บ้าน</h3>';

	$ret.='<pre>
รายการ 								ระดับความคิดเห็น
									มากที่สุด(5) มาก(4) ปานกลาง(3) น้อย(2) น้อยที่สุด(1)

2.1 ด้านความรู้ความเข้าใจ
	1. ท่านทราบถึงนโยบายของรัฐบาลในการแก้ไขปัญหาและพัฒนา จชต. มากน้อยเพียงใด 
	2. ท่านมีความรู้และเข้าใจบทบาทหน้าที่ของคณะกรรมการหมู่บ้านมากน้อยเพียงใด
	3. ท่านทราบเป้าหมาย/ผลลัพธ์ของ โครงการชุมชนเข้มแข็ง มั่นคง      มั่งคั่ง มากน้อยเพียงใด 
	4. ข้อเสนอแนะ………......................................................................….

2.2 ด้านการมีส่วนร่วม
	5. หมู่บ้านของท่านมีการจัดประชุมคณะกรรมการหมู่บ้านมากน้อยเพียงใด 
	6. ท่านมีส่วนร่วมในการเข้าประชุมคณะกรรมการหมู่บ้านมากน้อยเพียงใด
	7. มีหน่วยงาน/ส่วนราชการ เข้าร่วมในการประชุมคณะกรรมการหมู่บ้านมากน้อยเพียงใด
	8. ข้อเสนอแนะ............................................................................

2.3 ด้านประสิทธิภาพของกลไกคณะกรรมการหมู่บ้าน
	9. คณะทำงานมีการสำรวจและจัดทำฐานข้อมูลมากน้อยเพียงใด
	10. คณะทำงานได้เชิญผู้มีส่วนได้เสีย/ส่วนราชการ/หน่วยงานที่เกี่ยวข้อง เข้าร่วมประชุม วางแผน มากน้อยเพียงใด
	11. คณะทำงานมีการจัดทำแผนงาน/โครงการ/กิจกรรม เพื่อนำไปแก้ไขปัญหาและพัฒนาในหมู่บ้านมากน้อยเพียงใด
	12. คณะทำงานมีการบันทึกการประชุมมากน้อยเพียงใด
	13. คณะทำงานมีการบูรณาการและประสานงานกับหน่วยงาน/ส่วนราชการที่เกี่ยวข้องมากน้อยเพียงใด
	14. คณะทำงานมีการติดตามประเมินผลงานรายกิจกรรม/โครงการ ที่ดำเนินการ มากน้อยเพียงใด
	15 คณะทำงานของท่านมีการทบทวน/ปรับปรุง แผนงานโครงการมากน้อยเพียงใด
	16. คณะทำงานจัดให้มีการประชุมสรุปผลและจัดทำรายงานประจำปี พร้อมส่งให้กับ ศปก.อำเภอ และ ศอ.บต. เพื่อนำไปปรับปรุงและใช้ประโยชน์ 

2.4 ด้านการสร้างความเข้าใจกับประชาชนในพื้นที่ 
	17. คณะทำงานของท่านได้สร้างการรับรู้การปฏิบัติงานให้กับประชาชนได้รับทราบมากน้อยเพียงใด 
	18. คณะทำงานของท่านมีการประชาสัมพันธ์ตามช่องทางต่างๆในพื้นที่ เช่น เสียงตามสาย การติดประกาศ ฯ ได้รับทราบมากน้อยเพียงใด
	19. คณะทำงานของท่านได้เปิดโอกาสให้ประชาชนได้แสดงความคิดเห็น เช่น ผ่านตู้จดหมายชุมชน การเปิดเวทีรับฟังความคิดเห็น ฯ มากน้อยเพียงใด
	20. คณะทำงานของท่านเปิดโอกาสให้ประชาชนมีส่วนร่วมในกิจกรรมการจัดซื้อ จัดจ้าง และเป็นกรรมการตรวจสอบ/ตรวจรับ ฯ มากน้อยเพียงใด

21. ข้อเสนอแนะ..........................................................................................
	</pre>';


	$ret.='<h3>ส่วนที่ 3 ความคิดเห็นอื่นๆ (การดำเนินงาน ปัญหา ผลการดำเนินงาน และข้อเสนอแนะ)</h3>
	<pre>
กิจกรรมโดดเด่นที่ท่านมีความภาคภูมิใจ ได้แก่   ............................................................................................................................................................................­............................................................................................................................................................................
2. บุคคลดีเด่นที่สามารถเป็นต้นแบบในการถ่ายทอดให้กับบุคคลภายนอกได้ ได้แก่
    2.1 ชื่อสกุล.......................................  ต้นแบบเรื่อง........................................ หมายเลขโทรศัพท์........   
    2.2 ชื่อสกุล.......................................  ต้นแบบเรื่อง........................................ หมายเลขโทรศัพท์........   
ฯลฯ
3. ปัญหาอุปสรรค
............................................................................................................................................................................
4. แนวทางการแก้ไข
............................................................................................................................................................................
5. ข้อเสนอแนะอื่นๆ
............................................................................................................................................................................
............................................................................................................................................................................



ขอขอบคุณในความกรุณากรอกแบบสอบถาม
ชื่อผู้เก็บข้อมูล...............................................
								   (..............................................)
							วันที่.........เดือน...................พ.ศ............
							</pre>';

	return $ret;
}
?>