<?php
/**
* Module Method
*
* @param Object $self
* @param Int $var
* @return String
*/

$debug = true;

function paper_help($self) {
	$ret.='<h3>วิธีสร้างหัวข้อใหม่</h3><ol><li>เลือกการสร้างหัวข้อใหม่จากเมนู สมาชิก/สร้างเนื้อหาใหม่</li><li>ป้อนหัวข้อ/รายละเอียด</li><li>เลือกแท็บ ภาพประกอบ เพื่อส่งภาพ</li><li>เลือกแท็บ เอกสารประกอบ เพื่อส่งเอกสารประกอบหัวข้อ</li><li>เลือกแท็บ รูปแบบข้อมูล เพื่อกำหนดรูปแบบของหัวข้อ</li><li>เลือกแท็บ ตัวเลือก เพื่อกำหนดตัวเลือก</li><li>คลิก Save/บันทึก</li></ol>';
	$ret.='<h3>วิธีแก้ไขหัวข้อ</h3><ol><li>เปิดอ่านหัวข้อที่ต้องการแก้ไข</li><li>เลือกเมนู แก้ไข <img src="/library/img//edit.png" alt="แก้ไข" />/จัดการเอกสาร เพื่อจัดการเอกสาร</li><li>เลือกเมนู แก้ไข <img src="/library/img//edit.png" alt="แก้ไข" />/รายละเอียด เพื่อแก้ไขหัวข้อและรายละเอียด</li><li>เลือกเมนู แก้ไข <img src="/library/img//edit.png" alt="แก้ไข" />/ภาพประกอบ เพื่อส่งภาพเพิ่มเติม, เปลี่ยนภาพ หรือ ลบภาพประกอบหัวข้อ</li><li>เลือกเมนู แก้ไข <img src="/library/img//edit.png" alt="แก้ไข" />/เอกสารประกอบ เพื่อส่งเอกสารเพิ่มเติม หรือลบเอกสาร</li><li>เลือกเมนู แก้ไข <img src="/library/img//edit.png" alt="แก้ไข" />/รูปแบบการแสดงผล เพื่อปรับเปลี่ยนรูปแบบของการแสดงผล เช่นการแสดงภาพ</li><li>เลือกเมนู แก้ไข <img src="/library/img//edit.png" alt="แก้ไข" />/จัดการหมวด เพื่อ เพิ่ม/ลบหมวดหรือแท็กของหัวข้อ</li><li>เลือกเมนู แก้ไข <img src="/library/img//edit.png" alt="แก้ไข" />/สร้างแบบสำรวจความคิดเห็น เพื่อสร้างหรือแก้ไขรายการของแบบสอบถาม</li><li>เลือกเมนู แก้ไข <img src="/library/img//edit.png" alt="แก้ไข" />/ไม่ให้มีการแสดงความคิดเห็น เพื่อกำหนดให้มีการแสดงความคิดเห็นหรือไม่ให้แสดงความคิดเห็น</li></ol>';
	$ret.='<h3>วิธีลบหัวข้อ</h3><ol><li>เปิดอ่านหัวข้อที่ต้องการลบ</li><li>คลิกปุ่มลบ หรือ <img src="/library/img//delete.png" alt="Delete" /> เพื่อลบหัวข้อ</li><li>ตอบยืนยันในการบล</li><li>คำเตือน ไฟล์ภาพ,ไฟลเอกสาร และไฟล์ต่าง ๆ ที่เกี่ยวข้องกับห้วข้อนี้จะถูกลบทิ้งทั้งหมดและไม่สามารถเรียกกลับได้อีก</li></ol>';
	return $ret;
}
?>