<?php
/**
* Project :: Month Result
* Created 2020-01-25
* Modify  2020-01-25
*
* @param Object $self
* @param Object $projectInfo
* @return String
*
* @usage project/{id}/result.month
*/

$debug = true;

function project_result_month($self, $projectInfo) {
	$ret = '';

	new Toolbar($self, 'ปิดงวดเดือน', 'follow', $projectInfo);

	$tables = new Table();
	$tables->thead = array(
		'งวดเดือน',
		'icons -to -nowrap -center' => 'มอบหมายงาน',
		'icons -kpi -nowrap -center' => 'ตัวชี้วัด',
		'icons -send  -nowrap -center' => 'ส่งรายงาน',
		'icons -check -nowrap -center' => 'ตรวจรายงาน',
	);
	for ($i=1; $i<=12;$i++) {
		$tables->rows[] = array(
			sg_date('2021-'.$i.'-01','ดดด ปปปป'),
			'<i class="icon -material -gray">check_circle</i>',
			'<i class="icon -material -gray">check_circle</i>',
			'<i class="icon -material -gray">check_circle</i>',
			'<i class="icon -material -gray">check_circle</i>',
		);
	}
	$ret .= $tables->build();

	$ret .= '<pre><h3>แบบมอบหมายแผนการปฎิบัติงาน ให้ผู้ถูกจ้างงาน
เดือน.......................... 
โครงการยกระดับเศรษฐกิจและสังคมรายตำบลแบบบูรณาการ (1 ตำบล 1 มหาวิทยาลัย)</h3>

1. มอบหมายให้.......ชื่อ – สกุล .........................................
2. รายละเอียดภาระกิจแต่ล่ะด้านที่ต้องการ ให้ปฏิบัติงาน   

รายละเอียดการปฏิบัติงาน
เป้าหมาย(จำนวน)
หมายเหตุ
การวิเคราะห์ข้อมูล (Data Analytics)
1.
2.
3.
การเฝ้าระวัง ประสานงานและติดตามข้อมูลสถานการณ์การระบาดของ COVID-19 และโรคระบาดใหม่
1.
2.
3.
การจัดทำข้อมูลราชการในพื้นที่เป็นข้อมูลอิเล็กทรอนิกส์ (Digitalizing Government Data)
1.
2.
3.
การพัฒนาสัมมาชีพและสร้างอาชีพใหม่ (การยกระดับสินค้า OTOP/อาชีพอื่นๆ) การสร้างและพัฒนา Creative Economy (การยกระดับการท่องเที่ยว) การนำองค์ความรู้ไปช่วยบริการชุมชน (Health Care/เทคโนโลยีด้านต่างๆ) และการส่งเสริมด้านสิ่งแวดล้อม/Circular Economy (การเพิ่มรายได้หมุนเวียนให้แก่ชุมชน) ให้แก่ชุมชน
1.
2.
3.
การพัฒนาทักษะอาชีพใหม่จากความหลากหลายทางชีวภาพและความหลากหลายทางวัฒนธรรมของชุมชน
1.
2.
3.
การพัฒนาทักษะอาชีพใหม่จากความหลากหลายทางชีวภาพและความหลากหลายทางวัฒนธรรมของชุมชน
1.
2.
3.

3. แนะนำให้เพิ่มหรือส่ง เข้าฝึกอบรมทักษะ ในด้าน..ระบุรายละเอียด
• Digital Literacy,
• English Competency, 
• Financial Literacy
• Social Literacy
.............................................
.............................................
.............................................
4. งานอื่นๆ ที่มอบหมาย
.............................................
.............................................
.............................................
</pre>';

	$ret .= '<pre>
<h3>Tambon System Integrator - 14 ตัวชี้วัด</h3>
01 โจทย์การพัฒนาเพื่อแก้ไขปัญหาความยากจนตาม 16 เป้าหมาย
02 โครงการพัฒนาตำบลแบบกำหนดประชากรเป้าหมาย
03 ผู้ที่เป็นผู้ปฏิบัติการหลัก (Key actors) และ ผู้ขับเคลื่อนปฏิบัติการในพื้นที่
04 เทคโนโลยีและเครื่องมือที่ใช้ได้ผลดี
05 นวัตกรรมการแก้ปัญหา (เชิงระบบ เชิงกระบวนการ เชิงเทคนิค)
06 การมีส่วนร่วมของประชากรกลุ่มเป้าหมายและ 4 องค์กรหลัก
07 ผลการมีส่วนร่วมในการแก้ปัญหาของกลุ่มประชากรเป้าหมาย
08 เรื่องเด่น (กิจกรรม บริการ ผลิตภัณฑ์ ผลผลิต)
09 คนเด่น (Champions)
10 ข้อมูล (การส ารวจการเฝ้าระวัง COVID-19 และ Community Data)
11 การส่งเสริมการสร้างธุรกิจใหม่ (Start-up / Social Enterprise)
12 รูปแบบการแก้ปัญหาความยากจนในระดับต าบลจากการสรุปบทเรียนและประสบการณ์ในโครงการ
13 รูปแบบการบริหารจัดการทรัพยากรบุคคลและองค์กรภายในต าบลเพื่อแก้ปัญหาความยากจน (Resource Mobilization)
14 แหล่งเรียนรู้ และหลักสูตรการเรียนรู้ของชุมชนที่มาจากเรื่องเด่น คนเด่น จนได้รับการยอมรับเป็นศูนย์เรียนรู้ด้านการแก้ปัญหาความยากจน
</pre>';


	$ret .= '<pre><h3>แบบรายงานการปฏิบัติงานของผู้ถูกจ้างงาน</h3>
เดือน..........................
โครงการยกระดับเศรษฐกิจและสังคมรายตำบลแบบบูรณาการ (1 ตำบล 1 มหาวิทยาลัย)
มหาวิทยาลัย ........................................................................
ตำบล ....................................................................................
รายงาน ณ วันที่ ............... เดือน ..................... พ.ศ. ..................
1. ชื่อ – สกุล ................................................................................
2. ผลการปฏิบัติงาน  
จำนวนวัน  ที่ปฎิบัติงาน .......................
จำนวนงานที่ได้รับมอบหมาย.................
จำนวนครั้ง ที่กิจกรรมที่ทำ  ......................
 
<table class="item" border="1">
<thead>
<tr><th rowspan="2">ลำดับ</th><th colspan="4">ผลการปฏิบัติงาน</th><th rowspan="2">หมายเหตุ</th></tr>
<tr><th>รายละเอียดการปฏิบัติงาน</th><th>ต่ำกว่าแผน</th><th>ตามแผน</th><th>สูงกว่าแผน</th></tr>
</thead>
<tbody>
<tr><td>1.</td><td>...</td><td>...</td><td>...</td><td>...</td><td>...</td></tr>
<tr><td>2.</td><td>...</td><td>...</td><td>...</td><td>...</td><td>...</td></tr>
<tr><td>3.</td><td>...</td><td>...</td><td>...</td><td>...</td><td>...</td></tr>
</tbody>
</table>
 
 
3. การฝึกอบรมทักษะ ในด้านต่างๆ (ระบุรายละเอียด)
o   Digital Literacy,
o   English Competency,
o   Financial Literacy
o   Social Literacy
..........................................................
..........................................................

4. สิ่งที่ได้เรียนรู้ เพิ่มเติม ในด้านต่างๆ (ระบุรายละเอียด)
o   Digital Literacy,
o   English Competency,
o   Financial Literacy
o   Social Literacy
..........................................................
..........................................................

5. แผนปฏิบัติงานต่อไป
..........................................................
..........................................................

ขอรับรองว่าได้ปฏิบัติงานดังกล่าวข้างต้นในเดือน ....................... พ.ศ. ............ จริงทุกประการ
 


 ลงชื่อ............................
 (...............................)
             	ผู้รับจ้าง
วันที่ .............................





 ลงชื่อ............................
 (...............................)
        ผู้ควบคุมการปฏิบัติงาน
วันที่ .............................
</pre>';
	return $ret;
}
?>