<?php
/**
* iMed :: Quatation of ICF (International Classification of Functioning) , Disability and Health
* แบบประเมินระดับความสามารถตามประเภทความพิการ และการให้รหัส ICF(International Classification of Functioning , Disability and Health)
*
* Created 2020-02-13
* Modify  2021-05-28
*
* @param Object $self
* @param Int $var
* @return String
*/

$debug = true;

import('model:imed.visit');

function imed_visit_form_disability($self, $psnId, $seqId) {
	$psnInfo = is_object($psnId) ? $psnId : R::Model('imed.patient.get', $psnId, '{}');
	$psnId = $psnInfo->psnId;

	$visitInfo = ImedVisitModel::get($psnId, $seqId);

	$isEdit = is_admin('imed') || $visitInfo->uid == i()->uid;

	if (!$isEdit) return message('error','Access denied');

	$data = mydb::select('SELECT * FROM %imed_barthel% WHERE `seq` = :seq LIMIT 1',':seq',$seqId);

	//$ret .= print_o($data,'$data');

	$ui = new Ui();
	// if ($isEdit && $data->seq) $ui->add('<a class="sg-action" href="'.url('imed/api/visit/'.$psnId.'/qt.disability.delete/'.$seqId).'" data-rel="none" data-done="close | load:#imed-visit-'.$seqId.':'.url('imed/visit/'.$psnId.'/item/'.$seqId, ['ref' => $this->refApp]).'" data-title="ลบดัชนีบาร์เธล" data-confirm="ต้องการลบดัชนีบาร์เธล กรุณายืนยัน?"><i class="icon -material">delete</i></a>');
	$ret .= '<header class="header"><nav class="nav -back"><a class="sg-action" href="javascript:void(0)" data-rel="close"><i class="icon -material">arrow_back</i></a></nav><h3>แบบประเมินระดับความสามารถตามประเภทความพิการ</h3><nav class="nav">'.$ui->build().'</nav></header>';

	$qtList = '
	[
		{
			"title": "ความพิการทางการเห็น ประเมินสมรรถภาพคนพิการตามแนวทางของ ICF",
			"items": {
				"b210": "การทำงานของการเห็น",
				"d460": "การเคลื่อนที่ไปในที่ต่างๆ",
				"d470": "การใช้การขนส่ง",
				"d570": "การรักษาสุขภาพตัวเอง",
				"d630": "การเตรียมอาหาร",
				"d640": "การทำงานบ้าน",
				"d839": "การศึกษา",
				"d870": "การพึ่งพาตนเองทางเศรษฐกิจ",
				"d910": "ชีวิตในชุมชน",
				"d920": "นันทนาการและกิจกรรมยามว่าง"
			}
		},
		{
			"title": "ความพิการทางการได้ยิน ประเมินสมรรถภาพคนพิการตามแนวทางของ ICF",
			"items": {
				"b230": "การทำงานด้านการได้ยิน",
				"d115": "การฟัง",
				"d310": "การรับการสื่อสารด้วยข้อความภาษาพูด",
				"d320": "การรับการสื่อสารด้วยข้อความภาษามือที่เป็นทางการ",
				"d340": "การสร้างข้อความที่เป็นภาษามือแบบเป็นทางการ",
				"d839": "การศึกษา",
				"d870": "การพึ่งพาตนเองทางเศรษฐกิจ",
				"d920": "นันทนาการและกิจกรรมยามว่าง"
			}
		},
		{
			"title": "ความพิการทางการสื่อความหมาย ประเมินสมรรถภาพคนพิการตามแนวทางของ ICF",
			"items": {
				"b310": "การทำงานที่ก่อให้เกิดเสียง",
				"b320": "การทำงานด้านการออกเสียงพูด",
				"b330": "การทำงานด้านความคล่องและจังหวะของการพูด",
				"d330": "การพูด",
				"d350": "การสนทนา",
				"d839": "การศึกษา",
				"d870": "การพึ่งพาตนเองทางเศรษฐกิจ",
				"d920": "นันทนาการและกิจกรรมยามว่าง"
			}
		},
		{
			"title": "ความพิการทางการเคลื่อนไหว ประเมินสมรรถภาพคนพิการตามแนวทางของ ICF",
			"items": {
				"d420": "การเคลื่อนย้ายตัวเอง",
				"d450": "การเดิน",
				"d465": "การเคลื่อนที่โดยใช้อุปกรณ์",
				"d510": "การทำความสะอาดร่างกายตนเอง",
				"d530": "การดูแลการกำจัดของเสียออกจากร่างกาย",
				"d540": "การแต่งตัว",
				"d550": "การรับประทานอาหาร",
				"d839": "การศึกษา",
				"d870": "การพึ่งพาตนเองทางเศรษฐกิจ",
				"d920": "นันทนาการและกิจกรรมยามว่าง"
			}
		},
		{
			"title": "ความพิการทางร่างกาย ประเมินสมรรถภาพคนพิการตามแนวทางของ ICF",
			"items": {
				"d620": "การหาซื้อสินค้าและบริการ",
				"d740": "สัมพันธภาพที่เป็นทางการ",
				"d839": "การศึกษา",
				"d870": "การพึ่งพาตนเองทางเศรษฐกิจ",
				"d920": "นันทนาการและกิจกรรมยามว่าง"
			}
		},
		{
			"title": "ความพิการทางจิตใจหรือพฤติกรรม ประเมินสมรรถภาพคนพิการตามแนวทางของ ICF",
			"items": {
				"d155": "การได้รับทักษะจากการเรียนรู้",
				"d350": "การสนทนา",
				"d510": "การทำความสะอาดร่างกายตนเอง",
				"d570": "การดูแลสุขภาพตัวเอง",
				"d640": "การทำงานบ้าน",
				"d720": "ปฏิสัมพันธ์ระหว่างบุคคลที่ซับช้อน",
				"d750": "สัมพันธภาพทางสังคมที่ไม่เป็นทางการ",
				"d845": "การได้ทำงาน รักษางานที่ทำอยู่ และยุติการทำงาน",
				"d920": "นันทนาการและกิจกรรมยามว่าง"
			}
		},
		{
			"title": "ความพิการออทิสติก ประเมินสมรรถภาพคนพิการตามแนวทางของ ICF",
			"items": {
				"d310": "การรับการสื่อสารด้วยข้อความภาษาพูด",
				"d315": "การรับการสื่อสารด้วยข้อความที่ไม่ใช่ภาษาพูด",
				"d330": "การพูด",
				"d350": "การสนทนา",
				"d710": "ปฏิสัมพันธ์ระหว่างบุคคลขั้นพื้นฐาน",
				"d720": "ปฏิสัมพันธ์ระหว่างบุคคลที่ซับช้อน",
				"d920": "นันทนาการและกิจกรรมยามว่าง"
			}
		},
		{
			"title": "ความพิการทางสติปัญญา ประเมินสมรรถภาพคนพิการตามแนวทางของ ICF",
			"items": {
				"b117": "การทำงานด้านสติปัญญา",
				"d131": "การเรียนรู้ผ่านการเชื่อมโยงกับสิ่งของหรือของเล่น",
				"d140": "การเรียนรู้ในการอ่าน",
				"d310": "การรับการสื่อสารด้วยข้อความภาษาพูด",
				"d330": "การพูด",
				"d510": "การทำความสะอาดร่างกายตนเอง",
				"d530": "การดูแลการกำจัดของเสียออกจากร่างกาย",
				"d550": "การรับประทานอาหาร",
				"d640": "การทำงานบ้าน",
				"d920": "นันทนาการและกิจกรรมยามว่าง"
			}
		},
		{
			"title": "ความพิการทางการเรียนรู้ ประเมินสมรรถภาพคนพิการตามแนวทางของ ICF",
			"items": {
				"b140": "การทำงานด้านความสนใจ",
				"d140": "การเรียนรู้ในการอ่าน",
				"d145": "การเรียนรู้ในการเขียน",
				"d150": "การเรียนรู้ในการคำนวณ",
				"d720": "ปฏิสัมพันธ์ระหว่างบุคคลที่ซับซ้อน",
				"d810": "การศึกษานอกระบบ",
				"d820": "การศึกษาในโรงเรียน"
			}
		}
	]
';


	$qtList = json_decode($qtList);
	//$ret .= print_o(json_decode($qtList), '$qtList');


	$ret .= '<section><h4>แบบประเมินระดับความสามารถตามประเภทความพิการ</h4>';
	$form=new Form('data',url('imed/visit/'.$psnId.'/qt.disability.save/'.$seqId),NULL,'sg-form');
	$form->addData('rel','none');
	$form->addData('done', 'back | load:#imed-visit-'.$seqId.':'.url('imed/visit/'.$psnId.'/item/'.$seqId,['ref' => post('ref')]));

	$form->addField('seq',array('type'=>'hidden','value'=>$seqId));
	$form->addField('ref',array('type'=>'hidden','name'=>'ref','value'=>post('ref')));

	$tables = new Table();
	$tables->addConfig('showHeader', false);
	$tables->thead = array(
		'no'=>'',
		'<th colspan="2">ระดับความบกพร่องในการทำงานของร่างกาย/ความลำบากในการทำกิจกรรม</th>',
		'.0','.1','.2','.3','.4','.8','.9'
	);
	foreach ($qtList as $qtItem) {
		$tables->rows[] = array('<td colspan="10"><h5>'.$qtItem->title.'</h5></td>');
		$tables->rows[] = '<header>';
		$no = 0;
		foreach ($qtItem->items as $qtKey=>$qtNo) {
			$row = array(++$no, $qtKey, $qtNo);
			foreach (array(0,1,2,3,4,8,9) as $value) {
				$row[] = '<label><input type="radio" /><i class="icon -material -unchecked">check_circle</i></label>';
			}

			$tables->rows[] = $row;
		}
	}

	$form->addText($tables->build());



/*
	$form->addField(
					'qt01',
					array(
						'label'=>'1. การรับประทานอาหารเมื่อเตรียมสำรับไว้ให้เรียบร้อยต่อหน้า',
						'type'=>'radio',
						'options'=>array(
												0=>'0 = ไม่สามารถตักอาหารเข้าปากได้',
												1=>'1 = ตักอาหารเองได้ แต่ต้องมีคนช่วย เช่น ช่วยใช้ช้อนตักเตรียมไว้ให้ หรือตัดเป็นชิ้นเล็ก ๆ ไว้ล่วงหน้า',
												2=>'2 = ตักอาหารและช่วยตัวเองได้เป็นปกติ'
												),
						'value'=>$data->qt01===NULL?-1:$data->qt01,
						)
					);
	$form->addField(
					'qt02',
					array(
						'label'=>'2. การล้างหน้าหวีผม โกนหนวด ในระยะ 24-48 ชั่วโมงที่ผ่านมา',
						'type'=>'radio',
						'options'=>array(
												0=>'0 = ต้องการความช่วยเหลือ',
												1=>'1 = ทำได้เอง (รวมทั้งที่ทำได้เองถ้าเตรียมอุปกรณ์ไว้ให้'
												),
						'value'=>$data->qt02===NULL?-1:$data->qt02,
						)
					);
	$form->addField(
					'qt03',
					array(
						'label'=>'3. การขึ้น/ลงเตียงหรือลุกนั่งจากที่นอนไปยังเก้าอี้ได้',
						'type'=>'radio',
						'options'=>array(
												0=>'0 = ไม่สามารถนั่งได้ (นั่งแล้วจะล้มลงเสมอ) หรือต้องใช้คนสองคนช่วยกันยกขึ้น',
												1=>'1 = ต้องการความช่วยเหลืออย่างมากจึงจะนั่งได้ เช่น ต้องใช้คนที่แข็งแรงหรือมีทักษะ 1 คน หรือใช้คนทั่วไปช่วยพยุงหรือดันขึ้นมาจึงจะนั่งอยู่ได้',
												2=>'2 = ต้องการความช่วยเหลือบ้าง เช่น บอกให้ทำตามหรือช่วยพยุงเล็กน้อย หรือต้องมีคนดูแลเพื่อความปลอดภัย',
												3=>'3 = ทำได้เอง'),
						'value'=>$data->qt03===NULL?-1:$data->qt03,
						)
					);
	$form->addField(
					'qt04',
					array(
						'label'=>'4. การใช้ห้องน้ำสุขา',
						'type'=>'radio',
						'options'=>array(
												0=>'0 = ช่วยตัวเองไม่ได้',
												1=>'1 = ทำเองได้บ้าง (อย่างน้อยทำความสะอาดตัวเองได้หลังจากเสร็จธุระ) แต่ต้องการความช่วยเหลือในบางสิ่ง',
												2=>'2 = ช่วยตนเองได้ดี (ขึ้นนั่งและลงจากโถส้วมเอง ทำความสะอาดตัวเองได้เรียบร้อยหลังจากเสร็จธุระ ถอดใส่เสื้อผ้าได้เรียบร้อย)'
												),
						'value'=>$data->qt04===NULL?-1:$data->qt04,
						)
					);
	$form->addField(
					'qt05',
					array(
						'label'=>'5. การเคลื่อนที่ภายในห้องหรือบ้าน',
						'type'=>'radio',
						'options'=>array(
												0=>'0 = เคลื่อนที่ไหนไม่ได้',
												1=>'1 = ต้องใช้รถเข็นช่วยตัวเองให้เคลื่อนที่ได้ และจะต้องเข้าออกมุมห้องหรือประตูได้ (ไม่ต้องมีคนเข็น)',
												2=>'2 = เดินหรือเคลื่อนที่โดยมีคนช่วย เช่น พยุง หรือบอกให้ทำตาม หรือต้องให้ความสนใจดูแลเพื่อความปลอดภัย',
												3=>'3 = เดินหรือเคลื่อนที่ได้เอง'
												),
						'value'=>$data->qt05===NULL?-1:$data->qt05,
						)
					);
	$form->addField(
					'qt06',
					array(
						'label'=>'6. การสวมใส่/ถอดเสื้อผ้า',
						'type'=>'radio',
						'options'=>array(
												0=>'0 = ต้องมีคนส่วมใส่ให้ ช่วยตนเองไม่ได้',
												1=>'1 = ช่วยตัวเองได้รายร้อยละ 50 ที่เหลือต้องมีคนช่วย',
												2=>'2 = ช่วยตัวเองได้ดี (รวมทั้งการติดกระดุม รูดซิปหรือใช้เสื้อผ้าที่ดัดแปลงให้เหมาะสมก็ได้)'
												),
						'value'=>$data->qt06===NULL?-1:$data->qt06,
						)
					);
	$form->addField(
					'qt07',
					array(
						'label'=>'7. การขึ้นลงบันได',
						'type'=>'radio',
							'options'=>array(
												0=>'0 = ไม่สามารถทำได้',
												1=>'1 = ต้องการคนช่วย',
												2=>'2 = ขึ้นลงได้เอง (ถ้าต้องใช้เครื่องช่วยเดิน เช่น Walker จะต้องเอาขึ้นลงได้ด้วย)'
												),
					'value'=>$data->qt07===NULL?-1:$data->qt07,
						)
					);
	$form->addField(
					'qt08',
					array(
						'label'=>'8. การอาบน้ำ',
						'type'=>'radio',
						'options'=>array(
												0=>'0 = ต้องมีคนช่วยหรือทำให้',
												1=>'1 = อาบน้ำเองได้'
												),
						'value'=>$data->qt08===NULL?-1:$data->qt08,
						)
					);
	$form->addField(
					'qt09',
					array(
						'label'=>'9. การกลั้นการถ่ายอุจจาระในระยะ 1 สัปดาห์ที่ผ่านมา',
						'type'=>'radio',
						'options'=>array(
												0=>'0 = กลั้นไม่ได้หรือต้องการการสวนอุจจาระอยู่เสมอ',
												1=>'1 = กลั้นไม่ได้เป็นครั้งคราว (เป็นน้อยกว่า 1 ครั้งต่อสัปดาห์)',
												2=>'2 = กลั้นได้เป็นปกติ'
												),
						'value'=>$data->qt09===NULL?-1:$data->qt09,
						)
					);
	$form->addField(
					'qt10',
					array(
						'label'=>'10. การกลั้นปัสสาวะในระยะ 1 สัปดาห์ที่ผ่านมา',
						'type'=>'radio',
						'options'=>array(
												0=>'0 = กลั้นไม่ได้หรือต้องการการสวนปัสสาวะอยู่เสมอ',
												1=>'1 = กลั้นไม่ได้เป็นครั้งคราว (เป็นน้อยกว่าวันละ 1 ครั้ง)',
												2=>'2 = กลั้นได้เป็นปกติ'
												),
						'value'=>$data->qt10===NULL?-1:$data->qt10,
						)
					);
*/
	$form->addField(
						'save',
						array(
							'type'=>'button',
							'value'=>'<i class="icon -save -white"></i><span>บันทึก</span>',
							'pretext'=>'<a class="sg-action btn -link -cancel" href="javascript:void(0)" data-rel="close"><i class="icon -cancel -gray"></i><span>{tr:CANCEL}</span></a>',
							'container' => array('class'=>'-sg-text-right'),
							)
						);
	$ret.=$form->build();

	//$ret.=print_o($data,'$data');
	$ret .= '</section>';

	$ret.='<style type="text/css">
	label.option {padding-left:16px;}
	</style>';


	return $ret;
}
?>